HloModule cluster_35__XlaCompiledKernel_true__XlaNumConstantArgs_2__XlaNumResourceArgs_0_.56

%fused_computation.3 (param_0.7: s32[3,1], param_1.7: s32[], param_2.8: s32[], param_3.8: s32[], param_4.10: s32[]) -> (pred[3], pred[3], pred[3], pred[3]) {
  %param_0.7 = s32[3,1]{1,0} parameter(0)
  %param_1.7 = s32[] parameter(1)
  %broadcast.11 = s32[3,1]{1,0} broadcast(s32[] %param_1.7), dimensions={}, metadata={op_type="GreaterEqual" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/GreaterEqual"}
  %compare.7 = pred[3,1]{1,0} compare(s32[3,1]{1,0} %param_0.7, s32[3,1]{1,0} %broadcast.11), direction=GE, metadata={op_type="GreaterEqual" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/GreaterEqual"}
  %bitcast.7 = pred[3]{0} bitcast(pred[3,1]{1,0} %compare.7), metadata={op_type="GreaterEqual" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/GreaterEqual"}
  %param_2.8 = s32[] parameter(2)
  %broadcast.10.clone.1 = s32[3,1]{1,0} broadcast(s32[] %param_2.8), dimensions={}, metadata={op_type="Equal" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/Equal_1"}
  %compare.6.clone.1 = pred[3,1]{1,0} compare(s32[3,1]{1,0} %param_0.7, s32[3,1]{1,0} %broadcast.10.clone.1), direction=EQ, metadata={op_type="Equal" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/Equal_1"}
  %bitcast.6.clone.1 = pred[3]{0} bitcast(pred[3,1]{1,0} %compare.6.clone.1), metadata={op_type="Equal" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/Equal_1"}
  %param_3.8 = s32[] parameter(3)
  %broadcast.9.clone.1 = s32[3,1]{1,0} broadcast(s32[] %param_3.8), dimensions={}, metadata={op_type="Equal" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/Equal"}
  %compare.5.clone.1 = pred[3,1]{1,0} compare(s32[3,1]{1,0} %param_0.7, s32[3,1]{1,0} %broadcast.9.clone.1), direction=EQ, metadata={op_type="Equal" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/Equal"}
  %bitcast.5.clone.1 = pred[3]{0} bitcast(pred[3,1]{1,0} %compare.5.clone.1), metadata={op_type="Equal" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/Equal"}
  %param_4.10 = s32[] parameter(4)
  %broadcast.8.clone.1 = s32[3,1]{1,0} broadcast(s32[] %param_4.10), dimensions={}, metadata={op_type="LessEqual" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/LessEqual"}
  %compare.4.clone.1 = pred[3,1]{1,0} compare(s32[3,1]{1,0} %param_0.7, s32[3,1]{1,0} %broadcast.8.clone.1), direction=LE, metadata={op_type="LessEqual" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/LessEqual"}
  %bitcast.4.clone.1 = pred[3]{0} bitcast(pred[3,1]{1,0} %compare.4.clone.1), metadata={op_type="LessEqual" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/LessEqual"}
  ROOT %tuple.2 = (pred[3]{0}, pred[3]{0}, pred[3]{0}, pred[3]{0}) tuple(pred[3]{0} %bitcast.7, pred[3]{0} %bitcast.6.clone.1, pred[3]{0} %bitcast.5.clone.1, pred[3]{0} %bitcast.4.clone.1)
}

%fused_computation.4 (param_0.11: f32[3,4], param_1.11: f32[], param_2.5: f32[], param_3.5: f32[], param_4.7: f32[]) -> s32[3,1] {
  %param_4.7 = f32[] parameter(4)
  %broadcast.15 = f32[3,1]{1,0} broadcast(f32[] %param_4.7), dimensions={}, metadata={op_type="Add" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/add_1"}
  %param_3.5 = f32[] parameter(3)
  %broadcast.14 = f32[3,1]{1,0} broadcast(f32[] %param_3.5), dimensions={}, metadata={op_type="Mul" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/mul_1"}
  %param_2.5 = f32[] parameter(2)
  %broadcast.13 = f32[3,1]{1,0} broadcast(f32[] %param_2.5), dimensions={}, metadata={op_type="Add" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/add"}
  %param_1.11 = f32[] parameter(1)
  %broadcast.12 = f32[3,1]{1,0} broadcast(f32[] %param_1.11), dimensions={}, metadata={op_type="Mul" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/mul"}
  %param_0.11 = f32[3,4]{1,0} parameter(0)
  %slice.3 = f32[3,1]{1,0} slice(f32[3,4]{1,0} %param_0.11), slice={[0:3], [3:4]}, metadata={op_type="Split" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/area/split"}
  %slice.2 = f32[3,1]{1,0} slice(f32[3,4]{1,0} %param_0.11), slice={[0:3], [1:2]}, metadata={op_type="Split" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/area/split"}
  %subtract.1 = f32[3,1]{1,0} subtract(f32[3,1]{1,0} %slice.3, f32[3,1]{1,0} %slice.2), metadata={op_type="Sub" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/area/sub"}
  %slice.1 = f32[3,1]{1,0} slice(f32[3,4]{1,0} %param_0.11), slice={[0:3], [2:3]}, metadata={op_type="Split" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/area/split"}
  %slice.0 = f32[3,1]{1,0} slice(f32[3,4]{1,0} %param_0.11), slice={[0:3], [0:1]}, metadata={op_type="Split" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/area/split"}
  %subtract.0 = f32[3,1]{1,0} subtract(f32[3,1]{1,0} %slice.1, f32[3,1]{1,0} %slice.0), metadata={op_type="Sub" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/area/sub_1"}
  %multiply.4 = f32[3,1]{1,0} multiply(f32[3,1]{1,0} %subtract.1, f32[3,1]{1,0} %subtract.0), metadata={op_type="Mul" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/area/mul"}
  %sqrt.1 = f32[3,1]{1,0} sqrt(f32[3,1]{1,0} %multiply.4), metadata={op_type="Sqrt" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/Sqrt"}
  %multiply.3 = f32[3,1]{1,0} multiply(f32[3,1]{1,0} %broadcast.12, f32[3,1]{1,0} %sqrt.1), metadata={op_type="Mul" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/mul"}
  %add.3 = f32[3,1]{1,0} add(f32[3,1]{1,0} %broadcast.13, f32[3,1]{1,0} %multiply.3), metadata={op_type="Add" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/add"}
  %log.1 = f32[3,1]{1,0} log(f32[3,1]{1,0} %add.3), metadata={op_type="Log" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/Log"}
  %multiply.2 = f32[3,1]{1,0} multiply(f32[3,1]{1,0} %broadcast.14, f32[3,1]{1,0} %log.1), metadata={op_type="Mul" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/mul_1"}
  %add.2 = f32[3,1]{1,0} add(f32[3,1]{1,0} %broadcast.15, f32[3,1]{1,0} %multiply.2), metadata={op_type="Add" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/add_1"}
  %floor.1 = f32[3,1]{1,0} floor(f32[3,1]{1,0} %add.2), metadata={op_type="Floor" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/Floor"}
  ROOT %convert.1 = s32[3,1]{1,0} convert(f32[3,1]{1,0} %floor.1), metadata={op_type="Cast" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/Cast"}
}

ENTRY %cluster_35__XlaCompiledKernel_true__XlaNumConstantArgs_2__XlaNumResourceArgs_0_.56 (arg0.1: f32[3,4], arg1.2: s32[3], arg2.3: f32[], arg3.4: f32[], arg4.5: f32[], arg5.6: f32[], arg6.7: s32[], arg7.8: s32[], arg8.9: s32[], arg9.10: s32[]) -> (pred[3], pred[3], pred[3], pred[3], f32[3,4]) {
  %arg0.1 = f32[3,4]{1,0} parameter(0), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %arg1.2 = s32[3]{0} parameter(1), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %gather.21 = f32[3,4]{1,0} gather(f32[3,4]{1,0} %arg0.1, s32[3]{0} %arg1.2), offset_dims={1}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=1, slice_sizes={1,4}, metadata={op_type="GatherV2" op_name="tower-pred-0/output/boxes"}
  %arg2.3 = f32[] parameter(2), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %arg3.4 = f32[] parameter(3), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %arg4.5 = f32[] parameter(4), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %arg5.6 = f32[] parameter(5), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %fusion.4 = s32[3,1]{1,0} fusion(f32[3,4]{1,0} %gather.21, f32[] %arg2.3, f32[] %arg3.4, f32[] %arg4.5, f32[] %arg5.6), kind=kLoop, calls=%fused_computation.4, metadata={op_type="Cast" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/Cast"}
  %arg8.9 = s32[] parameter(8), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %arg7.8 = s32[] parameter(7), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %arg6.7 = s32[] parameter(6), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %arg9.10 = s32[] parameter(9), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %fusion.3 = (pred[3]{0}, pred[3]{0}, pred[3]{0}, pred[3]{0}) fusion(s32[3,1]{1,0} %fusion.4, s32[] %arg8.9, s32[] %arg7.8, s32[] %arg6.7, s32[] %arg9.10), kind=kLoop, calls=%fused_computation.3, metadata={op_type="GreaterEqual" op_name="tower-pred-0/multilevel_roi_align_1/fpn_map_rois_to_levels/GreaterEqual"}
  %get-tuple-element = pred[3]{0} get-tuple-element((pred[3]{0}, pred[3]{0}, pred[3]{0}, pred[3]{0}) %fusion.3), index=0
  %get-tuple-element.1 = pred[3]{0} get-tuple-element((pred[3]{0}, pred[3]{0}, pred[3]{0}, pred[3]{0}) %fusion.3), index=1
  %get-tuple-element.2 = pred[3]{0} get-tuple-element((pred[3]{0}, pred[3]{0}, pred[3]{0}, pred[3]{0}) %fusion.3), index=2
  %get-tuple-element.3 = pred[3]{0} get-tuple-element((pred[3]{0}, pred[3]{0}, pred[3]{0}, pred[3]{0}) %fusion.3), index=3
  ROOT %tuple.55 = (pred[3]{0}, pred[3]{0}, pred[3]{0}, pred[3]{0}, f32[3,4]{1,0}) tuple(pred[3]{0} %get-tuple-element, pred[3]{0} %get-tuple-element.1, pred[3]{0} %get-tuple-element.2, pred[3]{0} %get-tuple-element.3, f32[3,4]{1,0} %gather.21), metadata={op_name="XLA_Retvals"}
}

