HloModule cluster_28__XlaCompiledKernel_true__XlaNumConstantArgs_27__XlaNumResourceArgs_0_.1699

%max_F32.1052 (lhs.1053: f32[], rhs.1054: f32[]) -> f32[] {
  %lhs.1053 = f32[] parameter(0)
  %rhs.1054 = f32[] parameter(1)
  ROOT %maximum.1055 = f32[] maximum(f32[] %lhs.1053, f32[] %rhs.1054)
}

%fused_computation (param_0.2: s32[], param_1.3: s32[], param_2.6: f32[], param_3.10: f32[]) -> pred[] {
  %param_3.10 = f32[] parameter(3)
  %bitcast-convert.35 = s32[] bitcast-convert(f32[] %param_3.10)
  %constant_181 = s32[] constant(0)
  %compare.30 = pred[] compare(s32[] %bitcast-convert.35, s32[] %constant_181), direction=LT
  %constant_180 = u32[] constant(2147483647)
  %bitcast-convert.34 = u32[] bitcast-convert(f32[] %param_3.10)
  %subtract.64 = u32[] subtract(u32[] %constant_180, u32[] %bitcast-convert.34)
  %bitcast-convert.33 = s32[] bitcast-convert(u32[] %subtract.64)
  %select.17 = s32[] select(pred[] %compare.30, s32[] %bitcast-convert.33, s32[] %bitcast-convert.35)
  %param_2.6 = f32[] parameter(2)
  %bitcast-convert.32 = s32[] bitcast-convert(f32[] %param_2.6)
  %compare.29 = pred[] compare(s32[] %bitcast-convert.32, s32[] %constant_181), direction=LT
  %bitcast-convert.31 = u32[] bitcast-convert(f32[] %param_2.6)
  %subtract.63 = u32[] subtract(u32[] %constant_180, u32[] %bitcast-convert.31)
  %bitcast-convert.30 = s32[] bitcast-convert(u32[] %subtract.63)
  %select.16 = s32[] select(pred[] %compare.29, s32[] %bitcast-convert.30, s32[] %bitcast-convert.32)
  %compare.28 = pred[] compare(s32[] %select.17, s32[] %select.16), direction=GT
  %compare.27 = pred[] compare(s32[] %select.16, s32[] %select.17), direction=GT
  %compare.26 = pred[] compare(pred[] %compare.28, pred[] %compare.27), direction=EQ
  %param_0.2 = s32[] parameter(0)
  %param_1.3 = s32[] parameter(1)
  %compare.25 = pred[] compare(s32[] %param_0.2, s32[] %param_1.3), direction=LT
  ROOT %select.15 = pred[] select(pred[] %compare.26, pred[] %compare.25, pred[] %compare.28)
}

%compare-greater-than.1114 (p.0.lhs.1115: f32[], p.0.rhs.1116: f32[], p.1.lhs.1117: s32[], p.1.rhs.1118: s32[]) -> pred[] {
  %p.1.lhs.1117 = s32[] parameter(2)
  %p.1.rhs.1118 = s32[] parameter(3)
  %p.0.rhs.1116 = f32[] parameter(1)
  %p.0.lhs.1115 = f32[] parameter(0)
  ROOT %fusion = pred[] fusion(s32[] %p.1.lhs.1117, s32[] %p.1.rhs.1118, f32[] %p.0.rhs.1116, f32[] %p.0.lhs.1115), kind=kLoop, calls=%fused_computation
}

%fused_computation.1 (param_0.5: s32[], param_1.7: s32[], param_2.13: f32[], param_3.21: f32[]) -> pred[] {
  %param_3.21 = f32[] parameter(3)
  %bitcast-convert.41 = s32[] bitcast-convert(f32[] %param_3.21)
  %constant_183 = s32[] constant(0)
  %compare.36 = pred[] compare(s32[] %bitcast-convert.41, s32[] %constant_183), direction=LT
  %constant_182 = u32[] constant(2147483647)
  %bitcast-convert.40 = u32[] bitcast-convert(f32[] %param_3.21)
  %subtract.66 = u32[] subtract(u32[] %constant_182, u32[] %bitcast-convert.40)
  %bitcast-convert.39 = s32[] bitcast-convert(u32[] %subtract.66)
  %select.20 = s32[] select(pred[] %compare.36, s32[] %bitcast-convert.39, s32[] %bitcast-convert.41)
  %param_2.13 = f32[] parameter(2)
  %bitcast-convert.38 = s32[] bitcast-convert(f32[] %param_2.13)
  %compare.35 = pred[] compare(s32[] %bitcast-convert.38, s32[] %constant_183), direction=LT
  %bitcast-convert.37 = u32[] bitcast-convert(f32[] %param_2.13)
  %subtract.65 = u32[] subtract(u32[] %constant_182, u32[] %bitcast-convert.37)
  %bitcast-convert.36 = s32[] bitcast-convert(u32[] %subtract.65)
  %select.19 = s32[] select(pred[] %compare.35, s32[] %bitcast-convert.36, s32[] %bitcast-convert.38)
  %compare.34 = pred[] compare(s32[] %select.20, s32[] %select.19), direction=GT
  %compare.33 = pred[] compare(s32[] %select.19, s32[] %select.20), direction=GT
  %compare.32 = pred[] compare(pred[] %compare.34, pred[] %compare.33), direction=EQ
  %param_0.5 = s32[] parameter(0)
  %param_1.7 = s32[] parameter(1)
  %compare.31 = pred[] compare(s32[] %param_0.5, s32[] %param_1.7), direction=LT
  ROOT %select.18 = pred[] select(pred[] %compare.32, pred[] %compare.31, pred[] %compare.34)
}

%compare-greater-than.1188 (p.0.lhs.1189: f32[], p.0.rhs.1190: f32[], p.1.lhs.1191: s32[], p.1.rhs.1192: s32[]) -> pred[] {
  %p.1.lhs.1191 = s32[] parameter(2)
  %p.1.rhs.1192 = s32[] parameter(3)
  %p.0.rhs.1190 = f32[] parameter(1)
  %p.0.lhs.1189 = f32[] parameter(0)
  ROOT %fusion.1 = pred[] fusion(s32[] %p.1.lhs.1191, s32[] %p.1.rhs.1192, f32[] %p.0.rhs.1190, f32[] %p.0.lhs.1189), kind=kLoop, calls=%fused_computation.1
}

%fused_computation.2 (param_0.8: s32[], param_1.11: s32[], param_2.20: f32[], param_3.32: f32[]) -> pred[] {
  %param_3.32 = f32[] parameter(3)
  %bitcast-convert.47 = s32[] bitcast-convert(f32[] %param_3.32)
  %constant_185 = s32[] constant(0)
  %compare.42 = pred[] compare(s32[] %bitcast-convert.47, s32[] %constant_185), direction=LT
  %constant_184 = u32[] constant(2147483647)
  %bitcast-convert.46 = u32[] bitcast-convert(f32[] %param_3.32)
  %subtract.68 = u32[] subtract(u32[] %constant_184, u32[] %bitcast-convert.46)
  %bitcast-convert.45 = s32[] bitcast-convert(u32[] %subtract.68)
  %select.23 = s32[] select(pred[] %compare.42, s32[] %bitcast-convert.45, s32[] %bitcast-convert.47)
  %param_2.20 = f32[] parameter(2)
  %bitcast-convert.44 = s32[] bitcast-convert(f32[] %param_2.20)
  %compare.41 = pred[] compare(s32[] %bitcast-convert.44, s32[] %constant_185), direction=LT
  %bitcast-convert.43 = u32[] bitcast-convert(f32[] %param_2.20)
  %subtract.67 = u32[] subtract(u32[] %constant_184, u32[] %bitcast-convert.43)
  %bitcast-convert.42 = s32[] bitcast-convert(u32[] %subtract.67)
  %select.22 = s32[] select(pred[] %compare.41, s32[] %bitcast-convert.42, s32[] %bitcast-convert.44)
  %compare.40 = pred[] compare(s32[] %select.23, s32[] %select.22), direction=GT
  %compare.39 = pred[] compare(s32[] %select.22, s32[] %select.23), direction=GT
  %compare.38 = pred[] compare(pred[] %compare.40, pred[] %compare.39), direction=EQ
  %param_0.8 = s32[] parameter(0)
  %param_1.11 = s32[] parameter(1)
  %compare.37 = pred[] compare(s32[] %param_0.8, s32[] %param_1.11), direction=LT
  ROOT %select.21 = pred[] select(pred[] %compare.38, pred[] %compare.37, pred[] %compare.40)
}

%compare-greater-than.1341 (p.0.lhs.1342: f32[], p.0.rhs.1343: f32[], p.1.lhs.1344: s32[], p.1.rhs.1345: s32[]) -> pred[] {
  %p.1.lhs.1344 = s32[] parameter(2)
  %p.1.rhs.1345 = s32[] parameter(3)
  %p.0.rhs.1343 = f32[] parameter(1)
  %p.0.lhs.1342 = f32[] parameter(0)
  ROOT %fusion.2 = pred[] fusion(s32[] %p.1.lhs.1344, s32[] %p.1.rhs.1345, f32[] %p.0.rhs.1343, f32[] %p.0.lhs.1342), kind=kLoop, calls=%fused_computation.2
}

%fused_computation.3 (param_0.11: s32[], param_1.15: s32[], param_2.27: f32[], param_3.43: f32[]) -> pred[] {
  %param_3.43 = f32[] parameter(3)
  %bitcast-convert.53 = s32[] bitcast-convert(f32[] %param_3.43)
  %constant_187 = s32[] constant(0)
  %compare.48 = pred[] compare(s32[] %bitcast-convert.53, s32[] %constant_187), direction=LT
  %constant_186 = u32[] constant(2147483647)
  %bitcast-convert.52 = u32[] bitcast-convert(f32[] %param_3.43)
  %subtract.70 = u32[] subtract(u32[] %constant_186, u32[] %bitcast-convert.52)
  %bitcast-convert.51 = s32[] bitcast-convert(u32[] %subtract.70)
  %select.26 = s32[] select(pred[] %compare.48, s32[] %bitcast-convert.51, s32[] %bitcast-convert.53)
  %param_2.27 = f32[] parameter(2)
  %bitcast-convert.50 = s32[] bitcast-convert(f32[] %param_2.27)
  %compare.47 = pred[] compare(s32[] %bitcast-convert.50, s32[] %constant_187), direction=LT
  %bitcast-convert.49 = u32[] bitcast-convert(f32[] %param_2.27)
  %subtract.69 = u32[] subtract(u32[] %constant_186, u32[] %bitcast-convert.49)
  %bitcast-convert.48 = s32[] bitcast-convert(u32[] %subtract.69)
  %select.25 = s32[] select(pred[] %compare.47, s32[] %bitcast-convert.48, s32[] %bitcast-convert.50)
  %compare.46 = pred[] compare(s32[] %select.26, s32[] %select.25), direction=GT
  %compare.45 = pred[] compare(s32[] %select.25, s32[] %select.26), direction=GT
  %compare.44 = pred[] compare(pred[] %compare.46, pred[] %compare.45), direction=EQ
  %param_0.11 = s32[] parameter(0)
  %param_1.15 = s32[] parameter(1)
  %compare.43 = pred[] compare(s32[] %param_0.11, s32[] %param_1.15), direction=LT
  ROOT %select.24 = pred[] select(pred[] %compare.44, pred[] %compare.43, pred[] %compare.46)
}

%compare-greater-than.1494 (p.0.lhs.1495: f32[], p.0.rhs.1496: f32[], p.1.lhs.1497: s32[], p.1.rhs.1498: s32[]) -> pred[] {
  %p.1.lhs.1497 = s32[] parameter(2)
  %p.1.rhs.1498 = s32[] parameter(3)
  %p.0.rhs.1496 = f32[] parameter(1)
  %p.0.lhs.1495 = f32[] parameter(0)
  ROOT %fusion.3 = pred[] fusion(s32[] %p.1.lhs.1497, s32[] %p.1.rhs.1498, f32[] %p.0.rhs.1496, f32[] %p.0.lhs.1495), kind=kLoop, calls=%fused_computation.3
}

%fused_computation.4 (param_0.14: s32[], param_1.19: s32[], param_2.34: f32[], param_3.54: f32[]) -> pred[] {
  %param_3.54 = f32[] parameter(3)
  %bitcast-convert.59 = s32[] bitcast-convert(f32[] %param_3.54)
  %constant_189 = s32[] constant(0)
  %compare.54 = pred[] compare(s32[] %bitcast-convert.59, s32[] %constant_189), direction=LT
  %constant_188 = u32[] constant(2147483647)
  %bitcast-convert.58 = u32[] bitcast-convert(f32[] %param_3.54)
  %subtract.72 = u32[] subtract(u32[] %constant_188, u32[] %bitcast-convert.58)
  %bitcast-convert.57 = s32[] bitcast-convert(u32[] %subtract.72)
  %select.29 = s32[] select(pred[] %compare.54, s32[] %bitcast-convert.57, s32[] %bitcast-convert.59)
  %param_2.34 = f32[] parameter(2)
  %bitcast-convert.56 = s32[] bitcast-convert(f32[] %param_2.34)
  %compare.53 = pred[] compare(s32[] %bitcast-convert.56, s32[] %constant_189), direction=LT
  %bitcast-convert.55 = u32[] bitcast-convert(f32[] %param_2.34)
  %subtract.71 = u32[] subtract(u32[] %constant_188, u32[] %bitcast-convert.55)
  %bitcast-convert.54 = s32[] bitcast-convert(u32[] %subtract.71)
  %select.28 = s32[] select(pred[] %compare.53, s32[] %bitcast-convert.54, s32[] %bitcast-convert.56)
  %compare.52 = pred[] compare(s32[] %select.29, s32[] %select.28), direction=GT
  %compare.51 = pred[] compare(s32[] %select.28, s32[] %select.29), direction=GT
  %compare.50 = pred[] compare(pred[] %compare.52, pred[] %compare.51), direction=EQ
  %param_0.14 = s32[] parameter(0)
  %param_1.19 = s32[] parameter(1)
  %compare.49 = pred[] compare(s32[] %param_0.14, s32[] %param_1.19), direction=LT
  ROOT %select.27 = pred[] select(pred[] %compare.50, pred[] %compare.49, pred[] %compare.52)
}

%compare-greater-than.1647 (p.0.lhs.1648: f32[], p.0.rhs.1649: f32[], p.1.lhs.1650: s32[], p.1.rhs.1651: s32[]) -> pred[] {
  %p.1.lhs.1650 = s32[] parameter(2)
  %p.1.rhs.1651 = s32[] parameter(3)
  %p.0.rhs.1649 = f32[] parameter(1)
  %p.0.lhs.1648 = f32[] parameter(0)
  ROOT %fusion.4 = pred[] fusion(s32[] %p.1.lhs.1650, s32[] %p.1.rhs.1651, f32[] %p.0.rhs.1649, f32[] %p.0.lhs.1648), kind=kLoop, calls=%fused_computation.4
}

%fused_computation.6 (param_0.19: f32[1,3,200,304], param_1.24: f32[3]) -> f32[182400] {
  %param_0.19 = f32[1,3,200,304]{3,2,1,0} parameter(0)
  %param_1.24 = f32[3]{0} parameter(1)
  %broadcast.457 = f32[1,3,200,304]{3,2,1,0} broadcast(f32[3]{0} %param_1.24), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn/class/BiasAdd"}
  %add.164 = f32[1,3,200,304]{3,2,1,0} add(f32[1,3,200,304]{3,2,1,0} %param_0.19, f32[1,3,200,304]{3,2,1,0} %broadcast.457), metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn/class/BiasAdd"}
  %bitcast.36 = f32[1,200,304,3]{2,1,3,0} bitcast(f32[1,3,200,304]{3,2,1,0} %add.164), metadata={op_type="Transpose" op_name="tower-pred-0/rpn/transpose"}
  ROOT %reshape.24 = f32[182400]{0} reshape(f32[1,200,304,3]{2,1,3,0} %bitcast.36), metadata={op_type="Reshape" op_name="tower-pred-0/generate_fpn_proposals/Lvl2/Reshape_1"}
}

%fused_computation.7 (param_0.344: f32[1,12,200,304], param_1.424: f32[12]) -> f32[182400,1,2] {
  %param_0.344 = f32[1,12,200,304]{3,2,1,0} parameter(0)
  %param_1.424 = f32[12]{0} parameter(1)
  %broadcast.880 = f32[1,12,200,304]{3,2,1,0} broadcast(f32[12]{0} %param_1.424), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn/box/BiasAdd"}
  %add.335 = f32[1,12,200,304]{3,2,1,0} add(f32[1,12,200,304]{3,2,1,0} %param_0.344, f32[1,12,200,304]{3,2,1,0} %broadcast.880), metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn/box/BiasAdd"}
  %bitcast.113 = f32[1,200,304,12]{2,1,3,0} bitcast(f32[1,12,200,304]{3,2,1,0} %add.335), metadata={op_type="Transpose" op_name="tower-pred-0/rpn/transpose_1"}
  %copy.189 = f32[1,200,304,12]{3,2,1,0} copy(f32[1,200,304,12]{2,1,3,0} %bitcast.113), metadata={op_type="Transpose" op_name="tower-pred-0/rpn/transpose_1"}
  %bitcast.112 = f32[182400,2,2]{2,1,0} bitcast(f32[1,200,304,12]{3,2,1,0} %copy.189), metadata={op_type="Reshape" op_name="tower-pred-0/decode_bbox_target/Reshape"}
  %slice.2 = f32[182400,1,2]{2,1,0} slice(f32[182400,2,2]{2,1,0} %bitcast.112), slice={[0:182400], [1:2], [0:2]}, metadata={op_type="Split" op_name="tower-pred-0/decode_bbox_target/split"}
  %constant_191 = f32[] constant(4.43082), metadata={op_type="Minimum" op_name="tower-pred-0/decode_bbox_target_4/Minimum"}
  %broadcast.458 = f32[182400,1,2]{2,1,0} broadcast(f32[] %constant_191), dimensions={}, metadata={op_type="Minimum" op_name="tower-pred-0/decode_bbox_target/Minimum"}
  %minimum.1 = f32[182400,1,2]{2,1,0} minimum(f32[182400,1,2]{2,1,0} %slice.2, f32[182400,1,2]{2,1,0} %broadcast.458), metadata={op_type="Minimum" op_name="tower-pred-0/decode_bbox_target/Minimum"}
  ROOT %exponential.0 = f32[182400,1,2]{2,1,0} exponential(f32[182400,1,2]{2,1,0} %minimum.1), metadata={op_type="Exp" op_name="tower-pred-0/decode_bbox_target/Exp"}
}

%fused_computation.10 (param_0.32: f32[1,3,100,152], param_1.34: f32[3]) -> f32[45600] {
  %param_0.32 = f32[1,3,100,152]{3,2,1,0} parameter(0)
  %param_1.34 = f32[3]{0} parameter(1)
  %broadcast.461 = f32[1,3,100,152]{3,2,1,0} broadcast(f32[3]{0} %param_1.34), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_1/class/BiasAdd"}
  %add.168 = f32[1,3,100,152]{3,2,1,0} add(f32[1,3,100,152]{3,2,1,0} %param_0.32, f32[1,3,100,152]{3,2,1,0} %broadcast.461), metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_1/class/BiasAdd"}
  %bitcast.40 = f32[1,100,152,3]{2,1,3,0} bitcast(f32[1,3,100,152]{3,2,1,0} %add.168), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_1/transpose"}
  ROOT %reshape.25 = f32[45600]{0} reshape(f32[1,100,152,3]{2,1,3,0} %bitcast.40), metadata={op_type="Reshape" op_name="tower-pred-0/generate_fpn_proposals/Lvl3/Reshape_1"}
}

%fused_computation.11 (param_0.338: f32[1,12,100,152], param_1.420: f32[12]) -> f32[45600,1,2] {
  %param_0.338 = f32[1,12,100,152]{3,2,1,0} parameter(0)
  %param_1.420 = f32[12]{0} parameter(1)
  %broadcast.876 = f32[1,12,100,152]{3,2,1,0} broadcast(f32[12]{0} %param_1.420), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_1/box/BiasAdd"}
  %add.331 = f32[1,12,100,152]{3,2,1,0} add(f32[1,12,100,152]{3,2,1,0} %param_0.338, f32[1,12,100,152]{3,2,1,0} %broadcast.876), metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_1/box/BiasAdd"}
  %bitcast.105 = f32[1,100,152,12]{2,1,3,0} bitcast(f32[1,12,100,152]{3,2,1,0} %add.331), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_1/transpose_1"}
  %copy.185 = f32[1,100,152,12]{3,2,1,0} copy(f32[1,100,152,12]{2,1,3,0} %bitcast.105), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_1/transpose_1"}
  %bitcast.104 = f32[45600,2,2]{2,1,0} bitcast(f32[1,100,152,12]{3,2,1,0} %copy.185), metadata={op_type="Reshape" op_name="tower-pred-0/decode_bbox_target_1/Reshape"}
  %slice.5 = f32[45600,1,2]{2,1,0} slice(f32[45600,2,2]{2,1,0} %bitcast.104), slice={[0:45600], [1:2], [0:2]}, metadata={op_type="Split" op_name="tower-pred-0/decode_bbox_target_1/split"}
  %constant_193 = f32[] constant(4.43082), metadata={op_type="Minimum" op_name="tower-pred-0/decode_bbox_target_4/Minimum"}
  %broadcast.462 = f32[45600,1,2]{2,1,0} broadcast(f32[] %constant_193), dimensions={}, metadata={op_type="Minimum" op_name="tower-pred-0/decode_bbox_target_1/Minimum"}
  %minimum.3 = f32[45600,1,2]{2,1,0} minimum(f32[45600,1,2]{2,1,0} %slice.5, f32[45600,1,2]{2,1,0} %broadcast.462), metadata={op_type="Minimum" op_name="tower-pred-0/decode_bbox_target_1/Minimum"}
  ROOT %exponential.1 = f32[45600,1,2]{2,1,0} exponential(f32[45600,1,2]{2,1,0} %minimum.3), metadata={op_type="Exp" op_name="tower-pred-0/decode_bbox_target_1/Exp"}
}

%fused_computation.13 (param_0.41: f32[1,256,200,304], param_1.41: f32[256]) -> f32[1,256,200,304] {
  %param_0.41 = f32[1,256,200,304]{3,2,1,0} parameter(0)
  %param_1.41 = f32[256]{0} parameter(1)
  %broadcast.464 = f32[1,256,200,304]{3,2,1,0} broadcast(f32[256]{0} %param_1.41), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/fpn/posthoc_3x3_p2/BiasAdd"}
  ROOT %add.170 = f32[1,256,200,304]{3,2,1,0} add(f32[1,256,200,304]{3,2,1,0} %param_0.41, f32[1,256,200,304]{3,2,1,0} %broadcast.464), metadata={op_type="BiasAdd" op_name="tower-pred-0/fpn/posthoc_3x3_p2/BiasAdd"}
}

%fused_computation.14 (param_0.43: f32[1,256,100,152], param_1.47: f32[1,256,200,304], param_2.42: f32[256]) -> f32[1,256,200,304] {
  %param_1.47 = f32[1,256,200,304]{3,2,1,0} parameter(1)
  %param_2.42 = f32[256]{0} parameter(2)
  %broadcast.466 = f32[1,256,200,304]{3,2,1,0} broadcast(f32[256]{0} %param_2.42), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/fpn/lateral_1x1_c2/BiasAdd"}
  %add.172 = f32[1,256,200,304]{3,2,1,0} add(f32[1,256,200,304]{3,2,1,0} %param_1.47, f32[1,256,200,304]{3,2,1,0} %broadcast.466), metadata={op_type="BiasAdd" op_name="tower-pred-0/fpn/lateral_1x1_c2/BiasAdd"}
  %param_0.43 = f32[1,256,100,152]{3,2,1,0} parameter(0)
  %bitcast.44 = f32[3891200]{0} bitcast(f32[1,256,100,152]{3,2,1,0} %param_0.43)
  %broadcast.465 = f32[3891200,4]{1,0} broadcast(f32[3891200]{0} %bitcast.44), dimensions={0}, metadata={op_type="MatMul" op_name="tower-pred-0/fpn/upsample_lat3/Tensordot/MatMul"}
  %reshape.26 = f32[1,256,100,152,2,2]{5,3,4,2,1,0} reshape(f32[3891200,4]{1,0} %broadcast.465), metadata={op_type="Reshape" op_name="tower-pred-0/fpn/upsample_lat3/Tensordot"}
  %bitcast.43 = f32[1,256,200,304]{3,2,1,0} bitcast(f32[1,256,100,152,2,2]{5,3,4,2,1,0} %reshape.26), metadata={op_type="Reshape" op_name="tower-pred-0/fpn/upsample_lat3/Reshape"}
  ROOT %add.171 = f32[1,256,200,304]{3,2,1,0} add(f32[1,256,200,304]{3,2,1,0} %add.172, f32[1,256,200,304]{3,2,1,0} %bitcast.43), metadata={op_type="Add" op_name="tower-pred-0/fpn/add_2"}
}

%fused_computation.16 (param_0.48: f32[1,3,50,76], param_1.52: f32[3]) -> f32[11400] {
  %param_0.48 = f32[1,3,50,76]{3,2,1,0} parameter(0)
  %param_1.52 = f32[3]{0} parameter(1)
  %broadcast.468 = f32[1,3,50,76]{3,2,1,0} broadcast(f32[3]{0} %param_1.52), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_2/class/BiasAdd"}
  %add.175 = f32[1,3,50,76]{3,2,1,0} add(f32[1,3,50,76]{3,2,1,0} %param_0.48, f32[1,3,50,76]{3,2,1,0} %broadcast.468), metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_2/class/BiasAdd"}
  %bitcast.46 = f32[1,50,76,3]{2,1,3,0} bitcast(f32[1,3,50,76]{3,2,1,0} %add.175), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_2/transpose"}
  ROOT %reshape.27 = f32[11400]{0} reshape(f32[1,50,76,3]{2,1,3,0} %bitcast.46), metadata={op_type="Reshape" op_name="tower-pred-0/generate_fpn_proposals/Lvl4/Reshape_1"}
}

%fused_computation.17 (param_0.332: f32[1,12,50,76], param_1.416: f32[12]) -> f32[11400,1,2] {
  %param_0.332 = f32[1,12,50,76]{3,2,1,0} parameter(0)
  %param_1.416 = f32[12]{0} parameter(1)
  %broadcast.871 = f32[1,12,50,76]{3,2,1,0} broadcast(f32[12]{0} %param_1.416), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_2/box/BiasAdd"}
  %add.327 = f32[1,12,50,76]{3,2,1,0} add(f32[1,12,50,76]{3,2,1,0} %param_0.332, f32[1,12,50,76]{3,2,1,0} %broadcast.871), metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_2/box/BiasAdd"}
  %bitcast.97 = f32[1,50,76,12]{2,1,3,0} bitcast(f32[1,12,50,76]{3,2,1,0} %add.327), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_2/transpose_1"}
  %copy.181 = f32[1,50,76,12]{3,2,1,0} copy(f32[1,50,76,12]{2,1,3,0} %bitcast.97), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_2/transpose_1"}
  %bitcast.96 = f32[11400,2,2]{2,1,0} bitcast(f32[1,50,76,12]{3,2,1,0} %copy.181), metadata={op_type="Reshape" op_name="tower-pred-0/decode_bbox_target_2/Reshape"}
  %slice.8 = f32[11400,1,2]{2,1,0} slice(f32[11400,2,2]{2,1,0} %bitcast.96), slice={[0:11400], [1:2], [0:2]}, metadata={op_type="Split" op_name="tower-pred-0/decode_bbox_target_2/split"}
  %constant_195 = f32[] constant(4.43082), metadata={op_type="Minimum" op_name="tower-pred-0/decode_bbox_target_4/Minimum"}
  %broadcast.469 = f32[11400,1,2]{2,1,0} broadcast(f32[] %constant_195), dimensions={}, metadata={op_type="Minimum" op_name="tower-pred-0/decode_bbox_target_2/Minimum"}
  %minimum.5 = f32[11400,1,2]{2,1,0} minimum(f32[11400,1,2]{2,1,0} %slice.8, f32[11400,1,2]{2,1,0} %broadcast.469), metadata={op_type="Minimum" op_name="tower-pred-0/decode_bbox_target_2/Minimum"}
  ROOT %exponential.2 = f32[11400,1,2]{2,1,0} exponential(f32[11400,1,2]{2,1,0} %minimum.5), metadata={op_type="Exp" op_name="tower-pred-0/decode_bbox_target_2/Exp"}
}

%fused_computation.19 (param_0.57: f32[1,256,100,152], param_1.59: f32[256]) -> f32[1,256,100,152] {
  %param_0.57 = f32[1,256,100,152]{3,2,1,0} parameter(0)
  %param_1.59 = f32[256]{0} parameter(1)
  %broadcast.471 = f32[1,256,100,152]{3,2,1,0} broadcast(f32[256]{0} %param_1.59), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/fpn/posthoc_3x3_p3/BiasAdd"}
  ROOT %add.177 = f32[1,256,100,152]{3,2,1,0} add(f32[1,256,100,152]{3,2,1,0} %param_0.57, f32[1,256,100,152]{3,2,1,0} %broadcast.471), metadata={op_type="BiasAdd" op_name="tower-pred-0/fpn/posthoc_3x3_p3/BiasAdd"}
}

%fused_computation.20 (param_0.59: f32[1,256,50,76], param_1.65: f32[1,256,100,152], param_2.47: f32[256]) -> f32[1,256,100,152] {
  %param_1.65 = f32[1,256,100,152]{3,2,1,0} parameter(1)
  %param_2.47 = f32[256]{0} parameter(2)
  %broadcast.473 = f32[1,256,100,152]{3,2,1,0} broadcast(f32[256]{0} %param_2.47), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/fpn/lateral_1x1_c3/BiasAdd"}
  %add.179 = f32[1,256,100,152]{3,2,1,0} add(f32[1,256,100,152]{3,2,1,0} %param_1.65, f32[1,256,100,152]{3,2,1,0} %broadcast.473), metadata={op_type="BiasAdd" op_name="tower-pred-0/fpn/lateral_1x1_c3/BiasAdd"}
  %param_0.59 = f32[1,256,50,76]{3,2,1,0} parameter(0)
  %bitcast.50 = f32[972800]{0} bitcast(f32[1,256,50,76]{3,2,1,0} %param_0.59)
  %broadcast.472 = f32[972800,4]{1,0} broadcast(f32[972800]{0} %bitcast.50), dimensions={0}, metadata={op_type="MatMul" op_name="tower-pred-0/fpn/upsample_lat4/Tensordot/MatMul"}
  %reshape.28 = f32[1,256,50,76,2,2]{5,3,4,2,1,0} reshape(f32[972800,4]{1,0} %broadcast.472), metadata={op_type="Reshape" op_name="tower-pred-0/fpn/upsample_lat4/Tensordot"}
  %bitcast.49 = f32[1,256,100,152]{3,2,1,0} bitcast(f32[1,256,50,76,2,2]{5,3,4,2,1,0} %reshape.28), metadata={op_type="Reshape" op_name="tower-pred-0/fpn/upsample_lat4/Reshape"}
  ROOT %add.178 = f32[1,256,100,152]{3,2,1,0} add(f32[1,256,100,152]{3,2,1,0} %add.179, f32[1,256,100,152]{3,2,1,0} %bitcast.49), metadata={op_type="Add" op_name="tower-pred-0/fpn/add_1"}
}

%fused_computation.21 (param_0.316: s32[741], param_1.408: f32[741,1,2], param_2.305: f32[741,1,2], param_3.353: f32[741,1,2], param_4.311: f32[2], param_5.265: f32[1,12,13,19], param_6.127: f32[12]) -> f32[741,4] {
  %constant_196 = f32[] constant(0.5), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_3/mul"}
  %broadcast.476 = f32[741,1,2]{2,1,0} broadcast(f32[] %constant_196), dimensions={}, metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_4/mul"}
  %param_3.353 = f32[741,1,2]{2,1,0} parameter(3)
  %multiply.124 = f32[741,1,2]{2,1,0} multiply(f32[741,1,2]{2,1,0} %broadcast.476, f32[741,1,2]{2,1,0} %param_3.353), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_4/mul"}
  %param_5.265 = f32[1,12,13,19]{3,2,1,0} parameter(5)
  %param_6.127 = f32[12]{0} parameter(6)
  %broadcast.864 = f32[1,12,13,19]{3,2,1,0} broadcast(f32[12]{0} %param_6.127), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_4/box/BiasAdd"}
  %add.321 = f32[1,12,13,19]{3,2,1,0} add(f32[1,12,13,19]{3,2,1,0} %param_5.265, f32[1,12,13,19]{3,2,1,0} %broadcast.864), metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_4/box/BiasAdd"}
  %bitcast.85 = f32[1,13,19,12]{2,1,3,0} bitcast(f32[1,12,13,19]{3,2,1,0} %add.321), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_4/transpose_1"}
  %copy.175 = f32[1,13,19,12]{3,2,1,0} copy(f32[1,13,19,12]{2,1,3,0} %bitcast.85), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_4/transpose_1"}
  %bitcast.84 = f32[741,2,2]{2,1,0} bitcast(f32[1,13,19,12]{3,2,1,0} %copy.175), metadata={op_type="Reshape" op_name="tower-pred-0/decode_bbox_target_4/Reshape"}
  %slice.9 = f32[741,1,2]{2,1,0} slice(f32[741,2,2]{2,1,0} %bitcast.84), slice={[0:741], [0:1], [0:2]}, metadata={op_type="Split" op_name="tower-pred-0/decode_bbox_target_4/split"}
  %param_2.305 = f32[741,1,2]{2,1,0} parameter(2)
  %multiply.123 = f32[741,1,2]{2,1,0} multiply(f32[741,1,2]{2,1,0} %slice.9, f32[741,1,2]{2,1,0} %param_2.305), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_4/mul_2"}
  %add.181 = f32[741,1,2]{2,1,0} add(f32[741,1,2]{2,1,0} %multiply.124, f32[741,1,2]{2,1,0} %multiply.123), metadata={op_type="Add" op_name="tower-pred-0/decode_bbox_target_4/add_1"}
  %param_1.408 = f32[741,1,2]{2,1,0} parameter(1)
  %multiply.122 = f32[741,1,2]{2,1,0} multiply(f32[741,1,2]{2,1,0} %broadcast.476, f32[741,1,2]{2,1,0} %param_2.305), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_4/mul_1"}
  %multiply.121 = f32[741,1,2]{2,1,0} multiply(f32[741,1,2]{2,1,0} %param_1.408, f32[741,1,2]{2,1,0} %multiply.122), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_4/mul_4"}
  %subtract.76 = f32[741,1,2]{2,1,0} subtract(f32[741,1,2]{2,1,0} %add.181, f32[741,1,2]{2,1,0} %multiply.121), metadata={op_type="Sub" op_name="tower-pred-0/decode_bbox_target_4/sub_1"}
  %add.180 = f32[741,1,2]{2,1,0} add(f32[741,1,2]{2,1,0} %add.181, f32[741,1,2]{2,1,0} %multiply.121), metadata={op_type="Add" op_name="tower-pred-0/decode_bbox_target_4/add_2"}
  %concatenate.3 = f32[741,2,2]{2,1,0} concatenate(f32[741,1,2]{2,1,0} %subtract.76, f32[741,1,2]{2,1,0} %add.180), dimensions={1}, metadata={op_type="ConcatV2" op_name="tower-pred-0/decode_bbox_target_4/concat"}
  %bitcast.51 = f32[741,4]{1,0} bitcast(f32[741,2,2]{2,1,0} %concatenate.3), metadata={op_type="Reshape" op_name="tower-pred-0/generate_fpn_proposals/Lvl6/Reshape"}
  %param_0.316 = s32[741]{0} parameter(0)
  %gather.3 = f32[741,4]{1,0} gather(f32[741,4]{1,0} %bitcast.51, s32[741]{0} %param_0.316), offset_dims={1}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=1, slice_sizes={1,4}, metadata={op_type="GatherV2" op_name="tower-pred-0/generate_fpn_proposals/Lvl6/generate_rpn_proposals/GatherV2"}
  %constant_197 = f32[] constant(0), metadata={op_type="Relu" op_name="tower-pred-0/conv0/Relu"}
  %broadcast.475 = f32[741,4]{1,0} broadcast(f32[] %constant_197), dimensions={}, metadata={op_type="Maximum" op_name="tower-pred-0/generate_fpn_proposals/Lvl6/generate_rpn_proposals/clip_boxes/Maximum"}
  %maximum.3 = f32[741,4]{1,0} maximum(f32[741,4]{1,0} %gather.3, f32[741,4]{1,0} %broadcast.475), metadata={op_type="Maximum" op_name="tower-pred-0/generate_fpn_proposals/Lvl6/generate_rpn_proposals/clip_boxes/Maximum"}
  %param_4.311 = f32[2]{0} parameter(4)
  %broadcast.852 = f32[2,2]{1,0} broadcast(f32[2]{0} %param_4.311), dimensions={1}
  %bitcast.73 = f32[4]{0} bitcast(f32[2,2]{1,0} %broadcast.852), metadata={op_type="Cast" op_name="tower-pred-0/generate_fpn_proposals/Lvl6/generate_rpn_proposals/clip_boxes/Cast"}
  %broadcast.474 = f32[741,4]{1,0} broadcast(f32[4]{0} %bitcast.73), dimensions={1}, metadata={op_type="Minimum" op_name="tower-pred-0/generate_fpn_proposals/Lvl6/generate_rpn_proposals/clip_boxes/Minimum"}
  ROOT %minimum.6 = f32[741,4]{1,0} minimum(f32[741,4]{1,0} %maximum.3, f32[741,4]{1,0} %broadcast.474), metadata={op_type="Minimum" op_name="tower-pred-0/generate_fpn_proposals/Lvl6/generate_rpn_proposals/clip_boxes/Minimum"}
}

%fused_computation.22 (param_0.64: f32[1,3,13,19], param_1.72: f32[3]) -> f32[741] {
  %param_0.64 = f32[1,3,13,19]{3,2,1,0} parameter(0)
  %param_1.72 = f32[3]{0} parameter(1)
  %broadcast.477 = f32[1,3,13,19]{3,2,1,0} broadcast(f32[3]{0} %param_1.72), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_4/class/BiasAdd"}
  %add.182 = f32[1,3,13,19]{3,2,1,0} add(f32[1,3,13,19]{3,2,1,0} %param_0.64, f32[1,3,13,19]{3,2,1,0} %broadcast.477), metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_4/class/BiasAdd"}
  %bitcast.52 = f32[1,13,19,3]{2,1,3,0} bitcast(f32[1,3,13,19]{3,2,1,0} %add.182), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_4/transpose"}
  ROOT %reshape.29 = f32[741]{0} reshape(f32[1,13,19,3]{2,1,3,0} %bitcast.52), metadata={op_type="Reshape" op_name="tower-pred-0/generate_fpn_proposals/Lvl6/Reshape_1"}
}

%fused_computation.23 (param_0.326: f32[1,12,13,19], param_1.412: f32[12]) -> f32[741,1,2] {
  %param_0.326 = f32[1,12,13,19]{3,2,1,0} parameter(0)
  %param_1.412 = f32[12]{0} parameter(1)
  %broadcast.866 = f32[1,12,13,19]{3,2,1,0} broadcast(f32[12]{0} %param_1.412), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_4/box/BiasAdd"}
  %add.323 = f32[1,12,13,19]{3,2,1,0} add(f32[1,12,13,19]{3,2,1,0} %param_0.326, f32[1,12,13,19]{3,2,1,0} %broadcast.866), metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_4/box/BiasAdd"}
  %bitcast.89 = f32[1,13,19,12]{2,1,3,0} bitcast(f32[1,12,13,19]{3,2,1,0} %add.323), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_4/transpose_1"}
  %copy.177 = f32[1,13,19,12]{3,2,1,0} copy(f32[1,13,19,12]{2,1,3,0} %bitcast.89), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_4/transpose_1"}
  %bitcast.88 = f32[741,2,2]{2,1,0} bitcast(f32[1,13,19,12]{3,2,1,0} %copy.177), metadata={op_type="Reshape" op_name="tower-pred-0/decode_bbox_target_4/Reshape"}
  %slice.10 = f32[741,1,2]{2,1,0} slice(f32[741,2,2]{2,1,0} %bitcast.88), slice={[0:741], [1:2], [0:2]}, metadata={op_type="Split" op_name="tower-pred-0/decode_bbox_target_4/split"}
  %constant_198 = f32[] constant(4.43082), metadata={op_type="Minimum" op_name="tower-pred-0/decode_bbox_target_4/Minimum"}
  %broadcast.478 = f32[741,1,2]{2,1,0} broadcast(f32[] %constant_198), dimensions={}, metadata={op_type="Minimum" op_name="tower-pred-0/decode_bbox_target_4/Minimum"}
  %minimum.7 = f32[741,1,2]{2,1,0} minimum(f32[741,1,2]{2,1,0} %slice.10, f32[741,1,2]{2,1,0} %broadcast.478), metadata={op_type="Minimum" op_name="tower-pred-0/decode_bbox_target_4/Minimum"}
  ROOT %exponential.3 = f32[741,1,2]{2,1,0} exponential(f32[741,1,2]{2,1,0} %minimum.7), metadata={op_type="Exp" op_name="tower-pred-0/decode_bbox_target_4/Exp"}
}

%fused_computation.25 (param_0.263: s32[2850], param_1.305: f32[2850,1,2], param_2.259: f32[2850,1,2], param_3.351: f32[2850,1,2], param_4.310: f32[1,12,25,38], param_5.261: f32[12], param_6.125: f32[2], param_7.68: s32[11400], param_8.30: f32[11400,1,2], param_9.21: f32[11400,1,2], param_10.16: f32[1,12,50,76], param_11.3: f32[11400,1,2], param_12.12: s32[45600], param_13.11: f32[45600,1,2], param_14.5: f32[45600,1,2], param_15.4: f32[1,12,100,152], param_16.3: f32[45600,1,2], param_17.12: s32[182400], param_18.11: f32[182400,1,2], param_19.5: f32[182400,1,2], param_20.4: f32[1,12,200,304], param_21.3: f32[182400,1,2]) -> (f32[1000,4], f32[1000,4], f32[1000,4], f32[1000,4]) {
  %constant_199 = f32[] constant(0.5), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_3/mul"}
  %broadcast.480 = f32[2850,1,2]{2,1,0} broadcast(f32[] %constant_199), dimensions={}, metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_3/mul"}
  %param_3.351 = f32[2850,1,2]{2,1,0} parameter(3)
  %multiply.128 = f32[2850,1,2]{2,1,0} multiply(f32[2850,1,2]{2,1,0} %broadcast.480, f32[2850,1,2]{2,1,0} %param_3.351), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_3/mul"}
  %param_4.310 = f32[1,12,25,38]{3,2,1,0} parameter(4)
  %param_5.261 = f32[12]{0} parameter(5)
  %broadcast.848 = f32[1,12,25,38]{3,2,1,0} broadcast(f32[12]{0} %param_5.261), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_3/box/BiasAdd"}
  %add.317 = f32[1,12,25,38]{3,2,1,0} add(f32[1,12,25,38]{3,2,1,0} %param_4.310, f32[1,12,25,38]{3,2,1,0} %broadcast.848), metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_3/box/BiasAdd"}
  %bitcast.67 = f32[1,25,38,12]{2,1,3,0} bitcast(f32[1,12,25,38]{3,2,1,0} %add.317), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_3/transpose_1"}
  %copy.171 = f32[1,25,38,12]{3,2,1,0} copy(f32[1,25,38,12]{2,1,3,0} %bitcast.67), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_3/transpose_1"}
  %bitcast.66 = f32[2850,2,2]{2,1,0} bitcast(f32[1,25,38,12]{3,2,1,0} %copy.171), metadata={op_type="Reshape" op_name="tower-pred-0/decode_bbox_target_3/Reshape"}
  %slice.12 = f32[2850,1,2]{2,1,0} slice(f32[2850,2,2]{2,1,0} %bitcast.66), slice={[0:2850], [0:1], [0:2]}, metadata={op_type="Split" op_name="tower-pred-0/decode_bbox_target_3/split"}
  %param_2.259 = f32[2850,1,2]{2,1,0} parameter(2)
  %multiply.127 = f32[2850,1,2]{2,1,0} multiply(f32[2850,1,2]{2,1,0} %slice.12, f32[2850,1,2]{2,1,0} %param_2.259), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_3/mul_2"}
  %add.185 = f32[2850,1,2]{2,1,0} add(f32[2850,1,2]{2,1,0} %multiply.128, f32[2850,1,2]{2,1,0} %multiply.127), metadata={op_type="Add" op_name="tower-pred-0/decode_bbox_target_3/add_1"}
  %param_1.305 = f32[2850,1,2]{2,1,0} parameter(1)
  %multiply.126 = f32[2850,1,2]{2,1,0} multiply(f32[2850,1,2]{2,1,0} %broadcast.480, f32[2850,1,2]{2,1,0} %param_2.259), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_3/mul_1"}
  %multiply.125 = f32[2850,1,2]{2,1,0} multiply(f32[2850,1,2]{2,1,0} %param_1.305, f32[2850,1,2]{2,1,0} %multiply.126), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_3/mul_4"}
  %subtract.77 = f32[2850,1,2]{2,1,0} subtract(f32[2850,1,2]{2,1,0} %add.185, f32[2850,1,2]{2,1,0} %multiply.125), metadata={op_type="Sub" op_name="tower-pred-0/decode_bbox_target_3/sub_1"}
  %add.184 = f32[2850,1,2]{2,1,0} add(f32[2850,1,2]{2,1,0} %add.185, f32[2850,1,2]{2,1,0} %multiply.125), metadata={op_type="Add" op_name="tower-pred-0/decode_bbox_target_3/add_2"}
  %concatenate.4 = f32[2850,2,2]{2,1,0} concatenate(f32[2850,1,2]{2,1,0} %subtract.77, f32[2850,1,2]{2,1,0} %add.184), dimensions={1}, metadata={op_type="ConcatV2" op_name="tower-pred-0/decode_bbox_target_3/concat"}
  %bitcast.55 = f32[2850,4]{1,0} bitcast(f32[2850,2,2]{2,1,0} %concatenate.4), metadata={op_type="Reshape" op_name="tower-pred-0/generate_fpn_proposals/Lvl5/Reshape"}
  %param_0.263 = s32[2850]{0} parameter(0)
  %slice.11 = s32[1000]{0} slice(s32[2850]{0} %param_0.263), slice={[0:1000]}, metadata={op_type="TopKV2" op_name="tower-pred-0/generate_fpn_proposals/Lvl5/generate_rpn_proposals/TopKV2"}
  %gather.4 = f32[1000,4]{1,0} gather(f32[2850,4]{1,0} %bitcast.55, s32[1000]{0} %slice.11), offset_dims={1}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=1, slice_sizes={1,4}, metadata={op_type="GatherV2" op_name="tower-pred-0/generate_fpn_proposals/Lvl5/generate_rpn_proposals/GatherV2"}
  %constant_210 = f32[] constant(0), metadata={op_type="Relu" op_name="tower-pred-0/conv0/Relu"}
  %broadcast.732 = f32[1000,4]{1,0} broadcast(f32[] %constant_210), dimensions={}, metadata={op_type="Maximum" op_name="tower-pred-0/generate_fpn_proposals/Lvl5/generate_rpn_proposals/clip_boxes/Maximum"}
  %maximum.4 = f32[1000,4]{1,0} maximum(f32[1000,4]{1,0} %gather.4, f32[1000,4]{1,0} %broadcast.732), metadata={op_type="Maximum" op_name="tower-pred-0/generate_fpn_proposals/Lvl5/generate_rpn_proposals/clip_boxes/Maximum"}
  %param_6.125 = f32[2]{0} parameter(6)
  %broadcast.862 = f32[2,2]{1,0} broadcast(f32[2]{0} %param_6.125), dimensions={1}
  %bitcast.81 = f32[4]{0} bitcast(f32[2,2]{1,0} %broadcast.862), metadata={op_type="Cast" op_name="tower-pred-0/generate_fpn_proposals/Lvl6/generate_rpn_proposals/clip_boxes/Cast"}
  %broadcast.733 = f32[1000,4]{1,0} broadcast(f32[4]{0} %bitcast.81), dimensions={1}, metadata={op_type="Minimum" op_name="tower-pred-0/generate_fpn_proposals/Lvl5/generate_rpn_proposals/clip_boxes/Minimum"}
  %minimum.8 = f32[1000,4]{1,0} minimum(f32[1000,4]{1,0} %maximum.4, f32[1000,4]{1,0} %broadcast.733), metadata={op_type="Minimum" op_name="tower-pred-0/generate_fpn_proposals/Lvl5/generate_rpn_proposals/clip_boxes/Minimum"}
  %broadcast.467.clone.1 = f32[11400,1,2]{2,1,0} broadcast(f32[] %constant_199), dimensions={}, metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_2/mul"}
  %param_11.3 = f32[11400,1,2]{2,1,0} parameter(11)
  %multiply.120.clone.1 = f32[11400,1,2]{2,1,0} multiply(f32[11400,1,2]{2,1,0} %broadcast.467.clone.1, f32[11400,1,2]{2,1,0} %param_11.3), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_2/mul"}
  %param_10.16 = f32[1,12,50,76]{3,2,1,0} parameter(10)
  %broadcast.869.clone.1 = f32[1,12,50,76]{3,2,1,0} broadcast(f32[12]{0} %param_5.261), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_2/box/BiasAdd"}
  %add.325.clone.1 = f32[1,12,50,76]{3,2,1,0} add(f32[1,12,50,76]{3,2,1,0} %param_10.16, f32[1,12,50,76]{3,2,1,0} %broadcast.869.clone.1), metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_2/box/BiasAdd"}
  %bitcast.93.clone.1 = f32[1,50,76,12]{2,1,3,0} bitcast(f32[1,12,50,76]{3,2,1,0} %add.325.clone.1), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_2/transpose_1"}
  %copy.179.clone.1 = f32[1,50,76,12]{3,2,1,0} copy(f32[1,50,76,12]{2,1,3,0} %bitcast.93.clone.1), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_2/transpose_1"}
  %bitcast.92.clone.1 = f32[11400,2,2]{2,1,0} bitcast(f32[1,50,76,12]{3,2,1,0} %copy.179.clone.1), metadata={op_type="Reshape" op_name="tower-pred-0/decode_bbox_target_2/Reshape"}
  %slice.7.clone.1 = f32[11400,1,2]{2,1,0} slice(f32[11400,2,2]{2,1,0} %bitcast.92.clone.1), slice={[0:11400], [0:1], [0:2]}, metadata={op_type="Split" op_name="tower-pred-0/decode_bbox_target_2/split"}
  %param_9.21 = f32[11400,1,2]{2,1,0} parameter(9)
  %multiply.119.clone.1 = f32[11400,1,2]{2,1,0} multiply(f32[11400,1,2]{2,1,0} %slice.7.clone.1, f32[11400,1,2]{2,1,0} %param_9.21), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_2/mul_2"}
  %add.174.clone.1 = f32[11400,1,2]{2,1,0} add(f32[11400,1,2]{2,1,0} %multiply.120.clone.1, f32[11400,1,2]{2,1,0} %multiply.119.clone.1), metadata={op_type="Add" op_name="tower-pred-0/decode_bbox_target_2/add_1"}
  %param_8.30 = f32[11400,1,2]{2,1,0} parameter(8)
  %multiply.118.clone.1 = f32[11400,1,2]{2,1,0} multiply(f32[11400,1,2]{2,1,0} %broadcast.467.clone.1, f32[11400,1,2]{2,1,0} %param_9.21), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_2/mul_1"}
  %multiply.117.clone.1 = f32[11400,1,2]{2,1,0} multiply(f32[11400,1,2]{2,1,0} %param_8.30, f32[11400,1,2]{2,1,0} %multiply.118.clone.1), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_2/mul_4"}
  %subtract.75.clone.1 = f32[11400,1,2]{2,1,0} subtract(f32[11400,1,2]{2,1,0} %add.174.clone.1, f32[11400,1,2]{2,1,0} %multiply.117.clone.1), metadata={op_type="Sub" op_name="tower-pred-0/decode_bbox_target_2/sub_1"}
  %add.173.clone.1 = f32[11400,1,2]{2,1,0} add(f32[11400,1,2]{2,1,0} %add.174.clone.1, f32[11400,1,2]{2,1,0} %multiply.117.clone.1), metadata={op_type="Add" op_name="tower-pred-0/decode_bbox_target_2/add_2"}
  %concatenate.2.clone.1 = f32[11400,2,2]{2,1,0} concatenate(f32[11400,1,2]{2,1,0} %subtract.75.clone.1, f32[11400,1,2]{2,1,0} %add.173.clone.1), dimensions={1}, metadata={op_type="ConcatV2" op_name="tower-pred-0/decode_bbox_target_2/concat"}
  %bitcast.45.clone.1 = f32[11400,4]{1,0} bitcast(f32[11400,2,2]{2,1,0} %concatenate.2.clone.1), metadata={op_type="Reshape" op_name="tower-pred-0/generate_fpn_proposals/Lvl4/Reshape"}
  %param_7.68 = s32[11400]{0} parameter(7)
  %slice.6.clone.1 = s32[1000]{0} slice(s32[11400]{0} %param_7.68), slice={[0:1000]}, metadata={op_type="TopKV2" op_name="tower-pred-0/generate_fpn_proposals/Lvl4/generate_rpn_proposals/TopKV2"}
  %gather.2.clone.1 = f32[1000,4]{1,0} gather(f32[11400,4]{1,0} %bitcast.45.clone.1, s32[1000]{0} %slice.6.clone.1), offset_dims={1}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=1, slice_sizes={1,4}, metadata={op_type="GatherV2" op_name="tower-pred-0/generate_fpn_proposals/Lvl4/generate_rpn_proposals/GatherV2"}
  %maximum.2.clone.1 = f32[1000,4]{1,0} maximum(f32[1000,4]{1,0} %gather.2.clone.1, f32[1000,4]{1,0} %broadcast.732), metadata={op_type="Maximum" op_name="tower-pred-0/generate_fpn_proposals/Lvl4/generate_rpn_proposals/clip_boxes/Maximum"}
  %minimum.4.clone.1 = f32[1000,4]{1,0} minimum(f32[1000,4]{1,0} %maximum.2.clone.1, f32[1000,4]{1,0} %broadcast.733), metadata={op_type="Minimum" op_name="tower-pred-0/generate_fpn_proposals/Lvl4/generate_rpn_proposals/clip_boxes/Minimum"}
  %broadcast.460.clone.1 = f32[45600,1,2]{2,1,0} broadcast(f32[] %constant_199), dimensions={}, metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_1/mul"}
  %param_16.3 = f32[45600,1,2]{2,1,0} parameter(16)
  %multiply.116.clone.1 = f32[45600,1,2]{2,1,0} multiply(f32[45600,1,2]{2,1,0} %broadcast.460.clone.1, f32[45600,1,2]{2,1,0} %param_16.3), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_1/mul"}
  %param_15.4 = f32[1,12,100,152]{3,2,1,0} parameter(15)
  %broadcast.873.clone.1 = f32[1,12,100,152]{3,2,1,0} broadcast(f32[12]{0} %param_5.261), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_1/box/BiasAdd"}
  %add.329.clone.1 = f32[1,12,100,152]{3,2,1,0} add(f32[1,12,100,152]{3,2,1,0} %param_15.4, f32[1,12,100,152]{3,2,1,0} %broadcast.873.clone.1), metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn_1/box/BiasAdd"}
  %bitcast.101.clone.1 = f32[1,100,152,12]{2,1,3,0} bitcast(f32[1,12,100,152]{3,2,1,0} %add.329.clone.1), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_1/transpose_1"}
  %copy.183.clone.1 = f32[1,100,152,12]{3,2,1,0} copy(f32[1,100,152,12]{2,1,3,0} %bitcast.101.clone.1), metadata={op_type="Transpose" op_name="tower-pred-0/rpn_1/transpose_1"}
  %bitcast.100.clone.1 = f32[45600,2,2]{2,1,0} bitcast(f32[1,100,152,12]{3,2,1,0} %copy.183.clone.1), metadata={op_type="Reshape" op_name="tower-pred-0/decode_bbox_target_1/Reshape"}
  %slice.4.clone.1 = f32[45600,1,2]{2,1,0} slice(f32[45600,2,2]{2,1,0} %bitcast.100.clone.1), slice={[0:45600], [0:1], [0:2]}, metadata={op_type="Split" op_name="tower-pred-0/decode_bbox_target_1/split"}
  %param_14.5 = f32[45600,1,2]{2,1,0} parameter(14)
  %multiply.115.clone.1 = f32[45600,1,2]{2,1,0} multiply(f32[45600,1,2]{2,1,0} %slice.4.clone.1, f32[45600,1,2]{2,1,0} %param_14.5), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_1/mul_2"}
  %add.167.clone.1 = f32[45600,1,2]{2,1,0} add(f32[45600,1,2]{2,1,0} %multiply.116.clone.1, f32[45600,1,2]{2,1,0} %multiply.115.clone.1), metadata={op_type="Add" op_name="tower-pred-0/decode_bbox_target_1/add_1"}
  %param_13.11 = f32[45600,1,2]{2,1,0} parameter(13)
  %multiply.114.clone.1 = f32[45600,1,2]{2,1,0} multiply(f32[45600,1,2]{2,1,0} %broadcast.460.clone.1, f32[45600,1,2]{2,1,0} %param_14.5), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_1/mul_1"}
  %multiply.113.clone.1 = f32[45600,1,2]{2,1,0} multiply(f32[45600,1,2]{2,1,0} %param_13.11, f32[45600,1,2]{2,1,0} %multiply.114.clone.1), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target_1/mul_4"}
  %subtract.74.clone.1 = f32[45600,1,2]{2,1,0} subtract(f32[45600,1,2]{2,1,0} %add.167.clone.1, f32[45600,1,2]{2,1,0} %multiply.113.clone.1), metadata={op_type="Sub" op_name="tower-pred-0/decode_bbox_target_1/sub_1"}
  %add.166.clone.1 = f32[45600,1,2]{2,1,0} add(f32[45600,1,2]{2,1,0} %add.167.clone.1, f32[45600,1,2]{2,1,0} %multiply.113.clone.1), metadata={op_type="Add" op_name="tower-pred-0/decode_bbox_target_1/add_2"}
  %concatenate.1.clone.1 = f32[45600,2,2]{2,1,0} concatenate(f32[45600,1,2]{2,1,0} %subtract.74.clone.1, f32[45600,1,2]{2,1,0} %add.166.clone.1), dimensions={1}, metadata={op_type="ConcatV2" op_name="tower-pred-0/decode_bbox_target_1/concat"}
  %bitcast.39.clone.1 = f32[45600,4]{1,0} bitcast(f32[45600,2,2]{2,1,0} %concatenate.1.clone.1), metadata={op_type="Reshape" op_name="tower-pred-0/generate_fpn_proposals/Lvl3/Reshape"}
  %param_12.12 = s32[45600]{0} parameter(12)
  %slice.3.clone.1 = s32[1000]{0} slice(s32[45600]{0} %param_12.12), slice={[0:1000]}, metadata={op_type="TopKV2" op_name="tower-pred-0/generate_fpn_proposals/Lvl3/generate_rpn_proposals/TopKV2"}
  %gather.1.clone.1 = f32[1000,4]{1,0} gather(f32[45600,4]{1,0} %bitcast.39.clone.1, s32[1000]{0} %slice.3.clone.1), offset_dims={1}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=1, slice_sizes={1,4}, metadata={op_type="GatherV2" op_name="tower-pred-0/generate_fpn_proposals/Lvl3/generate_rpn_proposals/GatherV2"}
  %maximum.1.clone.1 = f32[1000,4]{1,0} maximum(f32[1000,4]{1,0} %gather.1.clone.1, f32[1000,4]{1,0} %broadcast.732), metadata={op_type="Maximum" op_name="tower-pred-0/generate_fpn_proposals/Lvl3/generate_rpn_proposals/clip_boxes/Maximum"}
  %minimum.2.clone.1 = f32[1000,4]{1,0} minimum(f32[1000,4]{1,0} %maximum.1.clone.1, f32[1000,4]{1,0} %broadcast.733), metadata={op_type="Minimum" op_name="tower-pred-0/generate_fpn_proposals/Lvl3/generate_rpn_proposals/clip_boxes/Minimum"}
  %broadcast.456.clone.1 = f32[182400,1,2]{2,1,0} broadcast(f32[] %constant_199), dimensions={}, metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target/mul"}
  %param_21.3 = f32[182400,1,2]{2,1,0} parameter(21)
  %multiply.112.clone.1 = f32[182400,1,2]{2,1,0} multiply(f32[182400,1,2]{2,1,0} %broadcast.456.clone.1, f32[182400,1,2]{2,1,0} %param_21.3), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target/mul"}
  %param_20.4 = f32[1,12,200,304]{3,2,1,0} parameter(20)
  %broadcast.878.clone.1 = f32[1,12,200,304]{3,2,1,0} broadcast(f32[12]{0} %param_5.261), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn/box/BiasAdd"}
  %add.333.clone.1 = f32[1,12,200,304]{3,2,1,0} add(f32[1,12,200,304]{3,2,1,0} %param_20.4, f32[1,12,200,304]{3,2,1,0} %broadcast.878.clone.1), metadata={op_type="BiasAdd" op_name="tower-pred-0/rpn/box/BiasAdd"}
  %bitcast.109.clone.1 = f32[1,200,304,12]{2,1,3,0} bitcast(f32[1,12,200,304]{3,2,1,0} %add.333.clone.1), metadata={op_type="Transpose" op_name="tower-pred-0/rpn/transpose_1"}
  %copy.187.clone.1 = f32[1,200,304,12]{3,2,1,0} copy(f32[1,200,304,12]{2,1,3,0} %bitcast.109.clone.1), metadata={op_type="Transpose" op_name="tower-pred-0/rpn/transpose_1"}
  %bitcast.108.clone.1 = f32[182400,2,2]{2,1,0} bitcast(f32[1,200,304,12]{3,2,1,0} %copy.187.clone.1), metadata={op_type="Reshape" op_name="tower-pred-0/decode_bbox_target/Reshape"}
  %slice.1.clone.1 = f32[182400,1,2]{2,1,0} slice(f32[182400,2,2]{2,1,0} %bitcast.108.clone.1), slice={[0:182400], [0:1], [0:2]}, metadata={op_type="Split" op_name="tower-pred-0/decode_bbox_target/split"}
  %param_19.5 = f32[182400,1,2]{2,1,0} parameter(19)
  %multiply.111.clone.1 = f32[182400,1,2]{2,1,0} multiply(f32[182400,1,2]{2,1,0} %slice.1.clone.1, f32[182400,1,2]{2,1,0} %param_19.5), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target/mul_2"}
  %add.163.clone.1 = f32[182400,1,2]{2,1,0} add(f32[182400,1,2]{2,1,0} %multiply.112.clone.1, f32[182400,1,2]{2,1,0} %multiply.111.clone.1), metadata={op_type="Add" op_name="tower-pred-0/decode_bbox_target/add_1"}
  %param_18.11 = f32[182400,1,2]{2,1,0} parameter(18)
  %multiply.110.clone.1 = f32[182400,1,2]{2,1,0} multiply(f32[182400,1,2]{2,1,0} %broadcast.456.clone.1, f32[182400,1,2]{2,1,0} %param_19.5), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target/mul_1"}
  %multiply.109.clone.1 = f32[182400,1,2]{2,1,0} multiply(f32[182400,1,2]{2,1,0} %param_18.11, f32[182400,1,2]{2,1,0} %multiply.110.clone.1), metadata={op_type="Mul" op_name="tower-pred-0/decode_bbox_target/mul_4"}
  %subtract.73.clone.1 = f32[182400,1,2]{2,1,0} subtract(f32[182400,1,2]{2,1,0} %add.163.clone.1, f32[182400,1,2]{2,1,0} %multiply.109.clone.1), metadata={op_type="Sub" op_name="tower-pred-0/decode_bbox_target/sub_1"}
  %add.162.clone.1 = f32[182400,1,2]{2,1,0} add(f32[182400,1,2]{2,1,0} %add.163.clone.1, f32[182400,1,2]{2,1,0} %multiply.109.clone.1), metadata={op_type="Add" op_name="tower-pred-0/decode_bbox_target/add_2"}
  %concatenate.0.clone.1 = f32[182400,2,2]{2,1,0} concatenate(f32[182400,1,2]{2,1,0} %subtract.73.clone.1, f32[182400,1,2]{2,1,0} %add.162.clone.1), dimensions={1}, metadata={op_type="ConcatV2" op_name="tower-pred-0/decode_bbox_target/concat"}
  %bitcast.35.clone.1 = f32[182400,4]{1,0} bitcast(f32[182400,2,2]{2,1,0} %concatenate.0.clone.1), metadata={op_type="Reshape" op_name="tower-pred-0/generate_fpn_proposals/Lvl2/Reshape"}
  %param_17.12 = s32[182400]{0} parameter(17)
  %slice.0.clone.1 = s32[1000]{0} slice(s32[182400]{0} %param_17.12), slice={[0:1000]}, metadata={op_type="TopKV2" op_name="tower-pred-0/generate_fpn_proposals/Lvl2/generate_rpn_proposals/TopKV2"}
  %gather.0.clone.1 = f32[1000,4]{1,0} gather(f32[182400,4]{1,0} %bitcast.35.clone.1, s32[1000]{0} %slice.0.clone.1), offset_dims={1}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=1, slice_sizes={1,4}, metadata={op_type="GatherV2" op_name="tower-pred-0/generate_fpn_proposals/Lvl2/generate_rpn_proposals/GatherV2"}
