HloModule cluster_5__XlaCompiledKernel_true__XlaNumConstantArgs_39__XlaNumResourceArgs_0_.2788

%max_F32.1823 (lhs.1824: f32[], rhs.1825: f32[]) -> f32[] {
  %lhs.1824 = f32[] parameter(0)
  %rhs.1825 = f32[] parameter(1)
  ROOT %maximum.1826 = f32[] maximum(f32[] %lhs.1824, f32[] %rhs.1825)
}

%fused_computation (param_0.2: s32[], param_1.3: s32[], param_2.6: f32[], param_3.10: f32[]) -> pred[] {
  %param_3.10 = f32[] parameter(3)
  %bitcast-convert.35 = s32[] bitcast-convert(f32[] %param_3.10)
  %constant_128 = s32[] constant(0)
  %compare.30 = pred[] compare(s32[] %bitcast-convert.35, s32[] %constant_128), direction=LT
  %constant_127 = u32[] constant(2147483647)
  %bitcast-convert.34 = u32[] bitcast-convert(f32[] %param_3.10)
  %subtract.22 = u32[] subtract(u32[] %constant_127, u32[] %bitcast-convert.34)
  %bitcast-convert.33 = s32[] bitcast-convert(u32[] %subtract.22)
  %select.17 = s32[] select(pred[] %compare.30, s32[] %bitcast-convert.33, s32[] %bitcast-convert.35)
  %param_2.6 = f32[] parameter(2)
  %bitcast-convert.32 = s32[] bitcast-convert(f32[] %param_2.6)
  %compare.29 = pred[] compare(s32[] %bitcast-convert.32, s32[] %constant_128), direction=LT
  %bitcast-convert.31 = u32[] bitcast-convert(f32[] %param_2.6)
  %subtract.21 = u32[] subtract(u32[] %constant_127, u32[] %bitcast-convert.31)
  %bitcast-convert.30 = s32[] bitcast-convert(u32[] %subtract.21)
  %select.16 = s32[] select(pred[] %compare.29, s32[] %bitcast-convert.30, s32[] %bitcast-convert.32)
  %compare.28 = pred[] compare(s32[] %select.17, s32[] %select.16), direction=GT
  %compare.27 = pred[] compare(s32[] %select.16, s32[] %select.17), direction=GT
  %compare.26 = pred[] compare(pred[] %compare.28, pred[] %compare.27), direction=EQ
  %param_0.2 = s32[] parameter(0)
  %param_1.3 = s32[] parameter(1)
  %compare.25 = pred[] compare(s32[] %param_0.2, s32[] %param_1.3), direction=LT
  ROOT %select.15 = pred[] select(pred[] %compare.26, pred[] %compare.25, pred[] %compare.28)
}

%compare-greater-than.1898 (p.0.lhs.1899: f32[], p.0.rhs.1900: f32[], p.1.lhs.1901: s32[], p.1.rhs.1902: s32[]) -> pred[] {
  %p.1.lhs.1901 = s32[] parameter(2)
  %p.1.rhs.1902 = s32[] parameter(3)
  %p.0.rhs.1900 = f32[] parameter(1)
  %p.0.lhs.1899 = f32[] parameter(0)
  ROOT %fusion = pred[] fusion(s32[] %p.1.lhs.1901, s32[] %p.1.rhs.1902, f32[] %p.0.rhs.1900, f32[] %p.0.lhs.1899), kind=kLoop, calls=%fused_computation
}

%fused_computation.1 (param_0.5: s32[], param_1.7: s32[], param_2.13: f32[], param_3.21: f32[]) -> pred[] {
  %param_3.21 = f32[] parameter(3)
  %bitcast-convert.41 = s32[] bitcast-convert(f32[] %param_3.21)
  %constant_130 = s32[] constant(0)
  %compare.36 = pred[] compare(s32[] %bitcast-convert.41, s32[] %constant_130), direction=LT
  %constant_129 = u32[] constant(2147483647)
  %bitcast-convert.40 = u32[] bitcast-convert(f32[] %param_3.21)
  %subtract.24 = u32[] subtract(u32[] %constant_129, u32[] %bitcast-convert.40)
  %bitcast-convert.39 = s32[] bitcast-convert(u32[] %subtract.24)
  %select.20 = s32[] select(pred[] %compare.36, s32[] %bitcast-convert.39, s32[] %bitcast-convert.41)
  %param_2.13 = f32[] parameter(2)
  %bitcast-convert.38 = s32[] bitcast-convert(f32[] %param_2.13)
  %compare.35 = pred[] compare(s32[] %bitcast-convert.38, s32[] %constant_130), direction=LT
  %bitcast-convert.37 = u32[] bitcast-convert(f32[] %param_2.13)
  %subtract.23 = u32[] subtract(u32[] %constant_129, u32[] %bitcast-convert.37)
  %bitcast-convert.36 = s32[] bitcast-convert(u32[] %subtract.23)
  %select.19 = s32[] select(pred[] %compare.35, s32[] %bitcast-convert.36, s32[] %bitcast-convert.38)
  %compare.34 = pred[] compare(s32[] %select.20, s32[] %select.19), direction=GT
  %compare.33 = pred[] compare(s32[] %select.19, s32[] %select.20), direction=GT
  %compare.32 = pred[] compare(pred[] %compare.34, pred[] %compare.33), direction=EQ
  %param_0.5 = s32[] parameter(0)
  %param_1.7 = s32[] parameter(1)
  %compare.31 = pred[] compare(s32[] %param_0.5, s32[] %param_1.7), direction=LT
  ROOT %select.18 = pred[] select(pred[] %compare.32, pred[] %compare.31, pred[] %compare.34)
}

%compare-greater-than.1972 (p.0.lhs.1973: f32[], p.0.rhs.1974: f32[], p.1.lhs.1975: s32[], p.1.rhs.1976: s32[]) -> pred[] {
  %p.1.lhs.1975 = s32[] parameter(2)
  %p.1.rhs.1976 = s32[] parameter(3)
  %p.0.rhs.1974 = f32[] parameter(1)
  %p.0.lhs.1973 = f32[] parameter(0)
  ROOT %fusion.1 = pred[] fusion(s32[] %p.1.lhs.1975, s32[] %p.1.rhs.1976, f32[] %p.0.rhs.1974, f32[] %p.0.lhs.1973), kind=kLoop, calls=%fused_computation.1
}

%fused_computation.2 (param_0.8: s32[], param_1.11: s32[], param_2.20: f32[], param_3.32: f32[]) -> pred[] {
  %param_3.32 = f32[] parameter(3)
  %bitcast-convert.47 = s32[] bitcast-convert(f32[] %param_3.32)
  %constant_132 = s32[] constant(0)
  %compare.42 = pred[] compare(s32[] %bitcast-convert.47, s32[] %constant_132), direction=LT
  %constant_131 = u32[] constant(2147483647)
  %bitcast-convert.46 = u32[] bitcast-convert(f32[] %param_3.32)
  %subtract.26 = u32[] subtract(u32[] %constant_131, u32[] %bitcast-convert.46)
  %bitcast-convert.45 = s32[] bitcast-convert(u32[] %subtract.26)
  %select.23 = s32[] select(pred[] %compare.42, s32[] %bitcast-convert.45, s32[] %bitcast-convert.47)
  %param_2.20 = f32[] parameter(2)
  %bitcast-convert.44 = s32[] bitcast-convert(f32[] %param_2.20)
  %compare.41 = pred[] compare(s32[] %bitcast-convert.44, s32[] %constant_132), direction=LT
  %bitcast-convert.43 = u32[] bitcast-convert(f32[] %param_2.20)
  %subtract.25 = u32[] subtract(u32[] %constant_131, u32[] %bitcast-convert.43)
  %bitcast-convert.42 = s32[] bitcast-convert(u32[] %subtract.25)
  %select.22 = s32[] select(pred[] %compare.41, s32[] %bitcast-convert.42, s32[] %bitcast-convert.44)
  %compare.40 = pred[] compare(s32[] %select.23, s32[] %select.22), direction=GT
  %compare.39 = pred[] compare(s32[] %select.22, s32[] %select.23), direction=GT
  %compare.38 = pred[] compare(pred[] %compare.40, pred[] %compare.39), direction=EQ
  %param_0.8 = s32[] parameter(0)
  %param_1.11 = s32[] parameter(1)
  %compare.37 = pred[] compare(s32[] %param_0.8, s32[] %param_1.11), direction=LT
  ROOT %select.21 = pred[] select(pred[] %compare.38, pred[] %compare.37, pred[] %compare.40)
}

%compare-greater-than.2138 (p.0.lhs.2139: f32[], p.0.rhs.2140: f32[], p.1.lhs.2141: s32[], p.1.rhs.2142: s32[]) -> pred[] {
  %p.1.lhs.2141 = s32[] parameter(2)
  %p.1.rhs.2142 = s32[] parameter(3)
  %p.0.rhs.2140 = f32[] parameter(1)
  %p.0.lhs.2139 = f32[] parameter(0)
  ROOT %fusion.2 = pred[] fusion(s32[] %p.1.lhs.2141, s32[] %p.1.rhs.2142, f32[] %p.0.rhs.2140, f32[] %p.0.lhs.2139), kind=kLoop, calls=%fused_computation.2
}

%fused_computation.3 (param_0.11: s32[], param_1.15: s32[], param_2.27: f32[], param_3.43: f32[]) -> pred[] {
  %param_3.43 = f32[] parameter(3)
  %bitcast-convert.53 = s32[] bitcast-convert(f32[] %param_3.43)
  %constant_134 = s32[] constant(0)
  %compare.48 = pred[] compare(s32[] %bitcast-convert.53, s32[] %constant_134), direction=LT
  %constant_133 = u32[] constant(2147483647)
  %bitcast-convert.52 = u32[] bitcast-convert(f32[] %param_3.43)
  %subtract.28 = u32[] subtract(u32[] %constant_133, u32[] %bitcast-convert.52)
  %bitcast-convert.51 = s32[] bitcast-convert(u32[] %subtract.28)
  %select.26 = s32[] select(pred[] %compare.48, s32[] %bitcast-convert.51, s32[] %bitcast-convert.53)
  %param_2.27 = f32[] parameter(2)
  %bitcast-convert.50 = s32[] bitcast-convert(f32[] %param_2.27)
  %compare.47 = pred[] compare(s32[] %bitcast-convert.50, s32[] %constant_134), direction=LT
  %bitcast-convert.49 = u32[] bitcast-convert(f32[] %param_2.27)
  %subtract.27 = u32[] subtract(u32[] %constant_133, u32[] %bitcast-convert.49)
  %bitcast-convert.48 = s32[] bitcast-convert(u32[] %subtract.27)
  %select.25 = s32[] select(pred[] %compare.47, s32[] %bitcast-convert.48, s32[] %bitcast-convert.50)
  %compare.46 = pred[] compare(s32[] %select.26, s32[] %select.25), direction=GT
  %compare.45 = pred[] compare(s32[] %select.25, s32[] %select.26), direction=GT
  %compare.44 = pred[] compare(pred[] %compare.46, pred[] %compare.45), direction=EQ
  %param_0.11 = s32[] parameter(0)
  %param_1.15 = s32[] parameter(1)
  %compare.43 = pred[] compare(s32[] %param_0.11, s32[] %param_1.15), direction=LT
  ROOT %select.24 = pred[] select(pred[] %compare.44, pred[] %compare.43, pred[] %compare.46)
}

%compare-greater-than.2304 (p.0.lhs.2305: f32[], p.0.rhs.2306: f32[], p.1.lhs.2307: s32[], p.1.rhs.2308: s32[]) -> pred[] {
  %p.1.lhs.2307 = s32[] parameter(2)
  %p.1.rhs.2308 = s32[] parameter(3)
  %p.0.rhs.2306 = f32[] parameter(1)
  %p.0.lhs.2305 = f32[] parameter(0)
  ROOT %fusion.3 = pred[] fusion(s32[] %p.1.lhs.2307, s32[] %p.1.rhs.2308, f32[] %p.0.rhs.2306, f32[] %p.0.lhs.2305), kind=kLoop, calls=%fused_computation.3
}

%fused_computation.4 (param_0.14: s32[], param_1.19: s32[], param_2.34: f32[], param_3.54: f32[]) -> pred[] {
  %param_3.54 = f32[] parameter(3)
  %bitcast-convert.59 = s32[] bitcast-convert(f32[] %param_3.54)
  %constant_136 = s32[] constant(0)
  %compare.54 = pred[] compare(s32[] %bitcast-convert.59, s32[] %constant_136), direction=LT
  %constant_135 = u32[] constant(2147483647)
  %bitcast-convert.58 = u32[] bitcast-convert(f32[] %param_3.54)
  %subtract.30 = u32[] subtract(u32[] %constant_135, u32[] %bitcast-convert.58)
  %bitcast-convert.57 = s32[] bitcast-convert(u32[] %subtract.30)
  %select.29 = s32[] select(pred[] %compare.54, s32[] %bitcast-convert.57, s32[] %bitcast-convert.59)
  %param_2.34 = f32[] parameter(2)
  %bitcast-convert.56 = s32[] bitcast-convert(f32[] %param_2.34)
  %compare.53 = pred[] compare(s32[] %bitcast-convert.56, s32[] %constant_136), direction=LT
  %bitcast-convert.55 = u32[] bitcast-convert(f32[] %param_2.34)
  %subtract.29 = u32[] subtract(u32[] %constant_135, u32[] %bitcast-convert.55)
  %bitcast-convert.54 = s32[] bitcast-convert(u32[] %subtract.29)
  %select.28 = s32[] select(pred[] %compare.53, s32[] %bitcast-convert.54, s32[] %bitcast-convert.56)
  %compare.52 = pred[] compare(s32[] %select.29, s32[] %select.28), direction=GT
  %compare.51 = pred[] compare(s32[] %select.28, s32[] %select.29), direction=GT
  %compare.50 = pred[] compare(pred[] %compare.52, pred[] %compare.51), direction=EQ
  %param_0.14 = s32[] parameter(0)
  %param_1.19 = s32[] parameter(1)
  %compare.49 = pred[] compare(s32[] %param_0.14, s32[] %param_1.19), direction=LT
  ROOT %select.27 = pred[] select(pred[] %compare.50, pred[] %compare.49, pred[] %compare.52)
}

%compare-greater-than.2470 (p.0.lhs.2471: f32[], p.0.rhs.2472: f32[], p.1.lhs.2473: s32[], p.1.rhs.2474: s32[]) -> pred[] {
  %p.1.lhs.2473 = s32[] parameter(2)
  %p.1.rhs.2474 = s32[] parameter(3)
  %p.0.rhs.2472 = f32[] parameter(1)
  %p.0.lhs.2471 = f32[] parameter(0)
  ROOT %fusion.4 = pred[] fusion(s32[] %p.1.lhs.2473, s32[] %p.1.rhs.2474, f32[] %p.0.rhs.2472, f32[] %p.0.lhs.2471), kind=kLoop, calls=%fused_computation.4
}

%fused_computation.6 (param_0.499: f32[1,3,200,304], param_1.589: f32[3]) -> f32[182400] {
  %param_0.499 = f32[1,3,200,304]{3,2,1,0} parameter(0)
  %param_1.589 = f32[3]{0} parameter(1)
  %broadcast.394 = f32[1,3,200,304]{3,2,1,0} broadcast(f32[3]{0} %param_1.589), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower0/rpn/class/BiasAdd"}
  %add.228 = f32[1,3,200,304]{3,2,1,0} add(f32[1,3,200,304]{3,2,1,0} %param_0.499, f32[1,3,200,304]{3,2,1,0} %broadcast.394), metadata={op_type="BiasAdd" op_name="tower0/rpn/class/BiasAdd"}
  %bitcast.308 = f32[1,200,304,3]{2,1,3,0} bitcast(f32[1,3,200,304]{3,2,1,0} %add.228), metadata={op_type="Transpose" op_name="tower0/rpn/transpose"}
  ROOT %reshape.185 = f32[182400]{0} reshape(f32[1,200,304,3]{2,1,3,0} %bitcast.308), metadata={op_type="Reshape" op_name="tower0/generate_fpn_proposals/Lvl2/Reshape_1"}
}

%fused_computation.7 (param_0.401: f32[1,200,304,12]) -> f32[182400,1,2] {
  %param_0.401 = f32[1,200,304,12]{3,2,1,0} parameter(0)
  %bitcast.547 = f32[182400,2,2]{2,1,0} bitcast(f32[1,200,304,12]{3,2,1,0} %param_0.401), metadata={op_type="Reshape" op_name="tower0/decode_bbox_target/Reshape"}
  %slice.2 = f32[182400,1,2]{2,1,0} slice(f32[182400,2,2]{2,1,0} %bitcast.547), slice={[0:182400], [1:2], [0:2]}, metadata={op_type="Split" op_name="tower0/decode_bbox_target/split"}
  %constant_138 = f32[] constant(4.43082), metadata={op_type="Minimum" op_name="tower0/decode_bbox_target_4/Minimum"}
  %broadcast.107 = f32[182400,1,2]{2,1,0} broadcast(f32[] %constant_138), dimensions={}, metadata={op_type="Minimum" op_name="tower0/decode_bbox_target/Minimum"}
  %minimum.1 = f32[182400,1,2]{2,1,0} minimum(f32[182400,1,2]{2,1,0} %slice.2, f32[182400,1,2]{2,1,0} %broadcast.107), metadata={op_type="Minimum" op_name="tower0/decode_bbox_target/Minimum"}
  ROOT %exponential.0 = f32[182400,1,2]{2,1,0} exponential(f32[182400,1,2]{2,1,0} %minimum.1), metadata={op_type="Exp" op_name="tower0/decode_bbox_target/Exp"}
}

%fused_computation.8 (param_0.25: f32[1,12,200,304], param_1.27: f32[12]) -> f32[1,200,304,12] {
  %param_0.25 = f32[1,12,200,304]{3,2,1,0} parameter(0)
  %param_1.27 = f32[12]{0} parameter(1)
  %broadcast.108 = f32[1,12,200,304]{3,2,1,0} broadcast(f32[12]{0} %param_1.27), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower0/rpn/box/BiasAdd"}
  %add.59 = f32[1,12,200,304]{3,2,1,0} add(f32[1,12,200,304]{3,2,1,0} %param_0.25, f32[1,12,200,304]{3,2,1,0} %broadcast.108), metadata={op_type="BiasAdd" op_name="tower0/rpn/box/BiasAdd"}
  %bitcast.309 = f32[1,200,304,12]{2,1,3,0} bitcast(f32[1,12,200,304]{3,2,1,0} %add.59), metadata={op_type="Transpose" op_name="tower0/rpn/transpose_1"}
  ROOT %copy.184 = f32[1,200,304,12]{3,2,1,0} copy(f32[1,200,304,12]{2,1,3,0} %bitcast.309), metadata={op_name="XLA_Retvals"}
}

%fused_computation.9 (param_0.501: f32[1,3,200,304], param_1.592: f32[3]) -> f32[200,304,3] {
  %param_0.501 = f32[1,3,200,304]{3,2,1,0} parameter(0)
  %param_1.592 = f32[3]{0} parameter(1)
  %broadcast.396 = f32[1,3,200,304]{3,2,1,0} broadcast(f32[3]{0} %param_1.592), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower0/rpn/class/BiasAdd"}
  %add.230 = f32[1,3,200,304]{3,2,1,0} add(f32[1,3,200,304]{3,2,1,0} %param_0.501, f32[1,3,200,304]{3,2,1,0} %broadcast.396), metadata={op_type="BiasAdd" op_name="tower0/rpn/class/BiasAdd"}
  %bitcast.310 = f32[200,304,3]{1,0,2} bitcast(f32[1,3,200,304]{3,2,1,0} %add.230), metadata={op_type="Squeeze" op_name="tower0/rpn/Squeeze"}
  ROOT %copy.185 = f32[200,304,3]{2,1,0} copy(f32[200,304,3]{1,0,2} %bitcast.310), metadata={op_name="XLA_Retvals"}
}

%fused_computation.12 (param_0.495: f32[1,3,100,152], param_1.583: f32[3]) -> f32[45600] {
  %param_0.495 = f32[1,3,100,152]{3,2,1,0} parameter(0)
  %param_1.583 = f32[3]{0} parameter(1)
  %broadcast.390 = f32[1,3,100,152]{3,2,1,0} broadcast(f32[3]{0} %param_1.583), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower0/rpn_1/class/BiasAdd"}
  %add.224 = f32[1,3,100,152]{3,2,1,0} add(f32[1,3,100,152]{3,2,1,0} %param_0.495, f32[1,3,100,152]{3,2,1,0} %broadcast.390), metadata={op_type="BiasAdd" op_name="tower0/rpn_1/class/BiasAdd"}
  %bitcast.312 = f32[1,100,152,3]{2,1,3,0} bitcast(f32[1,3,100,152]{3,2,1,0} %add.224), metadata={op_type="Transpose" op_name="tower0/rpn_1/transpose"}
  ROOT %reshape.186 = f32[45600]{0} reshape(f32[1,100,152,3]{2,1,3,0} %bitcast.312), metadata={op_type="Reshape" op_name="tower0/generate_fpn_proposals/Lvl3/Reshape_1"}
}

%fused_computation.13 (param_0.403: f32[1,100,152,12]) -> f32[45600,1,2] {
  %param_0.403 = f32[1,100,152,12]{3,2,1,0} parameter(0)
  %bitcast.549 = f32[45600,2,2]{2,1,0} bitcast(f32[1,100,152,12]{3,2,1,0} %param_0.403), metadata={op_type="Reshape" op_name="tower0/decode_bbox_target_1/Reshape"}
  %slice.5 = f32[45600,1,2]{2,1,0} slice(f32[45600,2,2]{2,1,0} %bitcast.549), slice={[0:45600], [1:2], [0:2]}, metadata={op_type="Split" op_name="tower0/decode_bbox_target_1/split"}
  %constant_140 = f32[] constant(4.43082), metadata={op_type="Minimum" op_name="tower0/decode_bbox_target_4/Minimum"}
  %broadcast.111 = f32[45600,1,2]{2,1,0} broadcast(f32[] %constant_140), dimensions={}, metadata={op_type="Minimum" op_name="tower0/decode_bbox_target_1/Minimum"}
  %minimum.3 = f32[45600,1,2]{2,1,0} minimum(f32[45600,1,2]{2,1,0} %slice.5, f32[45600,1,2]{2,1,0} %broadcast.111), metadata={op_type="Minimum" op_name="tower0/decode_bbox_target_1/Minimum"}
  ROOT %exponential.1 = f32[45600,1,2]{2,1,0} exponential(f32[45600,1,2]{2,1,0} %minimum.3), metadata={op_type="Exp" op_name="tower0/decode_bbox_target_1/Exp"}
}

%fused_computation.15 (param_0.405: s32[336,336,3]) -> (pred[200,304,3], pred[200,304,3]) {
  %param_0.405 = s32[336,336,3]{2,1,0} parameter(0)
  %slice.15 = s32[200,304,3]{2,1,0} slice(s32[336,336,3]{2,1,0} %param_0.405), slice={[0:200], [0:304], [0:3]}, metadata={op_type="Slice" op_name="tower0/FPN_slice_lvl0/narrow_to/Slice_1"}
  %constant_142 = s32[] constant(-1), metadata={op_type="NotEqual" op_name="tower0/rpn_losses/level5/NotEqual"}
  %broadcast.113 = s32[200,304,3]{2,1,0} broadcast(s32[] %constant_142), dimensions={}, metadata={op_type="NotEqual" op_name="tower0/rpn_losses/level2/NotEqual"}
  %compare.56 = pred[200,304,3]{2,1,0} compare(s32[200,304,3]{2,1,0} %slice.15, s32[200,304,3]{2,1,0} %broadcast.113), direction=NE, metadata={op_type="NotEqual" op_name="tower0/rpn_losses/level2/NotEqual"}
  %constant_141_clone_1 = s32[] constant(1), metadata={op_type="Equal" op_name="tower0/rpn_losses/level5/Equal"}
  %broadcast.112.clone.1 = s32[200,304,3]{2,1,0} broadcast(s32[] %constant_141_clone_1), dimensions={}, metadata={op_type="Equal" op_name="tower0/rpn_losses/level2/Equal"}
  %compare.55.clone.1 = pred[200,304,3]{2,1,0} compare(s32[200,304,3]{2,1,0} %slice.15, s32[200,304,3]{2,1,0} %broadcast.112.clone.1), direction=EQ, metadata={op_type="Equal" op_name="tower0/rpn_losses/level2/Equal"}
  ROOT %tuple.78 = (pred[200,304,3]{2,1,0}, pred[200,304,3]{2,1,0}) tuple(pred[200,304,3]{2,1,0} %compare.56, pred[200,304,3]{2,1,0} %compare.55.clone.1)
}

%fused_computation.16 (param_0.41: f32[1,12,100,152], param_1.41: f32[12]) -> f32[1,100,152,12] {
  %param_0.41 = f32[1,12,100,152]{3,2,1,0} parameter(0)
  %param_1.41 = f32[12]{0} parameter(1)
  %broadcast.114 = f32[1,12,100,152]{3,2,1,0} broadcast(f32[12]{0} %param_1.41), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower0/rpn_1/box/BiasAdd"}
  %add.63 = f32[1,12,100,152]{3,2,1,0} add(f32[1,12,100,152]{3,2,1,0} %param_0.41, f32[1,12,100,152]{3,2,1,0} %broadcast.114), metadata={op_type="BiasAdd" op_name="tower0/rpn_1/box/BiasAdd"}
  %bitcast.313 = f32[1,100,152,12]{2,1,3,0} bitcast(f32[1,12,100,152]{3,2,1,0} %add.63), metadata={op_type="Transpose" op_name="tower0/rpn_1/transpose_1"}
  ROOT %copy.186 = f32[1,100,152,12]{3,2,1,0} copy(f32[1,100,152,12]{2,1,3,0} %bitcast.313), metadata={op_name="XLA_Retvals"}
}

%fused_computation.17 (param_0.497: f32[1,3,100,152], param_1.586: f32[3]) -> f32[100,152,3] {
  %param_0.497 = f32[1,3,100,152]{3,2,1,0} parameter(0)
  %param_1.586 = f32[3]{0} parameter(1)
  %broadcast.392 = f32[1,3,100,152]{3,2,1,0} broadcast(f32[3]{0} %param_1.586), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower0/rpn_1/class/BiasAdd"}
  %add.226 = f32[1,3,100,152]{3,2,1,0} add(f32[1,3,100,152]{3,2,1,0} %param_0.497, f32[1,3,100,152]{3,2,1,0} %broadcast.392), metadata={op_type="BiasAdd" op_name="tower0/rpn_1/class/BiasAdd"}
  %bitcast.314 = f32[100,152,3]{1,0,2} bitcast(f32[1,3,100,152]{3,2,1,0} %add.226), metadata={op_type="Squeeze" op_name="tower0/rpn_1/Squeeze"}
  ROOT %copy.187 = f32[100,152,3]{2,1,0} copy(f32[100,152,3]{1,0,2} %bitcast.314), metadata={op_name="XLA_Retvals"}
}

%fused_computation.19 (param_0.406: s32[11400], param_1.422: f32[11400,1,2], param_2.344: f32[11400,1,2], param_3.307: f32[11400,1,2], param_4.244: f32[1,50,76,12], param_5.244: f32[2], param_6.133: s32[45600], param_7.82: f32[45600,1,2], param_8.27: f32[45600,1,2], param_9.14: f32[1,100,152,12], param_10.5: f32[45600,1,2], param_11.10: s32[182400], param_12.5: f32[182400,1,2], param_13.11: f32[182400,1,2], param_14.6: f32[182400,1,2], param_15.6: f32[1,200,304,12], param_16.9: s32[2850], param_17.13: f32[2850,1,2], param_18.5: f32[2850,1,2], param_19.4: f32[1,25,38,12], param_20.3: f32[2850,1,2]) -> (f32[2000,4], f32[2000,4], f32[2000,4], f32[2000,4]) {
  %constant_143 = f32[] constant(0.5), metadata={op_type="Mul" op_name="EMA/QueueInput/queue_size_EMA_apply/mul"}
  %broadcast.116 = f32[11400,1,2]{2,1,0} broadcast(f32[] %constant_143), dimensions={}, metadata={op_type="Mul" op_name="tower0/decode_bbox_target_2/mul"}
  %param_3.307 = f32[11400,1,2]{2,1,0} parameter(3)
  %multiply.36 = f32[11400,1,2]{2,1,0} multiply(f32[11400,1,2]{2,1,0} %broadcast.116, f32[11400,1,2]{2,1,0} %param_3.307), metadata={op_type="Mul" op_name="tower0/decode_bbox_target_2/mul"}
  %param_4.244 = f32[1,50,76,12]{3,2,1,0} parameter(4)
  %bitcast.550 = f32[11400,2,2]{2,1,0} bitcast(f32[1,50,76,12]{3,2,1,0} %param_4.244), metadata={op_type="Reshape" op_name="tower0/decode_bbox_target_2/Reshape"}
  %slice.7 = f32[11400,1,2]{2,1,0} slice(f32[11400,2,2]{2,1,0} %bitcast.550), slice={[0:11400], [0:1], [0:2]}, metadata={op_type="Split" op_name="tower0/decode_bbox_target_2/split"}
  %param_2.344 = f32[11400,1,2]{2,1,0} parameter(2)
  %multiply.35 = f32[11400,1,2]{2,1,0} multiply(f32[11400,1,2]{2,1,0} %slice.7, f32[11400,1,2]{2,1,0} %param_2.344), metadata={op_type="Mul" op_name="tower0/decode_bbox_target_2/mul_2"}
  %add.66 = f32[11400,1,2]{2,1,0} add(f32[11400,1,2]{2,1,0} %multiply.36, f32[11400,1,2]{2,1,0} %multiply.35), metadata={op_type="Add" op_name="tower0/decode_bbox_target_2/add_1"}
  %param_1.422 = f32[11400,1,2]{2,1,0} parameter(1)
  %multiply.34 = f32[11400,1,2]{2,1,0} multiply(f32[11400,1,2]{2,1,0} %broadcast.116, f32[11400,1,2]{2,1,0} %param_2.344), metadata={op_type="Mul" op_name="tower0/decode_bbox_target_2/mul_1"}
  %multiply.33 = f32[11400,1,2]{2,1,0} multiply(f32[11400,1,2]{2,1,0} %param_1.422, f32[11400,1,2]{2,1,0} %multiply.34), metadata={op_type="Mul" op_name="tower0/decode_bbox_target_2/mul_4"}
  %subtract.33 = f32[11400,1,2]{2,1,0} subtract(f32[11400,1,2]{2,1,0} %add.66, f32[11400,1,2]{2,1,0} %multiply.33), metadata={op_type="Sub" op_name="tower0/decode_bbox_target_2/sub_1"}
  %add.65 = f32[11400,1,2]{2,1,0} add(f32[11400,1,2]{2,1,0} %add.66, f32[11400,1,2]{2,1,0} %multiply.33), metadata={op_type="Add" op_name="tower0/decode_bbox_target_2/add_2"}
  %concatenate.2 = f32[11400,2,2]{2,1,0} concatenate(f32[11400,1,2]{2,1,0} %subtract.33, f32[11400,1,2]{2,1,0} %add.65), dimensions={1}, metadata={op_type="ConcatV2" op_name="tower0/decode_bbox_target_2/concat"}
  %bitcast.315 = f32[11400,4]{1,0} bitcast(f32[11400,2,2]{2,1,0} %concatenate.2), metadata={op_type="Reshape" op_name="tower0/generate_fpn_proposals/Lvl4/Reshape"}
  %param_0.406 = s32[11400]{0} parameter(0)
  %slice.6 = s32[2000]{0} slice(s32[11400]{0} %param_0.406), slice={[0:2000]}, metadata={op_type="TopKV2" op_name="tower0/generate_fpn_proposals/Lvl4/generate_rpn_proposals/TopKV2"}
  %gather.2 = f32[2000,4]{1,0} gather(f32[11400,4]{1,0} %bitcast.315, s32[2000]{0} %slice.6), offset_dims={1}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=1, slice_sizes={1,4}, metadata={op_type="GatherV2" op_name="tower0/generate_fpn_proposals/Lvl4/generate_rpn_proposals/GatherV2"}
  %constant_167 = f32[] constant(0), metadata={op_type="Relu" op_name="tower0/conv0/Relu"}
  %broadcast.265 = f32[2000,4]{1,0} broadcast(f32[] %constant_167), dimensions={}, metadata={op_type="Maximum" op_name="tower0/generate_fpn_proposals/Lvl5/generate_rpn_proposals/clip_boxes/Maximum"}
  %maximum.2 = f32[2000,4]{1,0} maximum(f32[2000,4]{1,0} %gather.2, f32[2000,4]{1,0} %broadcast.265), metadata={op_type="Maximum" op_name="tower0/generate_fpn_proposals/Lvl4/generate_rpn_proposals/clip_boxes/Maximum"}
  %param_5.244 = f32[2]{0} parameter(5)
  %broadcast.382 = f32[2,2]{1,0} broadcast(f32[2]{0} %param_5.244), dimensions={1}
  %bitcast.605 = f32[4]{0} bitcast(f32[2,2]{1,0} %broadcast.382), metadata={op_type="Cast" op_name="tower0/generate_fpn_proposals/Lvl6/generate_rpn_proposals/clip_boxes/Cast"}
  %broadcast.266 = f32[2000,4]{1,0} broadcast(f32[4]{0} %bitcast.605), dimensions={1}, metadata={op_type="Minimum" op_name="tower0/generate_fpn_proposals/Lvl5/generate_rpn_proposals/clip_boxes/Minimum"}
  %minimum.4 = f32[2000,4]{1,0} minimum(f32[2000,4]{1,0} %maximum.2, f32[2000,4]{1,0} %broadcast.266), metadata={op_type="Minimum" op_name="tower0/generate_fpn_proposals/Lvl4/generate_rpn_proposals/clip_boxes/Minimum"}
  %broadcast.110.clone.1 = f32[45600,1,2]{2,1,0} broadcast(f32[] %constant_143), dimensions={}, metadata={op_type="Mul" op_name="tower0/decode_bbox_target_1/mul"}
  %param_10.5 = f32[45600,1,2]{2,1,0} parameter(10)
  %multiply.32.clone.1 = f32[45600,1,2]{2,1,0} multiply(f32[45600,1,2]{2,1,0} %broadcast.110.clone.1, f32[45600,1,2]{2,1,0} %param_10.5), metadata={op_type="Mul" op_name="tower0/decode_bbox_target_1/mul"}
  %param_9.14 = f32[1,100,152,12]{3,2,1,0} parameter(9)
  %bitcast.548.clone.1 = f32[45600,2,2]{2,1,0} bitcast(f32[1,100,152,12]{3,2,1,0} %param_9.14), metadata={op_type="Reshape" op_name="tower0/decode_bbox_target_1/Reshape"}
  %slice.4.clone.1 = f32[45600,1,2]{2,1,0} slice(f32[45600,2,2]{2,1,0} %bitcast.548.clone.1), slice={[0:45600], [0:1], [0:2]}, metadata={op_type="Split" op_name="tower0/decode_bbox_target_1/split"}
  %param_8.27 = f32[45600,1,2]{2,1,0} parameter(8)
  %multiply.31.clone.1 = f32[45600,1,2]{2,1,0} multiply(f32[45600,1,2]{2,1,0} %slice.4.clone.1, f32[45600,1,2]{2,1,0} %param_8.27), metadata={op_type="Mul" op_name="tower0/decode_bbox_target_1/mul_2"}
  %add.62.clone.1 = f32[45600,1,2]{2,1,0} add(f32[45600,1,2]{2,1,0} %multiply.32.clone.1, f32[45600,1,2]{2,1,0} %multiply.31.clone.1), metadata={op_type="Add" op_name="tower0/decode_bbox_target_1/add_1"}
  %param_7.82 = f32[45600,1,2]{2,1,0} parameter(7)
  %multiply.30.clone.1 = f32[45600,1,2]{2,1,0} multiply(f32[45600,1,2]{2,1,0} %broadcast.110.clone.1, f32[45600,1,2]{2,1,0} %param_8.27), metadata={op_type="Mul" op_name="tower0/decode_bbox_target_1/mul_1"}
  %multiply.29.clone.1 = f32[45600,1,2]{2,1,0} multiply(f32[45600,1,2]{2,1,0} %param_7.82, f32[45600,1,2]{2,1,0} %multiply.30.clone.1), metadata={op_type="Mul" op_name="tower0/decode_bbox_target_1/mul_4"}
  %subtract.32.clone.1 = f32[45600,1,2]{2,1,0} subtract(f32[45600,1,2]{2,1,0} %add.62.clone.1, f32[45600,1,2]{2,1,0} %multiply.29.clone.1), metadata={op_type="Sub" op_name="tower0/decode_bbox_target_1/sub_1"}
  %add.61.clone.1 = f32[45600,1,2]{2,1,0} add(f32[45600,1,2]{2,1,0} %add.62.clone.1, f32[45600,1,2]{2,1,0} %multiply.29.clone.1), metadata={op_type="Add" op_name="tower0/decode_bbox_target_1/add_2"}
  %concatenate.1.clone.1 = f32[45600,2,2]{2,1,0} concatenate(f32[45600,1,2]{2,1,0} %subtract.32.clone.1, f32[45600,1,2]{2,1,0} %add.61.clone.1), dimensions={1}, metadata={op_type="ConcatV2" op_name="tower0/decode_bbox_target_1/concat"}
  %bitcast.311.clone.1 = f32[45600,4]{1,0} bitcast(f32[45600,2,2]{2,1,0} %concatenate.1.clone.1), metadata={op_type="Reshape" op_name="tower0/generate_fpn_proposals/Lvl3/Reshape"}
  %param_6.133 = s32[45600]{0} parameter(6)
  %slice.3.clone.1 = s32[2000]{0} slice(s32[45600]{0} %param_6.133), slice={[0:2000]}, metadata={op_type="TopKV2" op_name="tower0/generate_fpn_proposals/Lvl3/generate_rpn_proposals/TopKV2"}
  %gather.1.clone.1 = f32[2000,4]{1,0} gather(f32[45600,4]{1,0} %bitcast.311.clone.1, s32[2000]{0} %slice.3.clone.1), offset_dims={1}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=1, slice_sizes={1,4}, metadata={op_type="GatherV2" op_name="tower0/generate_fpn_proposals/Lvl3/generate_rpn_proposals/GatherV2"}
  %maximum.1.clone.1 = f32[2000,4]{1,0} maximum(f32[2000,4]{1,0} %gather.1.clone.1, f32[2000,4]{1,0} %broadcast.265), metadata={op_type="Maximum" op_name="tower0/generate_fpn_proposals/Lvl3/generate_rpn_proposals/clip_boxes/Maximum"}
  %minimum.2.clone.1 = f32[2000,4]{1,0} minimum(f32[2000,4]{1,0} %maximum.1.clone.1, f32[2000,4]{1,0} %broadcast.266), metadata={op_type="Minimum" op_name="tower0/generate_fpn_proposals/Lvl3/generate_rpn_proposals/clip_boxes/Minimum"}
  %broadcast.126.clone.1 = f32[2850,1,2]{2,1,0} broadcast(f32[] %constant_143), dimensions={}, metadata={op_type="Mul" op_name="tower0/decode_bbox_target_3/mul"}
  %param_20.3 = f32[2850,1,2]{2,1,0} parameter(20)
  %multiply.44.clone.1 = f32[2850,1,2]{2,1,0} multiply(f32[2850,1,2]{2,1,0} %broadcast.126.clone.1, f32[2850,1,2]{2,1,0} %param_20.3), metadata={op_type="Mul" op_name="tower0/decode_bbox_target_3/mul"}
  %param_19.4 = f32[1,25,38,12]{3,2,1,0} parameter(19)
  %bitcast.554.clone.1 = f32[2850,2,2]{2,1,0} bitcast(f32[1,25,38,12]{3,2,1,0} %param_19.4), metadata={op_type="Reshape" op_name="tower0/decode_bbox_target_3/Reshape"}
  %slice.12.clone.1 = f32[2850,1,2]{2,1,0} slice(f32[2850,2,2]{2,1,0} %bitcast.554.clone.1), slice={[0:2850], [0:1], [0:2]}, metadata={op_type="Split" op_name="tower0/decode_bbox_target_3/split"}
  %param_18.5 = f32[2850,1,2]{2,1,0} parameter(18)
  %multiply.43.clone.1 = f32[2850,1,2]{2,1,0} multiply(f32[2850,1,2]{2,1,0} %slice.12.clone.1, f32[2850,1,2]{2,1,0} %param_18.5), metadata={op_type="Mul" op_name="tower0/decode_bbox_target_3/mul_2"}
  %add.72.clone.1 = f32[2850,1,2]{2,1,0} add(f32[2850,1,2]{2,1,0} %multiply.44.clone.1, f32[2850,1,2]{2,1,0} %multiply.43.clone.1), metadata={op_type="Add" op_name="tower0/decode_bbox_target_3/add_1"}
  %param_17.13 = f32[2850,1,2]{2,1,0} parameter(17)
  %multiply.42.clone.1 = f32[2850,1,2]{2,1,0} multiply(f32[2850,1,2]{2,1,0} %broadcast.126.clone.1, f32[2850,1,2]{2,1,0} %param_18.5), metadata={op_type="Mul" op_name="tower0/decode_bbox_target_3/mul_1"}
  %multiply.41.clone.1 = f32[2850,1,2]{2,1,0} multiply(f32[2850,1,2]{2,1,0} %param_17.13, f32[2850,1,2]{2,1,0} %multiply.42.clone.1), metadata={op_type="Mul" op_name="tower0/decode_bbox_target_3/mul_4"}
  %subtract.35.clone.1 = f32[2850,1,2]{2,1,0} subtract(f32[2850,1,2]{2,1,0} %add.72.clone.1, f32[2850,1,2]{2,1,0} %multiply.41.clone.1), metadata={op_type="Sub" op_name="tower0/decode_bbox_target_3/sub_1"}
  %add.71.clone.1 = f32[2850,1,2]{2,1,0} add(f32[2850,1,2]{2,1,0} %add.72.clone.1, f32[2850,1,2]{2,1,0} %multiply.41.clone.1), metadata={op_type="Add" op_name="tower0/decode_bbox_target_3/add_2"}
  %concatenate.4.clone.1 = f32[2850,2,2]{2,1,0} concatenate(f32[2850,1,2]{2,1,0} %subtract.35.clone.1, f32[2850,1,2]{2,1,0} %add.71.clone.1), dimensions={1}, metadata={op_type="ConcatV2" op_name="tower0/decode_bbox_target_3/concat"}
  %bitcast.321.clone.1 = f32[2850,4]{1,0} bitcast(f32[2850,2,2]{2,1,0} %concatenate.4.clone.1), metadata={op_type="Reshape" op_name="tower0/generate_fpn_proposals/Lvl5/Reshape"}
  %param_16.9 = s32[2850]{0} parameter(16)
  %slice.11.clone.1 = s32[2000]{0} slice(s32[2850]{0} %param_16.9), slice={[0:2000]}, metadata={op_type="TopKV2" op_name="tower0/generate_fpn_proposals/Lvl5/generate_rpn_proposals/TopKV2"}
  %gather.4.clone.1 = f32[2000,4]{1,0} gather(f32[2850,4]{1,0} %bitcast.321.clone.1, s32[2000]{0} %slice.11.clone.1), offset_dims={1}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=1, slice_sizes={1,4}, metadata={op_type="GatherV2" op_name="tower0/generate_fpn_proposals/Lvl5/generate_rpn_proposals/GatherV2"}
  %maximum.4.clone.1 = f32[2000,4]{1,0} maximum(f32[2000,4]{1,0} %gather.4.clone.1, f32[2000,4]{1,0} %broadcast.265), metadata={op_type="Maximum" op_name="tower0/generate_fpn_proposals/Lvl5/generate_rpn_proposals/clip_boxes/Maximum"}
  %minimum.8.clone.1 = f32[2000,4]{1,0} minimum(f32[2000,4]{1,0} %maximum.4.clone.1, f32[2000,4]{1,0} %broadcast.266), metadata={op_type="Minimum" op_name="tower0/generate_fpn_proposals/Lvl5/generate_rpn_proposals/clip_boxes/Minimum"}
  %param_15.6 = f32[1,200,304,12]{3,2,1,0} parameter(15)
  %bitcast.546.clone.1.clone.1 = f32[182400,2,2]{2,1,0} bitcast(f32[1,200,304,12]{3,2,1,0} %param_15.6), metadata={op_type="Reshape" op_name="tower0/decode_bbox_target/Reshape"}
  %slice.1.clone.1.clone.1 = f32[182400,1,2]{2,1,0} slice(f32[182400,2,2]{2,1,0} %bitcast.546.clone.1.clone.1), slice={[0:182400], [0:1], [0:2]}, metadata={op_type="Split" op_name="tower0/decode_bbox_target/split"}
  %param_13.11 = f32[182400,1,2]{2,1,0} parameter(13)
  %multiply.28.clone.1.clone.1 = f32[182400,1,2]{2,1,0} multiply(f32[182400,1,2]{2,1,0} %slice.1.clone.1.clone.1, f32[182400,1,2]{2,1,0} %param_13.11), metadata={op_type="Mul" op_name="tower0/decode_bbox_target/mul_2"}
  %broadcast.106.clone.1.clone.1 = f32[182400,1,2]{2,1,0} broadcast(f32[] %constant_143), dimensions={}, metadata={op_type="Mul" op_name="tower0/rpn_losses/encode_bbox_target/mul"}
  %param_14.6 = f32[182400,1,2]{2,1,0} parameter(14)
  %multiply.27.clone.1.clone.1 = f32[182400,1,2]{2,1,0} multiply(f32[182400,1,2]{2,1,0} %broadcast.106.clone.1.clone.1, f32[182400,1,2]{2,1,0} %param_14.6), metadata={op_type="Mul" op_name="tower0/rpn_losses/encode_bbox_target/mul"}
  %add.58.clone.1.clone.1 = f32[182400,1,2]{2,1,0} add(f32[182400,1,2]{2,1,0} %multiply.28.clone.1.clone.1, f32[182400,1,2]{2,1,0} %multiply.27.clone.1.clone.1), metadata={op_type="Add" op_name="tower0/decode_bbox_target/add_1"}
  %param_12.5 = f32[182400,1,2]{2,1,0} parameter(12)
  %multiply.26.clone.1.clone.1 = f32[182400,1,2]{2,1,0} multiply(f32[182400,1,2]{2,1,0} %broadcast.106.clone.1.clone.1, f32[182400,1,2]{2,1,0} %param_13.11), metadata={op_type="Mul" op_name="tower0/decode_bbox_target/mul_1"}
  %multiply.25.clone.1.clone.1 = f32[182400,1,2]{2,1,0} multiply(f32[182400,1,2]{2,1,0} %param_12.5, f32[182400,1,2]{2,1,0} %multiply.26.clone.1.clone.1), metadata={op_type="Mul" op_name="tower0/decode_bbox_target/mul_4"}
  %subtract.31.clone.1.clone.1 = f32[182400,1,2]{2,1,0} subtract(f32[182400,1,2]{2,1,0} %add.58.clone.1.clone.1, f32[182400,1,2]{2,1,0} %multiply.25.clone.1.clone.1), metadata={op_type="Sub" op_name="tower0/decode_bbox_target/sub_1"}
  %add.57.clone.1.clone.1 = f32[182400,1,2]{2,1,0} add(f32[182400,1,2]{2,1,0} %add.58.clone.1.clone.1, f32[182400,1,2]{2,1,0} %multiply.25.clone.1.clone.1), metadata={op_type="Add" op_name="tower0/decode_bbox_target/add_2"}
  %concatenate.0.clone.1.clone.1 = f32[182400,2,2]{2,1,0} concatenate(f32[182400,1,2]{2,1,0} %subtract.31.clone.1.clone.1, f32[182400,1,2]{2,1,0} %add.57.clone.1.clone.1), dimensions={1}, metadata={op_type="ConcatV2" op_name="tower0/decode_bbox_target/concat"}
  %bitcast.307.clone.1.clone.1 = f32[182400,4]{1,0} bitcast(f32[182400,2,2]{2,1,0} %concatenate.0.clone.1.clone.1), metadata={op_type="Reshape" op_name="tower0/generate_fpn_proposals/Lvl2/Reshape"}
  %param_11.10 = s32[182400]{0} parameter(11)
  %slice.0.clone.1.clone.1 = s32[2000]{0} slice(s32[182400]{0} %param_11.10), slice={[0:2000]}, metadata={op_type="TopKV2" op_name="tower0/generate_fpn_proposals/Lvl2/generate_rpn_proposals/TopKV2"}
  %gather.0.clone.1.clone.1 = f32[2000,4]{1,0} gather(f32[182400,4]{1,0} %bitcast.307.clone.1.clone.1, s32[2000]{0} %slice.0.clone.1.clone.1), offset_dims={1}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=1, slice_sizes={1,4}, metadata={op_type="GatherV2" op_name="tower0/generate_fpn_proposals/Lvl2/generate_rpn_proposals/GatherV2"}
  %maximum.0.clone.1.clone.1 = f32[2000,4]{1,0} maximum(f32[2000,4]{1,0} %gather.0.clone.1.clone.1, f32[2000,4]{1,0} %broadcast.265), metadata={op_type="Maximum" op_name="tower0/generate_fpn_proposals/Lvl2/generate_rpn_proposals/clip_boxes/Maximum"}
  %minimum.0.clone.1.clone.1 = f32[2000,4]{1,0} minimum(f32[2000,4]{1,0} %maximum.0.clone.1.clone.1, f32[2000,4]{1,0} %broadcast.266), metadata={op_type="Minimum" op_name="tower0/generate_fpn_proposals/Lvl2/generate_rpn_proposals/clip_boxes/Minimum"}
  ROOT %tuple.85 = (f32[2000,4]{1,0}, f32[2000,4]{1,0}, f32[2000,4]{1,0}, f32[2000,4]{1,0}) tuple(f32[2000,4]{1,0} %minimum.4, f32[2000,4]{1,0} %minimum.2.clone.1, f32[2000,4]{1,0} %minimum.8.clone.1, f32[2000,4]{1,0} %minimum.0.clone.1.clone.1)
}

%fused_computation.20 (param_0.491: f32[1,3,50,76], param_1.577: f32[3]) -> f32[11400] {
  %param_0.491 = f32[1,3,50,76]{3,2,1,0} parameter(0)
  %param_1.577 = f32[3]{0} parameter(1)
  %broadcast.386 = f32[1,3,50,76]{3,2,1,0} broadcast(f32[3]{0} %param_1.577), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower0/rpn_2/class/BiasAdd"}
  %add.220 = f32[1,3,50,76]{3,2,1,0} add(f32[1,3,50,76]{3,2,1,0} %param_0.491, f32[1,3,50,76]{3,2,1,0} %broadcast.386), metadata={op_type="BiasAdd" op_name="tower0/rpn_2/class/BiasAdd"}
  %bitcast.316 = f32[1,50,76,3]{2,1,3,0} bitcast(f32[1,3,50,76]{3,2,1,0} %add.220), metadata={op_type="Transpose" op_name="tower0/rpn_2/transpose"}
  ROOT %reshape.187 = f32[11400]{0} reshape(f32[1,50,76,3]{2,1,3,0} %bitcast.316), metadata={op_type="Reshape" op_name="tower0/generate_fpn_proposals/Lvl4/Reshape_1"}
}

%fused_computation.21 (param_0.407: f32[1,50,76,12]) -> f32[11400,1,2] {
  %param_0.407 = f32[1,50,76,12]{3,2,1,0} parameter(0)
  %bitcast.551 = f32[11400,2,2]{2,1,0} bitcast(f32[1,50,76,12]{3,2,1,0} %param_0.407), metadata={op_type="Reshape" op_name="tower0/decode_bbox_target_2/Reshape"}
  %slice.8 = f32[11400,1,2]{2,1,0} slice(f32[11400,2,2]{2,1,0} %bitcast.551), slice={[0:11400], [1:2], [0:2]}, metadata={op_type="Split" op_name="tower0/decode_bbox_target_2/split"}
  %constant_144 = f32[] constant(4.43082), metadata={op_type="Minimum" op_name="tower0/decode_bbox_target_4/Minimum"}
  %broadcast.117 = f32[11400,1,2]{2,1,0} broadcast(f32[] %constant_144), dimensions={}, metadata={op_type="Minimum" op_name="tower0/decode_bbox_target_2/Minimum"}
  %minimum.5 = f32[11400,1,2]{2,1,0} minimum(f32[11400,1,2]{2,1,0} %slice.8, f32[11400,1,2]{2,1,0} %broadcast.117), metadata={op_type="Minimum" op_name="tower0/decode_bbox_target_2/Minimum"}
  ROOT %exponential.2 = f32[11400,1,2]{2,1,0} exponential(f32[11400,1,2]{2,1,0} %minimum.5), metadata={op_type="Exp" op_name="tower0/decode_bbox_target_2/Exp"}
}

%fused_computation.23 (param_0.409: s32[168,168,3]) -> (pred[100,152,3], pred[100,152,3]) {
  %param_0.409 = s32[168,168,3]{2,1,0} parameter(0)
  %slice.17 = s32[100,152,3]{2,1,0} slice(s32[168,168,3]{2,1,0} %param_0.409), slice={[0:100], [0:152], [0:3]}, metadata={op_type="Slice" op_name="tower0/FPN_slice_lvl1/narrow_to/Slice_1"}
  %constant_146 = s32[] constant(-1), metadata={op_type="NotEqual" op_name="tower0/rpn_losses/level5/NotEqual"}
  %broadcast.119 = s32[100,152,3]{2,1,0} broadcast(s32[] %constant_146), dimensions={}, metadata={op_type="NotEqual" op_name="tower0/rpn_losses/level3/NotEqual"}
  %compare.58 = pred[100,152,3]{2,1,0} compare(s32[100,152,3]{2,1,0} %slice.17, s32[100,152,3]{2,1,0} %broadcast.119), direction=NE, metadata={op_type="NotEqual" op_name="tower0/rpn_losses/level3/NotEqual"}
  %constant_145_clone_1 = s32[] constant(1), metadata={op_type="Equal" op_name="tower0/rpn_losses/level5/Equal"}
  %broadcast.118.clone.1 = s32[100,152,3]{2,1,0} broadcast(s32[] %constant_145_clone_1), dimensions={}, metadata={op_type="Equal" op_name="tower0/rpn_losses/level3/Equal"}
  %compare.57.clone.1 = pred[100,152,3]{2,1,0} compare(s32[100,152,3]{2,1,0} %slice.17, s32[100,152,3]{2,1,0} %broadcast.118.clone.1), direction=EQ, metadata={op_type="Equal" op_name="tower0/rpn_losses/level3/Equal"}
  ROOT %tuple.79 = (pred[100,152,3]{2,1,0}, pred[100,152,3]{2,1,0}) tuple(pred[100,152,3]{2,1,0} %compare.58, pred[100,152,3]{2,1,0} %compare.57.clone.1)
}

%fused_computation.24 (param_0.57: f32[1,12,50,76], param_1.55: f32[12]) -> f32[1,50,76,12] {
  %param_0.57 = f32[1,12,50,76]{3,2,1,0} parameter(0)
  %param_1.55 = f32[12]{0} parameter(1)
  %broadcast.120 = f32[1,12,50,76]{3,2,1,0} broadcast(f32[12]{0} %param_1.55), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower0/rpn_2/box/BiasAdd"}
  %add.67 = f32[1,12,50,76]{3,2,1,0} add(f32[1,12,50,76]{3,2,1,0} %param_0.57, f32[1,12,50,76]{3,2,1,0} %broadcast.120), metadata={op_type="BiasAdd" op_name="tower0/rpn_2/box/BiasAdd"}
  %bitcast.317 = f32[1,50,76,12]{2,1,3,0} bitcast(f32[1,12,50,76]{3,2,1,0} %add.67), metadata={op_type="Transpose" op_name="tower0/rpn_2/transpose_1"}
  ROOT %copy.188 = f32[1,50,76,12]{3,2,1,0} copy(f32[1,50,76,12]{2,1,3,0} %bitcast.317), metadata={op_name="XLA_Retvals"}
}

%fused_computation.25 (param_0.485: s32[741], param_1.574: f32[741,1,2], param_2.431: f32[741,1,2], param_3.394: f32[741,1,2], param_4.329: f32[1,13,19,12], param_5.238: f32[2]) -> f32[741,4] {
  %constant_147 = f32[] constant(0.5), metadata={op_type="Mul" op_name="EMA/QueueInput/queue_size_EMA_apply/mul"}
  %broadcast.123 = f32[741,1,2]{2,1,0} broadcast(f32[] %constant_147), dimensions={}, metadata={op_type="Mul" op_name="tower0/decode_bbox_target_4/mul"}
  %param_3.394 = f32[741,1,2]{2,1,0} parameter(3)
  %multiply.40 = f32[741,1,2]{2,1,0} multiply(f32[741,1,2]{2,1,0} %broadcast.123, f32[741,1,2]{2,1,0} %param_3.394), metadata={op_type="Mul" op_name="tower0/decode_bbox_target_4/mul"}
  %param_4.329 = f32[1,13,19,12]{3,2,1,0} parameter(4)
  %bitcast.552 = f32[741,2,2]{2,1,0} bitcast(f32[1,13,19,12]{3,2,1,0} %param_4.329), metadata={op_type="Reshape" op_name="tower0/decode_bbox_target_4/Reshape"}
  %slice.9 = f32[741,1,2]{2,1,0} slice(f32[741,2,2]{2,1,0} %bitcast.552), slice={[0:741], [0:1], [0:2]}, metadata={op_type="Split" op_name="tower0/decode_bbox_target_4/split"}
  %param_2.431 = f32[741,1,2]{2,1,0} parameter(2)
  %multiply.39 = f32[741,1,2]{2,1,0} multiply(f32[741,1,2]{2,1,0} %slice.9, f32[741,1,2]{2,1,0} %param_2.431), metadata={op_type="Mul" op_name="tower0/decode_bbox_target_4/mul_2"}
  %add.69 = f32[741,1,2]{2,1,0} add(f32[741,1,2]{2,1,0} %multiply.40, f32[741,1,2]{2,1,0} %multiply.39), metadata={op_type="Add" op_name="tower0/decode_bbox_target_4/add_1"}
  %param_1.574 = f32[741,1,2]{2,1,0} parameter(1)
  %multiply.38 = f32[741,1,2]{2,1,0} multiply(f32[741,1,2]{2,1,0} %broadcast.123, f32[741,1,2]{2,1,0} %param_2.431), metadata={op_type="Mul" op_name="tower0/decode_bbox_target_4/mul_1"}
  %multiply.37 = f32[741,1,2]{2,1,0} multiply(f32[741,1,2]{2,1,0} %param_1.574, f32[741,1,2]{2,1,0} %multiply.38), metadata={op_type="Mul" op_name="tower0/decode_bbox_target_4/mul_4"}
  %subtract.34 = f32[741,1,2]{2,1,0} subtract(f32[741,1,2]{2,1,0} %add.69, f32[741,1,2]{2,1,0} %multiply.37), metadata={op_type="Sub" op_name="tower0/decode_bbox_target_4/sub_1"}
  %add.68 = f32[741,1,2]{2,1,0} add(f32[741,1,2]{2,1,0} %add.69, f32[741,1,2]{2,1,0} %multiply.37), metadata={op_type="Add" op_name="tower0/decode_bbox_target_4/add_2"}
  %concatenate.3 = f32[741,2,2]{2,1,0} concatenate(f32[741,1,2]{2,1,0} %subtract.34, f32[741,1,2]{2,1,0} %add.68), dimensions={1}, metadata={op_type="ConcatV2" op_name="tower0/decode_bbox_target_4/concat"}
  %bitcast.318 = f32[741,4]{1,0} bitcast(f32[741,2,2]{2,1,0} %concatenate.3), metadata={op_type="Reshape" op_name="tower0/generate_fpn_proposals/Lvl6/Reshape"}
  %param_0.485 = s32[741]{0} parameter(0)
  %gather.3 = f32[741,4]{1,0} gather(f32[741,4]{1,0} %bitcast.318, s32[741]{0} %param_0.485), offset_dims={1}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=1, slice_sizes={1,4}, metadata={op_type="GatherV2" op_name="tower0/generate_fpn_proposals/Lvl6/generate_rpn_proposals/GatherV2"}
  %constant_148 = f32[] constant(0), metadata={op_type="Relu" op_name="tower0/conv0/Relu"}
  %broadcast.122 = f32[741,4]{1,0} broadcast(f32[] %constant_148), dimensions={}, metadata={op_type="Maximum" op_name="tower0/generate_fpn_proposals/Lvl6/generate_rpn_proposals/clip_boxes/Maximum"}
  %maximum.3 = f32[741,4]{1,0} maximum(f32[741,4]{1,0} %gather.3, f32[741,4]{1,0} %broadcast.122), metadata={op_type="Maximum" op_name="tower0/generate_fpn_proposals/Lvl6/generate_rpn_proposals/clip_boxes/Maximum"}
  %param_5.238 = f32[2]{0} parameter(5)
  %broadcast.376 = f32[2,2]{1,0} broadcast(f32[2]{0} %param_5.238), dimensions={1}
  %bitcast.599 = f32[4]{0} bitcast(f32[2,2]{1,0} %broadcast.376), metadata={op_type="Cast" op_name="tower0/generate_fpn_proposals/Lvl6/generate_rpn_proposals/clip_boxes/Cast"}
  %broadcast.121 = f32[741,4]{1,0} broadcast(f32[4]{0} %bitcast.599), dimensions={1}, metadata={op_type="Minimum" op_name="tower0/generate_fpn_proposals/Lvl6/generate_rpn_proposals/clip_boxes/Minimum"}
  ROOT %minimum.6 = f32[741,4]{1,0} minimum(f32[741,4]{1,0} %maximum.3, f32[741,4]{1,0} %broadcast.121), metadata={op_type="Minimum" op_name="tower0/generate_fpn_proposals/Lvl6/generate_rpn_proposals/clip_boxes/Minimum"}
}

%fused_computation.26 (param_0.481: f32[1,3,13,19], param_1.570: f32[3]) -> f32[741] {
  %param_0.481 = f32[1,3,13,19]{3,2,1,0} parameter(0)
  %param_1.570 = f32[3]{0} parameter(1)
  %broadcast.372 = f32[1,3,13,19]{3,2,1,0} broadcast(f32[3]{0} %param_1.570), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower0/rpn_4/class/BiasAdd"}
  %add.216 = f32[1,3,13,19]{3,2,1,0} add(f32[1,3,13,19]{3,2,1,0} %param_0.481, f32[1,3,13,19]{3,2,1,0} %broadcast.372), metadata={op_type="BiasAdd" op_name="tower0/rpn_4/class/BiasAdd"}
  %bitcast.319 = f32[1,13,19,3]{2,1,3,0} bitcast(f32[1,3,13,19]{3,2,1,0} %add.216), metadata={op_type="Transpose" op_name="tower0/rpn_4/transpose"}
  ROOT %reshape.188 = f32[741]{0} reshape(f32[1,13,19,3]{2,1,3,0} %bitcast.319), metadata={op_type="Reshape" op_name="tower0/generate_fpn_proposals/Lvl6/Reshape_1"}
}

%fused_computation.27 (param_0.410: f32[1,13,19,12]) -> f32[741,1,2] {
  %param_0.410 = f32[1,13,19,12]{3,2,1,0} parameter(0)
  %bitcast.553 = f32[741,2,2]{2,1,0} bitcast(f32[1,13,19,12]{3,2,1,0} %param_0.410), metadata={op_type="Reshape" op_name="tower0/decode_bbox_target_4/Reshape"}
  %slice.10 = f32[741,1,2]{2,1,0} slice(f32[741,2,2]{2,1,0} %bitcast.553), slice={[0:741], [1:2], [0:2]}, metadata={op_type="Split" op_name="tower0/decode_bbox_target_4/split"}
  %constant_149 = f32[] constant(4.43082), metadata={op_type="Minimum" op_name="tower0/decode_bbox_target_4/Minimum"}
  %broadcast.124 = f32[741,1,2]{2,1,0} broadcast(f32[] %constant_149), dimensions={}, metadata={op_type="Minimum" op_name="tower0/decode_bbox_target_4/Minimum"}
  %minimum.7 = f32[741,1,2]{2,1,0} minimum(f32[741,1,2]{2,1,0} %slice.10, f32[741,1,2]{2,1,0} %broadcast.124), metadata={op_type="Minimum" op_name="tower0/decode_bbox_target_4/Minimum"}
  ROOT %exponential.3 = f32[741,1,2]{2,1,0} exponential(f32[741,1,2]{2,1,0} %minimum.7), metadata={op_type="Exp" op_name="tower0/decode_bbox_target_4/Exp"}
}

%fused_computation.28 (param_0.493: f32[1,3,50,76], param_1.580: f32[3]) -> f32[50,76,3] {
  %param_0.493 = f32[1,3,50,76]{3,2,1,0} parameter(0)
  %param_1.580 = f32[3]{0} parameter(1)
  %broadcast.388 = f32[1,3,50,76]{3,2,1,0} broadcast(f32[3]{0} %param_1.580), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower0/rpn_2/class/BiasAdd"}
  %add.222 = f32[1,3,50,76]{3,2,1,0} add(f32[1,3,50,76]{3,2,1,0} %param_0.493, f32[1,3,50,76]{3,2,1,0} %broadcast.388), metadata={op_type="BiasAdd" op_name="tower0/rpn_2/class/BiasAdd"}
  %bitcast.320 = f32[50,76,3]{1,0,2} bitcast(f32[1,3,50,76]{3,2,1,0} %add.222), metadata={op_type="Squeeze" op_name="tower0/rpn_2/Squeeze"}
  ROOT %copy.189 = f32[50,76,3]{2,1,0} copy(f32[50,76,3]{1,0,2} %bitcast.320), metadata={op_name="XLA_Retvals"}
}

%fused_computation.32 (param_0.477: f32[1,3,25,38], param_1.564: f32[3]) -> f32[2850] {
  %param_0.477 = f32[1,3,25,38]{3,2,1,0} parameter(0)
  %param_1.564 = f32[3]{0} parameter(1)
  %broadcast.368 = f32[1,3,25,38]{3,2,1,0} broadcast(f32[3]{0} %param_1.564), dimensions={1}, metadata={op_type="BiasAdd" op_name="tower0/rpn_3/class/BiasAdd"}
  %add.212 = f32[1,3,25,38]{3,2,1,0} add(f32[1,3,25,38]{3,2,1,0} %param_0.477, f32[1,3,25,38]{3,2,1,0} %broadcast.368), metadata={op_type="BiasAdd" op_name="tower0/rpn_3/class/BiasAdd"}
  %bitcast.323 = f32[1,25,38,3]{2,1,3,0} bitcast(f32[1,3,25,38]{3,2,1,0} %add.212), metadata={op_type="Transpose" op_name="tower0/rpn_3/transpose"}
  ROOT %reshape.189 = f32[2850]{0} reshape(f32[1,25,38,3]{2,1,3,0} %bitcast.323), metadata={op_type="Reshape" op_name="tower0/generate_fpn_proposals/Lvl5/Reshape_1"}
}

%fused_computation.33 (param_0.412: f32[1,25,38,12]) -> f32[2850,1,2] {
  %param_0.412 = f32[1,25,38,12]{3,2,1,0} parameter(0)
  %bitcast.555 = f32[2850,2,2]{2,1,0} bitcast(f32[1,25,38,12]{3,2,1,0} %param_0.412), metadata={op_type="Reshape" op_name="tower0/decode_bbox_target_3/Reshape"}
  %slice.13 = f32[2850,1,2]{2,1,0} slice(f32[2850,2,2]{2,1,0} %bitcast.555), slice={[0:2850], [1:2], [0:2]}, metadata={op_type="Split" op_name="tower0/decode_bbox_target_3/split"}
  %constant_151 = f32[] constant(4.43082), metadata={op_type="Minimum" op_name="tower0/decode_bbox_target_4/Minimum"}
  %broadcast.128 = f32[2850,1,2]{2,1,0} broadcast(f32[] %constant_151), dimensions={}, metadata={op_type="Minimum" op_name="tower0/decode_bbox_target_3/Minimum"}
  %minimum.9 = f32[2850,1,2]{2,1,0} minimum(f32[2850,1,2]{2,1,0} %slice.13, f32[2850,1,2]{2,1,0} %broadcast.128), metadata={op_type="Minimum" op_name="tower0/decode_bbox_target_3/Minimum"}
  ROOT %exponential.4 = f32[2850,1,2]{2,1,0} exponential(f32[2850,1,2]{2,1,0} %minimum.9), metadata={op_type="Exp" op_name="tower0/decode_bbox_target_3/Exp"}
}

%fused_computation.35 (param_0.414: s32[84,84,3]) -> (pred[50,76,3], pred[50,76,3]) {
  %param_0.414 = s32[84,84,3]{2,1,0} parameter(0)
  %slice.19 = s32[50,76,3]{2,1,0} slice(s32[84,84,3]{2,1,0} %param_0.414), slice={[0:50], [0:76], [0:3]}, metadata={op_type="Slice" op_name="tower0/FPN_slice_lvl2/narrow_to/Slice_1"}
  %constant_153 = s32[] constant(-1), metadata={op_type="NotEqual" op_name="tower0/rpn_losses/level5/NotEqual"}
  %broadcast.130 = s32[50,76,3]{2,1,0} broadcast(s32[] %constant_153), dimensions={}, metadata={op_type="NotEqual" op_name="tower0/rpn_losses/level4/NotEqual"}
  %compare.60 = pred[50,76,3]{2,1,0} compare(s32[50,76,3]{2,1,0} %slice.19, s32[50,76,3]{2,1,0} %broadcast.130), direction=NE, metadata={op_type="NotEqual" op_name="tower0/rpn_losses/level4/NotEqual"}
  %constant_152_clone_1 = s32[] constant(1), metadata={op_type="Equal" op_name="tower0/rpn_losses/level5/Equal"}
