HloModule cluster_16__XlaCompiledKernel_true__XlaNumConstantArgs_723__XlaNumResourceArgs_0_.4191

%add_float_.1286 (x.1287: f32[], y.1288: f32[]) -> f32[] {
  %x.1287 = f32[] parameter(0)
  %y.1288 = f32[] parameter(1)
  ROOT %add.1289 = f32[] add(f32[] %x.1287, f32[] %y.1288)
}

%ge_F32.1562 (lhs.1563: f32[], rhs.1564: f32[]) -> pred[] {
  %lhs.1563 = f32[] parameter(0)
  %rhs.1564 = f32[] parameter(1)
  ROOT %compare.1565 = pred[] compare(f32[] %lhs.1563, f32[] %rhs.1564), direction=GE
}

%add_F32.1566 (lhs.1567: f32[], rhs.1568: f32[]) -> f32[] {
  %lhs.1567 = f32[] parameter(0)
  %rhs.1568 = f32[] parameter(1)
  ROOT %add.1569 = f32[] add(f32[] %lhs.1567, f32[] %rhs.1568)
}

%fused_computation (param_0.2: f32[1,128,1,1], param_1.2: f32[1,128,1,1], param_2.3: f32[128], param_3.3: f32[128]) -> f32[128] {
  %param_3.3 = f32[128]{0} parameter(3)
  %bitcast.231 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %param_3.3), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_2.3 = f32[128]{0} parameter(2)
  %negate.52 = f32[128]{0} negate(f32[128]{0} %param_2.3), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/batchnorm/sub_grad/Neg"}
  %bitcast.230 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %negate.52), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/batchnorm/sub_grad/Neg"}
  %param_1.2 = f32[1,128,1,1]{3,2,1,0} parameter(1)
  %multiply.14 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %bitcast.230, f32[1,128,1,1]{3,2,1,0} %param_1.2), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.11 = f32[1,128,1,1]{3,2,1,0} add(f32[1,128,1,1]{3,2,1,0} %bitcast.231, f32[1,128,1,1]{3,2,1,0} %multiply.14), metadata={op_type="AddN" op_name="tower0/gradients/AddN_205"}
  %param_0.2 = f32[1,128,1,1]{3,2,1,0} parameter(0)
  %multiply.13 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %add.11, f32[1,128,1,1]{3,2,1,0} %param_0.2), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/batchnorm/mul_grad/Mul_1"}
  ROOT %bitcast.229 = f32[128]{0} bitcast(f32[1,128,1,1]{3,2,1,0} %multiply.13), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/Reshape_grad/Reshape"}
}

%tower0_gradients_tower0_group1_block0_conv1_bn_batchnorm_mul_1_grad_Sum_1-reduction.3048 (x.3049: f32[], y.3050: f32[]) -> f32[] {
  %x.3049 = f32[] parameter(0)
  %y.3050 = f32[] parameter(1)
  ROOT %add.3051 = f32[] add(f32[] %x.3049, f32[] %y.3050)
}

%tower0_gradients_tower0_group1_block0_conv1_bn_batchnorm_add_1_grad_Sum_1-reduction.3058 (x.3059: f32[], y.3060: f32[]) -> f32[] {
  %x.3059 = f32[] parameter(0)
  %y.3060 = f32[] parameter(1)
  ROOT %add.3061 = f32[] add(f32[] %x.3059, f32[] %y.3060)
}

%fused_computation.1 (param_0.674: f32[1,128,200,200], param_1.885: f32[1,128,201,201], param_2.780: f32[1,128,200,200]) -> (f32[128], f32[128], f32[1,128,200,200]) {
  %param_2.780 = f32[1,128,200,200]{3,2,1,0} parameter(2)
  %constant_140 = f32[] constant(0), metadata={op_type="ZerosLike" op_name="tower0/gradients/tower0/rpn_losses/level2/logistic_loss/Select_grad/zeros_like"}
  %broadcast.109.clone.1 = f32[1,128,200,200]{3,2,1,0} broadcast(f32[] %constant_140), dimensions={}, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block0/conv1/Relu_grad/ReluGrad"}
  %compare.0.clone.1 = pred[1,128,200,200]{3,2,1,0} compare(f32[1,128,200,200]{3,2,1,0} %param_2.780, f32[1,128,200,200]{3,2,1,0} %broadcast.109.clone.1), direction=GT, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block0/conv1/Relu_grad/ReluGrad"}
  %param_1.885 = f32[1,128,201,201]{3,2,1,0} parameter(1)
  %slice.0.clone.1 = f32[1,128,200,200]{3,2,1,0} slice(f32[1,128,201,201]{3,2,1,0} %param_1.885), slice={[0:1], [0:128], [1:201], [1:201]}, metadata={op_type="Slice" op_name="tower0/gradients/tower0/group1/block0/Pad_grad/Slice_1"}
  %select.0.clone.1 = f32[1,128,200,200]{3,2,1,0} select(pred[1,128,200,200]{3,2,1,0} %compare.0.clone.1, f32[1,128,200,200]{3,2,1,0} %slice.0.clone.1, f32[1,128,200,200]{3,2,1,0} %broadcast.109.clone.1), metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block0/conv1/Relu_grad/ReluGrad"}
  %param_0.674 = f32[1,128,200,200]{3,2,1,0} parameter(0)
  %multiply.15 = f32[1,128,200,200]{3,2,1,0} multiply(f32[1,128,200,200]{3,2,1,0} %select.0.clone.1, f32[1,128,200,200]{3,2,1,0} %param_0.674), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.13 = f32[128]{0} reduce(f32[1,128,200,200]{3,2,1,0} %multiply.15, f32[] %constant_140), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block0_conv1_bn_batchnorm_mul_1_grad_Sum_1-reduction.3048, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/batchnorm/mul_1_grad/Sum_1"}
  %reduce.70 = f32[128]{0} reduce(f32[1,128,200,200]{3,2,1,0} %select.0.clone.1, f32[] %constant_140), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block0_conv1_bn_batchnorm_add_1_grad_Sum_1-reduction.3058, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/batchnorm/add_1_grad/Sum_1"}
  ROOT %tuple.237 = (f32[128]{0}, f32[128]{0}, f32[1,128,200,200]{3,2,1,0}) tuple(f32[128]{0} %reduce.13, f32[128]{0} %reduce.70, f32[1,128,200,200]{3,2,1,0} %select.0.clone.1)
}

%fused_computation.2 (param_0.7: f32[1,1,256,128], param_1.9: f32[1,1,256,128]) -> f32[1,1,256,128] {
  %param_0.7 = f32[1,1,256,128]{1,0,2,3} parameter(0)
  %param_1.9 = f32[1,1,256,128]{3,2,1,0} parameter(1)
  %copy.365 = f32[1,1,256,128]{1,0,2,3} copy(f32[1,1,256,128]{3,2,1,0} %param_1.9), metadata={op_name="XLA_Args"}
  %constant_141 = f32[] constant(0.0001), metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %broadcast.98 = f32[1,1,256,128]{1,0,2,3} broadcast(f32[] %constant_141), dimensions={}, metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_grad/Mul"}
  %multiply.16 = f32[1,1,256,128]{1,0,2,3} multiply(f32[1,1,256,128]{1,0,2,3} %copy.365, f32[1,1,256,128]{1,0,2,3} %broadcast.98), metadata={op_type="Mul" op_name="tower0/gradients/tower0/wd_cost_internals/Square_grad/Mul_1"}
  %add.12 = f32[1,1,256,128]{1,0,2,3} add(f32[1,1,256,128]{1,0,2,3} %param_0.7, f32[1,1,256,128]{1,0,2,3} %multiply.16), metadata={op_type="AddN" op_name="tower0/gradients/AddN_204"}
  ROOT %copy.364 = f32[1,1,256,128]{3,2,1,0} copy(f32[1,1,256,128]{1,0,2,3} %add.12), metadata={op_name="XLA_Retvals"}
}

%fused_computation.3 (param_0.10: f32[1,128,1,1], param_1.12: f32[1,128,1,1], param_2.11: f32[128], param_3.7: f32[128]) -> f32[128] {
  %param_3.7 = f32[128]{0} parameter(3)
  %bitcast.234 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %param_3.7), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_2.11 = f32[128]{0} parameter(2)
  %negate.53 = f32[128]{0} negate(f32[128]{0} %param_2.11), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/batchnorm/sub_grad/Neg"}
  %bitcast.233 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %negate.53), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/batchnorm/sub_grad/Neg"}
  %param_1.12 = f32[1,128,1,1]{3,2,1,0} parameter(1)
  %multiply.18 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %bitcast.233, f32[1,128,1,1]{3,2,1,0} %param_1.12), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.13 = f32[1,128,1,1]{3,2,1,0} add(f32[1,128,1,1]{3,2,1,0} %bitcast.234, f32[1,128,1,1]{3,2,1,0} %multiply.18), metadata={op_type="AddN" op_name="tower0/gradients/AddN_203"}
  %param_0.10 = f32[1,128,1,1]{3,2,1,0} parameter(0)
  %multiply.17 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %add.13, f32[1,128,1,1]{3,2,1,0} %param_0.10), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/batchnorm/mul_grad/Mul_1"}
  ROOT %bitcast.232 = f32[128]{0} bitcast(f32[1,128,1,1]{3,2,1,0} %multiply.17), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/Reshape_grad/Reshape"}
}

%tower0_gradients_tower0_group1_block0_conv2_bn_batchnorm_mul_1_grad_Sum_1-reduction.3075 (x.3076: f32[], y.3077: f32[]) -> f32[] {
  %x.3076 = f32[] parameter(0)
  %y.3077 = f32[] parameter(1)
  ROOT %add.3078 = f32[] add(f32[] %x.3076, f32[] %y.3077)
}

%tower0_gradients_tower0_group1_block0_conv2_bn_batchnorm_add_1_grad_Sum_1-reduction.3085 (x.3086: f32[], y.3087: f32[]) -> f32[] {
  %x.3086 = f32[] parameter(0)
  %y.3087 = f32[] parameter(1)
  ROOT %add.3088 = f32[] add(f32[] %x.3086, f32[] %y.3087)
}

%fused_computation.4 (param_0.673: f32[1,128,100,100], param_1.886: f32[1,128,100,100], param_2.781: f32[1,128,100,100]) -> (f32[128], f32[128], f32[1,128,100,100]) {
  %param_2.781 = f32[1,128,100,100]{3,2,1,0} parameter(2)
  %constant_142 = f32[] constant(0), metadata={op_type="ZerosLike" op_name="tower0/gradients/tower0/rpn_losses/level2/logistic_loss/Select_grad/zeros_like"}
  %broadcast.245.clone.1 = f32[1,128,100,100]{3,2,1,0} broadcast(f32[] %constant_142), dimensions={}, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block3/conv2/Relu_grad/ReluGrad"}
  %compare.1.clone.1 = pred[1,128,100,100]{3,2,1,0} compare(f32[1,128,100,100]{3,2,1,0} %param_2.781, f32[1,128,100,100]{3,2,1,0} %broadcast.245.clone.1), direction=GT, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block0/conv2/Relu_grad/ReluGrad"}
  %param_1.886 = f32[1,128,100,100]{3,2,1,0} parameter(1)
  %select.1.clone.1 = f32[1,128,100,100]{3,2,1,0} select(pred[1,128,100,100]{3,2,1,0} %compare.1.clone.1, f32[1,128,100,100]{3,2,1,0} %param_1.886, f32[1,128,100,100]{3,2,1,0} %broadcast.245.clone.1), metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block0/conv2/Relu_grad/ReluGrad"}
  %param_0.673 = f32[1,128,100,100]{3,2,1,0} parameter(0)
  %multiply.19 = f32[1,128,100,100]{3,2,1,0} multiply(f32[1,128,100,100]{3,2,1,0} %select.1.clone.1, f32[1,128,100,100]{3,2,1,0} %param_0.673), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.14 = f32[128]{0} reduce(f32[1,128,100,100]{3,2,1,0} %multiply.19, f32[] %constant_142), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block0_conv2_bn_batchnorm_mul_1_grad_Sum_1-reduction.3075, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/batchnorm/mul_1_grad/Sum_1"}
  %reduce.82 = f32[128]{0} reduce(f32[1,128,100,100]{3,2,1,0} %select.1.clone.1, f32[] %constant_142), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block0_conv2_bn_batchnorm_add_1_grad_Sum_1-reduction.3085, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/batchnorm/add_1_grad/Sum_1"}
  ROOT %tuple.236 = (f32[128]{0}, f32[128]{0}, f32[1,128,100,100]{3,2,1,0}) tuple(f32[128]{0} %reduce.14, f32[128]{0} %reduce.82, f32[1,128,100,100]{3,2,1,0} %select.1.clone.1)
}

%fused_computation.5 (param_0.15: f32[3,3,128,128], param_1.693: f32[3,3,128,128]) -> f32[3,3,128,128] {
  %param_0.15 = f32[3,3,128,128]{1,0,2,3} parameter(0)
  %param_1.693 = f32[3,3,128,128]{3,2,1,0} parameter(1)
  %copy.453 = f32[3,3,128,128]{1,0,2,3} copy(f32[3,3,128,128]{3,2,1,0} %param_1.693), metadata={op_name="XLA_Args"}
  %constant_219 = f32[] constant(0.0001), metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %broadcast.212 = f32[3,3,128,128]{1,0,2,3} broadcast(f32[] %constant_219), dimensions={}, metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_11_grad/Mul"}
  %multiply.20 = f32[3,3,128,128]{1,0,2,3} multiply(f32[3,3,128,128]{1,0,2,3} %copy.453, f32[3,3,128,128]{1,0,2,3} %broadcast.212), metadata={op_type="Mul" op_name="tower0/gradients/tower0/wd_cost_internals/Square_1_grad/Mul_1"}
  %add.14 = f32[3,3,128,128]{1,0,2,3} add(f32[3,3,128,128]{1,0,2,3} %param_0.15, f32[3,3,128,128]{1,0,2,3} %multiply.20), metadata={op_type="AddN" op_name="tower0/gradients/AddN_202"}
  ROOT %copy.366 = f32[3,3,128,128]{3,2,1,0} copy(f32[3,3,128,128]{1,0,2,3} %add.14), metadata={op_name="XLA_Retvals"}
}

%fused_computation.8 (param_0.24: f32[1,512,1,1], param_1.807: f32[1,512,1,1], param_2.599: f32[512], param_3.334: f32[512], param_4.124: f32[1,512,1,1], param_5.125: f32[1,512,1,1], param_6.109: f32[512]) -> (f32[512], f32[512]) {
  %param_2.599 = f32[512]{0} parameter(2)
  %bitcast.238 = f32[1,512,1,1]{3,2,1,0} bitcast(f32[512]{0} %param_2.599), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_3.334 = f32[512]{0} parameter(3)
  %negate.117 = f32[512]{0} negate(f32[512]{0} %param_3.334), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/batchnorm/sub_grad/Neg"}
  %bitcast.427 = f32[1,512,1,1]{3,2,1,0} bitcast(f32[512]{0} %negate.117), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/batchnorm/sub_grad/Neg"}
  %param_1.807 = f32[1,512,1,1]{3,2,1,0} parameter(1)
  %multiply.25 = f32[1,512,1,1]{3,2,1,0} multiply(f32[1,512,1,1]{3,2,1,0} %bitcast.427, f32[1,512,1,1]{3,2,1,0} %param_1.807), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.16 = f32[1,512,1,1]{3,2,1,0} add(f32[1,512,1,1]{3,2,1,0} %bitcast.238, f32[1,512,1,1]{3,2,1,0} %multiply.25), metadata={op_type="AddN" op_name="tower0/gradients/AddN_201"}
  %param_0.24 = f32[1,512,1,1]{3,2,1,0} parameter(0)
  %multiply.24 = f32[1,512,1,1]{3,2,1,0} multiply(f32[1,512,1,1]{3,2,1,0} %add.16, f32[1,512,1,1]{3,2,1,0} %param_0.24), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/batchnorm/mul_grad/Mul_1"}
  %bitcast.237 = f32[512]{0} bitcast(f32[1,512,1,1]{3,2,1,0} %multiply.24), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/Reshape_grad/Reshape"}
  %param_6.109 = f32[512]{0} parameter(6)
  %bitcast.236.clone.1 = f32[1,512,1,1]{3,2,1,0} bitcast(f32[512]{0} %param_6.109), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block0/conv3/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_5.125 = f32[1,512,1,1]{3,2,1,0} parameter(5)
  %multiply.22.clone.1 = f32[1,512,1,1]{3,2,1,0} multiply(f32[1,512,1,1]{3,2,1,0} %bitcast.427, f32[1,512,1,1]{3,2,1,0} %param_5.125), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv3/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.15.clone.1 = f32[1,512,1,1]{3,2,1,0} add(f32[1,512,1,1]{3,2,1,0} %bitcast.236.clone.1, f32[1,512,1,1]{3,2,1,0} %multiply.22.clone.1), metadata={op_type="AddN" op_name="tower0/gradients/AddN_199"}
  %param_4.124 = f32[1,512,1,1]{3,2,1,0} parameter(4)
  %multiply.21.clone.1 = f32[1,512,1,1]{3,2,1,0} multiply(f32[1,512,1,1]{3,2,1,0} %add.15.clone.1, f32[1,512,1,1]{3,2,1,0} %param_4.124), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv3/bn/batchnorm/mul_grad/Mul_1"}
  %bitcast.235.clone.1 = f32[512]{0} bitcast(f32[1,512,1,1]{3,2,1,0} %multiply.21.clone.1), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block0/conv3/bn/Reshape_grad/Reshape"}
  ROOT %tuple.186 = (f32[512]{0}, f32[512]{0}) tuple(f32[512]{0} %bitcast.237, f32[512]{0} %bitcast.235.clone.1)
}

%tower0_gradients_tower0_group1_block0_convshortcut_bn_batchnorm_mul_1_grad_Sum_1-reduction.3155 (x.3156: f32[], y.3157: f32[]) -> f32[] {
  %x.3156 = f32[] parameter(0)
  %y.3157 = f32[] parameter(1)
  ROOT %add.3158 = f32[] add(f32[] %x.3156, f32[] %y.3157)
}

%tower0_gradients_tower0_group1_block0_convshortcut_bn_batchnorm_add_1_grad_Sum_1-reduction.3165 (x.3166: f32[], y.3167: f32[]) -> f32[] {
  %x.3166 = f32[] parameter(0)
  %y.3167 = f32[] parameter(1)
  ROOT %add.3168 = f32[] add(f32[] %x.3166, f32[] %y.3167)
}

%tower0_gradients_tower0_group1_block0_conv3_bn_batchnorm_mul_1_grad_Sum_1-reduction.3102 (x.3103: f32[], y.3104: f32[]) -> f32[] {
  %x.3103 = f32[] parameter(0)
  %y.3104 = f32[] parameter(1)
  ROOT %add.3105 = f32[] add(f32[] %x.3103, f32[] %y.3104)
}

%fused_computation.10 (param_0.672: f32[1,512,100,100], param_1.887: f32[1,512,100,100], param_2.782: f32[1,512,100,100], param_3.522: f32[1,512,100,100], param_4.275: f32[1,512,100,100]) -> (f32[512], f32[512], f32[512], f32[1,512,100,100]) {
  %param_4.275 = f32[1,512,100,100]{3,2,1,0} parameter(4)
  %constant_144 = f32[] constant(0), metadata={op_type="ZerosLike" op_name="tower0/gradients/tower0/rpn_losses/level2/logistic_loss/Select_grad/zeros_like"}
  %broadcast.246.clone.1 = f32[1,512,100,100]{3,2,1,0} broadcast(f32[] %constant_144), dimensions={}, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block3/output_grad/ReluGrad"}
  %compare.2.clone.1 = pred[1,512,100,100]{3,2,1,0} compare(f32[1,512,100,100]{3,2,1,0} %param_4.275, f32[1,512,100,100]{3,2,1,0} %broadcast.246.clone.1), direction=GT, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block0/output_grad/ReluGrad"}
  %param_2.782 = f32[1,512,100,100]{3,2,1,0} parameter(2)
  %param_3.522 = f32[1,512,100,100]{3,2,1,0} parameter(3)
  %add.130.clone.1 = f32[1,512,100,100]{3,2,1,0} add(f32[1,512,100,100]{3,2,1,0} %param_2.782, f32[1,512,100,100]{3,2,1,0} %param_3.522), metadata={op_type="AddN" op_name="tower0/gradients/AddN_195"}
  %select.2.clone.1 = f32[1,512,100,100]{3,2,1,0} select(pred[1,512,100,100]{3,2,1,0} %compare.2.clone.1, f32[1,512,100,100]{3,2,1,0} %add.130.clone.1, f32[1,512,100,100]{3,2,1,0} %broadcast.246.clone.1), metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block0/output_grad/ReluGrad"}
  %param_0.672 = f32[1,512,100,100]{3,2,1,0} parameter(0)
  %multiply.26 = f32[1,512,100,100]{3,2,1,0} multiply(f32[1,512,100,100]{3,2,1,0} %select.2.clone.1, f32[1,512,100,100]{3,2,1,0} %param_0.672), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.16 = f32[512]{0} reduce(f32[1,512,100,100]{3,2,1,0} %multiply.26, f32[] %constant_144), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block0_convshortcut_bn_batchnorm_mul_1_grad_Sum_1-reduction.3155, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/batchnorm/mul_1_grad/Sum_1"}
  %reduce.69 = f32[512]{0} reduce(f32[1,512,100,100]{3,2,1,0} %select.2.clone.1, f32[] %constant_144), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block0_convshortcut_bn_batchnorm_add_1_grad_Sum_1-reduction.3165, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/batchnorm/add_1_grad/Sum_1"}
  %param_1.887 = f32[1,512,100,100]{3,2,1,0} parameter(1)
  %multiply.23.clone.1 = f32[1,512,100,100]{3,2,1,0} multiply(f32[1,512,100,100]{3,2,1,0} %select.2.clone.1, f32[1,512,100,100]{3,2,1,0} %param_1.887), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv3/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.15.clone.1 = f32[512]{0} reduce(f32[1,512,100,100]{3,2,1,0} %multiply.23.clone.1, f32[] %constant_144), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block0_conv3_bn_batchnorm_mul_1_grad_Sum_1-reduction.3102, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block0/conv3/bn/batchnorm/mul_1_grad/Sum_1"}
  ROOT %tuple.235 = (f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[1,512,100,100]{3,2,1,0}) tuple(f32[512]{0} %reduce.16, f32[512]{0} %reduce.69, f32[512]{0} %reduce.15.clone.1, f32[1,512,100,100]{3,2,1,0} %select.2.clone.1)
}

%fused_computation.11 (param_0.31: f32[1,1,128,512], param_1.694: f32[1,1,128,512]) -> f32[1,1,128,512] {
  %param_0.31 = f32[1,1,128,512]{1,0,2,3} parameter(0)
  %param_1.694 = f32[1,1,128,512]{3,2,1,0} parameter(1)
  %copy.368 = f32[1,1,128,512]{1,0,2,3} copy(f32[1,1,128,512]{3,2,1,0} %param_1.694), metadata={op_name="XLA_Args"}
  %constant_220 = f32[] constant(0.0001), metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %broadcast.213 = f32[1,1,128,512]{1,0,2,3} broadcast(f32[] %constant_220), dimensions={}, metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_2_grad/Mul"}
  %multiply.27 = f32[1,1,128,512]{1,0,2,3} multiply(f32[1,1,128,512]{1,0,2,3} %copy.368, f32[1,1,128,512]{1,0,2,3} %broadcast.213), metadata={op_type="Mul" op_name="tower0/gradients/tower0/wd_cost_internals/Square_2_grad/Mul_1"}
  %add.17 = f32[1,1,128,512]{1,0,2,3} add(f32[1,1,128,512]{1,0,2,3} %param_0.31, f32[1,1,128,512]{1,0,2,3} %multiply.27), metadata={op_type="AddN" op_name="tower0/gradients/AddN_198"}
  ROOT %copy.367 = f32[1,1,128,512]{3,2,1,0} copy(f32[1,1,128,512]{1,0,2,3} %add.17), metadata={op_name="XLA_Retvals"}
}

%fused_computation.12 (param_0.33: f32[1,1,256,512], param_1.36: f32[1,1,256,512]) -> f32[1,1,256,512] {
  %param_0.33 = f32[1,1,256,512]{1,0,2,3} parameter(0)
  %param_1.36 = f32[1,1,256,512]{3,2,1,0} parameter(1)
  %copy.370 = f32[1,1,256,512]{1,0,2,3} copy(f32[1,1,256,512]{3,2,1,0} %param_1.36), metadata={op_name="XLA_Args"}
  %constant_145 = f32[] constant(0.0001), metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %broadcast.99 = f32[1,1,256,512]{1,0,2,3} broadcast(f32[] %constant_145), dimensions={}, metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_3_grad/Mul"}
  %multiply.28 = f32[1,1,256,512]{1,0,2,3} multiply(f32[1,1,256,512]{1,0,2,3} %copy.370, f32[1,1,256,512]{1,0,2,3} %broadcast.99), metadata={op_type="Mul" op_name="tower0/gradients/tower0/wd_cost_internals/Square_3_grad/Mul_1"}
  %add.18 = f32[1,1,256,512]{1,0,2,3} add(f32[1,1,256,512]{1,0,2,3} %param_0.33, f32[1,1,256,512]{1,0,2,3} %multiply.28), metadata={op_type="AddN" op_name="tower0/gradients/AddN_200"}
  ROOT %copy.369 = f32[1,1,256,512]{3,2,1,0} copy(f32[1,1,256,512]{1,0,2,3} %add.18), metadata={op_name="XLA_Retvals"}
}

%fused_computation.13 (param_0.36: f32[1,128,1,1], param_1.39: f32[1,128,1,1], param_2.30: f32[128], param_3.15: f32[128]) -> f32[128] {
  %param_3.15 = f32[128]{0} parameter(3)
  %bitcast.242 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %param_3.15), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_2.30 = f32[128]{0} parameter(2)
  %negate.55 = f32[128]{0} negate(f32[128]{0} %param_2.30), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/batchnorm/sub_grad/Neg"}
  %bitcast.241 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %negate.55), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/batchnorm/sub_grad/Neg"}
  %param_1.39 = f32[1,128,1,1]{3,2,1,0} parameter(1)
  %multiply.30 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %bitcast.241, f32[1,128,1,1]{3,2,1,0} %param_1.39), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.19 = f32[1,128,1,1]{3,2,1,0} add(f32[1,128,1,1]{3,2,1,0} %bitcast.242, f32[1,128,1,1]{3,2,1,0} %multiply.30), metadata={op_type="AddN" op_name="tower0/gradients/AddN_197"}
  %param_0.36 = f32[1,128,1,1]{3,2,1,0} parameter(0)
  %multiply.29 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %add.19, f32[1,128,1,1]{3,2,1,0} %param_0.36), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/batchnorm/mul_grad/Mul_1"}
  ROOT %bitcast.240 = f32[128]{0} bitcast(f32[1,128,1,1]{3,2,1,0} %multiply.29), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/Reshape_grad/Reshape"}
}

%tower0_gradients_tower0_group1_block1_conv1_bn_batchnorm_mul_1_grad_Sum_1-reduction.3182 (x.3183: f32[], y.3184: f32[]) -> f32[] {
  %x.3183 = f32[] parameter(0)
  %y.3184 = f32[] parameter(1)
  ROOT %add.3185 = f32[] add(f32[] %x.3183, f32[] %y.3184)
}

%tower0_gradients_tower0_group1_block1_conv1_bn_batchnorm_add_1_grad_Sum_1-reduction.3192 (x.3193: f32[], y.3194: f32[]) -> f32[] {
  %x.3193 = f32[] parameter(0)
  %y.3194 = f32[] parameter(1)
  ROOT %add.3195 = f32[] add(f32[] %x.3193, f32[] %y.3194)
}

%fused_computation.14 (param_0.671: f32[1,128,100,100], param_1.888: f32[1,128,100,100], param_2.783: f32[1,128,100,100]) -> (f32[128], f32[128], f32[1,128,100,100]) {
  %param_2.783 = f32[1,128,100,100]{3,2,1,0} parameter(2)
  %constant_146 = f32[] constant(0), metadata={op_type="ZerosLike" op_name="tower0/gradients/tower0/rpn_losses/level2/logistic_loss/Select_grad/zeros_like"}
  %broadcast.247.clone.1 = f32[1,128,100,100]{3,2,1,0} broadcast(f32[] %constant_146), dimensions={}, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block3/conv2/Relu_grad/ReluGrad"}
  %compare.3.clone.1 = pred[1,128,100,100]{3,2,1,0} compare(f32[1,128,100,100]{3,2,1,0} %param_2.783, f32[1,128,100,100]{3,2,1,0} %broadcast.247.clone.1), direction=GT, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block1/conv1/Relu_grad/ReluGrad"}
  %param_1.888 = f32[1,128,100,100]{3,2,1,0} parameter(1)
  %select.3.clone.1 = f32[1,128,100,100]{3,2,1,0} select(pred[1,128,100,100]{3,2,1,0} %compare.3.clone.1, f32[1,128,100,100]{3,2,1,0} %param_1.888, f32[1,128,100,100]{3,2,1,0} %broadcast.247.clone.1), metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block1/conv1/Relu_grad/ReluGrad"}
  %param_0.671 = f32[1,128,100,100]{3,2,1,0} parameter(0)
  %multiply.31 = f32[1,128,100,100]{3,2,1,0} multiply(f32[1,128,100,100]{3,2,1,0} %select.3.clone.1, f32[1,128,100,100]{3,2,1,0} %param_0.671), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.17 = f32[128]{0} reduce(f32[1,128,100,100]{3,2,1,0} %multiply.31, f32[] %constant_146), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block1_conv1_bn_batchnorm_mul_1_grad_Sum_1-reduction.3182, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/batchnorm/mul_1_grad/Sum_1"}
  %reduce.83 = f32[128]{0} reduce(f32[1,128,100,100]{3,2,1,0} %select.3.clone.1, f32[] %constant_146), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block1_conv1_bn_batchnorm_add_1_grad_Sum_1-reduction.3192, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/batchnorm/add_1_grad/Sum_1"}
  ROOT %tuple.234 = (f32[128]{0}, f32[128]{0}, f32[1,128,100,100]{3,2,1,0}) tuple(f32[128]{0} %reduce.17, f32[128]{0} %reduce.83, f32[1,128,100,100]{3,2,1,0} %select.3.clone.1)
}

%fused_computation.15 (param_0.41: f32[1,1,512,128], param_1.695: f32[1,1,512,128]) -> f32[1,1,512,128] {
  %param_0.41 = f32[1,1,512,128]{1,0,2,3} parameter(0)
  %param_1.695 = f32[1,1,512,128]{3,2,1,0} parameter(1)
  %copy.372 = f32[1,1,512,128]{1,0,2,3} copy(f32[1,1,512,128]{3,2,1,0} %param_1.695), metadata={op_name="XLA_Args"}
  %constant_221 = f32[] constant(0.0001), metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %broadcast.214 = f32[1,1,512,128]{1,0,2,3} broadcast(f32[] %constant_221), dimensions={}, metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %multiply.32 = f32[1,1,512,128]{1,0,2,3} multiply(f32[1,1,512,128]{1,0,2,3} %copy.372, f32[1,1,512,128]{1,0,2,3} %broadcast.214), metadata={op_type="Mul" op_name="tower0/gradients/tower0/wd_cost_internals/Square_4_grad/Mul_1"}
  %add.20 = f32[1,1,512,128]{1,0,2,3} add(f32[1,1,512,128]{1,0,2,3} %param_0.41, f32[1,1,512,128]{1,0,2,3} %multiply.32), metadata={op_type="AddN" op_name="tower0/gradients/AddN_196"}
  ROOT %copy.371 = f32[1,1,512,128]{3,2,1,0} copy(f32[1,1,512,128]{1,0,2,3} %add.20), metadata={op_name="XLA_Retvals"}
}

%fused_computation.16 (param_0.44: f32[1,128,1,1], param_1.48: f32[1,128,1,1], param_2.37: f32[128], param_3.19: f32[128]) -> f32[128] {
  %param_3.19 = f32[128]{0} parameter(3)
  %bitcast.245 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %param_3.19), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_2.37 = f32[128]{0} parameter(2)
  %negate.56 = f32[128]{0} negate(f32[128]{0} %param_2.37), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/batchnorm/sub_grad/Neg"}
  %bitcast.244 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %negate.56), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/batchnorm/sub_grad/Neg"}
  %param_1.48 = f32[1,128,1,1]{3,2,1,0} parameter(1)
  %multiply.34 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %bitcast.244, f32[1,128,1,1]{3,2,1,0} %param_1.48), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.21 = f32[1,128,1,1]{3,2,1,0} add(f32[1,128,1,1]{3,2,1,0} %bitcast.245, f32[1,128,1,1]{3,2,1,0} %multiply.34), metadata={op_type="AddN" op_name="tower0/gradients/AddN_194"}
  %param_0.44 = f32[1,128,1,1]{3,2,1,0} parameter(0)
  %multiply.33 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %add.21, f32[1,128,1,1]{3,2,1,0} %param_0.44), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/batchnorm/mul_grad/Mul_1"}
  ROOT %bitcast.243 = f32[128]{0} bitcast(f32[1,128,1,1]{3,2,1,0} %multiply.33), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/Reshape_grad/Reshape"}
}

%tower0_gradients_tower0_group1_block1_conv2_bn_batchnorm_mul_1_grad_Sum_1-reduction.3209 (x.3210: f32[], y.3211: f32[]) -> f32[] {
  %x.3210 = f32[] parameter(0)
  %y.3211 = f32[] parameter(1)
  ROOT %add.3212 = f32[] add(f32[] %x.3210, f32[] %y.3211)
}

%tower0_gradients_tower0_group1_block1_conv2_bn_batchnorm_add_1_grad_Sum_1-reduction.3219 (x.3220: f32[], y.3221: f32[]) -> f32[] {
  %x.3220 = f32[] parameter(0)
  %y.3221 = f32[] parameter(1)
  ROOT %add.3222 = f32[] add(f32[] %x.3220, f32[] %y.3221)
}

%fused_computation.17 (param_0.670: f32[1,128,100,100], param_1.889: f32[1,128,100,100], param_2.784: f32[1,128,100,100]) -> (f32[128], f32[128], f32[1,128,100,100]) {
  %param_2.784 = f32[1,128,100,100]{3,2,1,0} parameter(2)
  %constant_147 = f32[] constant(0), metadata={op_type="ZerosLike" op_name="tower0/gradients/tower0/rpn_losses/level2/logistic_loss/Select_grad/zeros_like"}
  %broadcast.248.clone.1 = f32[1,128,100,100]{3,2,1,0} broadcast(f32[] %constant_147), dimensions={}, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block3/conv2/Relu_grad/ReluGrad"}
  %compare.4.clone.1 = pred[1,128,100,100]{3,2,1,0} compare(f32[1,128,100,100]{3,2,1,0} %param_2.784, f32[1,128,100,100]{3,2,1,0} %broadcast.248.clone.1), direction=GT, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block1/conv2/Relu_grad/ReluGrad"}
  %param_1.889 = f32[1,128,100,100]{3,2,1,0} parameter(1)
  %select.4.clone.1 = f32[1,128,100,100]{3,2,1,0} select(pred[1,128,100,100]{3,2,1,0} %compare.4.clone.1, f32[1,128,100,100]{3,2,1,0} %param_1.889, f32[1,128,100,100]{3,2,1,0} %broadcast.248.clone.1), metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block1/conv2/Relu_grad/ReluGrad"}
  %param_0.670 = f32[1,128,100,100]{3,2,1,0} parameter(0)
  %multiply.35 = f32[1,128,100,100]{3,2,1,0} multiply(f32[1,128,100,100]{3,2,1,0} %select.4.clone.1, f32[1,128,100,100]{3,2,1,0} %param_0.670), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.18 = f32[128]{0} reduce(f32[1,128,100,100]{3,2,1,0} %multiply.35, f32[] %constant_147), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block1_conv2_bn_batchnorm_mul_1_grad_Sum_1-reduction.3209, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/batchnorm/mul_1_grad/Sum_1"}
  %reduce.84 = f32[128]{0} reduce(f32[1,128,100,100]{3,2,1,0} %select.4.clone.1, f32[] %constant_147), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block1_conv2_bn_batchnorm_add_1_grad_Sum_1-reduction.3219, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/batchnorm/add_1_grad/Sum_1"}
  ROOT %tuple.233 = (f32[128]{0}, f32[128]{0}, f32[1,128,100,100]{3,2,1,0}) tuple(f32[128]{0} %reduce.18, f32[128]{0} %reduce.84, f32[1,128,100,100]{3,2,1,0} %select.4.clone.1)
}

%fused_computation.18 (param_0.49: f32[3,3,128,128], param_1.696: f32[3,3,128,128]) -> f32[3,3,128,128] {
  %param_0.49 = f32[3,3,128,128]{1,0,2,3} parameter(0)
  %param_1.696 = f32[3,3,128,128]{3,2,1,0} parameter(1)
  %copy.454 = f32[3,3,128,128]{1,0,2,3} copy(f32[3,3,128,128]{3,2,1,0} %param_1.696), metadata={op_name="XLA_Args"}
  %constant_222 = f32[] constant(0.0001), metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %broadcast.215 = f32[3,3,128,128]{1,0,2,3} broadcast(f32[] %constant_222), dimensions={}, metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_11_grad/Mul"}
  %multiply.36 = f32[3,3,128,128]{1,0,2,3} multiply(f32[3,3,128,128]{1,0,2,3} %copy.454, f32[3,3,128,128]{1,0,2,3} %broadcast.215), metadata={op_type="Mul" op_name="tower0/gradients/tower0/wd_cost_internals/Square_5_grad/Mul_1"}
  %add.22 = f32[3,3,128,128]{1,0,2,3} add(f32[3,3,128,128]{1,0,2,3} %param_0.49, f32[3,3,128,128]{1,0,2,3} %multiply.36), metadata={op_type="AddN" op_name="tower0/gradients/AddN_193"}
  ROOT %copy.373 = f32[3,3,128,128]{3,2,1,0} copy(f32[3,3,128,128]{1,0,2,3} %add.22), metadata={op_name="XLA_Retvals"}
}

%fused_computation.19 (param_0.52: f32[1,512,1,1], param_1.56: f32[1,512,1,1], param_2.43: f32[512], param_3.23: f32[512]) -> f32[512] {
  %param_3.23 = f32[512]{0} parameter(3)
  %bitcast.248 = f32[1,512,1,1]{3,2,1,0} bitcast(f32[512]{0} %param_3.23), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_2.43 = f32[512]{0} parameter(2)
  %negate.57 = f32[512]{0} negate(f32[512]{0} %param_2.43), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/batchnorm/sub_grad/Neg"}
  %bitcast.247 = f32[1,512,1,1]{3,2,1,0} bitcast(f32[512]{0} %negate.57), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/batchnorm/sub_grad/Neg"}
  %param_1.56 = f32[1,512,1,1]{3,2,1,0} parameter(1)
  %multiply.38 = f32[1,512,1,1]{3,2,1,0} multiply(f32[1,512,1,1]{3,2,1,0} %bitcast.247, f32[1,512,1,1]{3,2,1,0} %param_1.56), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.23 = f32[1,512,1,1]{3,2,1,0} add(f32[1,512,1,1]{3,2,1,0} %bitcast.248, f32[1,512,1,1]{3,2,1,0} %multiply.38), metadata={op_type="AddN" op_name="tower0/gradients/AddN_192"}
  %param_0.52 = f32[1,512,1,1]{3,2,1,0} parameter(0)
  %multiply.37 = f32[1,512,1,1]{3,2,1,0} multiply(f32[1,512,1,1]{3,2,1,0} %add.23, f32[1,512,1,1]{3,2,1,0} %param_0.52), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/batchnorm/mul_grad/Mul_1"}
  ROOT %bitcast.246 = f32[512]{0} bitcast(f32[1,512,1,1]{3,2,1,0} %multiply.37), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/Reshape_grad/Reshape"}
}

%tower0_gradients_tower0_group1_block1_conv3_bn_batchnorm_mul_1_grad_Sum_1-reduction.3236 (x.3237: f32[], y.3238: f32[]) -> f32[] {
  %x.3237 = f32[] parameter(0)
  %y.3238 = f32[] parameter(1)
  ROOT %add.3239 = f32[] add(f32[] %x.3237, f32[] %y.3238)
}

%tower0_gradients_tower0_group1_block1_conv3_bn_batchnorm_add_1_grad_Sum_1-reduction.3246 (x.3247: f32[], y.3248: f32[]) -> f32[] {
  %x.3247 = f32[] parameter(0)
  %y.3248 = f32[] parameter(1)
  ROOT %add.3249 = f32[] add(f32[] %x.3247, f32[] %y.3248)
}

%fused_computation.20 (param_0.669: f32[1,512,100,100], param_1.890: f32[1,512,100,100], param_2.785: f32[1,512,100,100], param_3.523: f32[1,512,100,100]) -> (f32[512], f32[512], f32[1,512,100,100]) {
  %param_3.523 = f32[1,512,100,100]{3,2,1,0} parameter(3)
  %constant_148 = f32[] constant(0), metadata={op_type="ZerosLike" op_name="tower0/gradients/tower0/rpn_losses/level2/logistic_loss/Select_grad/zeros_like"}
  %broadcast.249.clone.1 = f32[1,512,100,100]{3,2,1,0} broadcast(f32[] %constant_148), dimensions={}, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block3/output_grad/ReluGrad"}
  %compare.5.clone.1 = pred[1,512,100,100]{3,2,1,0} compare(f32[1,512,100,100]{3,2,1,0} %param_3.523, f32[1,512,100,100]{3,2,1,0} %broadcast.249.clone.1), direction=GT, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block1/output_grad/ReluGrad"}
  %param_1.890 = f32[1,512,100,100]{3,2,1,0} parameter(1)
  %param_2.785 = f32[1,512,100,100]{3,2,1,0} parameter(2)
  %add.131.clone.1 = f32[1,512,100,100]{3,2,1,0} add(f32[1,512,100,100]{3,2,1,0} %param_1.890, f32[1,512,100,100]{3,2,1,0} %param_2.785), metadata={op_type="AddN" op_name="tower0/gradients/AddN_188"}
  %select.5.clone.1 = f32[1,512,100,100]{3,2,1,0} select(pred[1,512,100,100]{3,2,1,0} %compare.5.clone.1, f32[1,512,100,100]{3,2,1,0} %add.131.clone.1, f32[1,512,100,100]{3,2,1,0} %broadcast.249.clone.1), metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block1/output_grad/ReluGrad"}
  %param_0.669 = f32[1,512,100,100]{3,2,1,0} parameter(0)
  %multiply.39 = f32[1,512,100,100]{3,2,1,0} multiply(f32[1,512,100,100]{3,2,1,0} %select.5.clone.1, f32[1,512,100,100]{3,2,1,0} %param_0.669), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.19 = f32[512]{0} reduce(f32[1,512,100,100]{3,2,1,0} %multiply.39, f32[] %constant_148), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block1_conv3_bn_batchnorm_mul_1_grad_Sum_1-reduction.3236, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/batchnorm/mul_1_grad/Sum_1"}
  %reduce.68 = f32[512]{0} reduce(f32[1,512,100,100]{3,2,1,0} %select.5.clone.1, f32[] %constant_148), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block1_conv3_bn_batchnorm_add_1_grad_Sum_1-reduction.3246, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/batchnorm/add_1_grad/Sum_1"}
  ROOT %tuple.232 = (f32[512]{0}, f32[512]{0}, f32[1,512,100,100]{3,2,1,0}) tuple(f32[512]{0} %reduce.19, f32[512]{0} %reduce.68, f32[1,512,100,100]{3,2,1,0} %select.5.clone.1)
}

%fused_computation.21 (param_0.57: f32[1,1,128,512], param_1.697: f32[1,1,128,512]) -> f32[1,1,128,512] {
  %param_0.57 = f32[1,1,128,512]{1,0,2,3} parameter(0)
  %param_1.697 = f32[1,1,128,512]{3,2,1,0} parameter(1)
  %copy.375 = f32[1,1,128,512]{1,0,2,3} copy(f32[1,1,128,512]{3,2,1,0} %param_1.697), metadata={op_name="XLA_Args"}
  %constant_223 = f32[] constant(0.0001), metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %broadcast.216 = f32[1,1,128,512]{1,0,2,3} broadcast(f32[] %constant_223), dimensions={}, metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_2_grad/Mul"}
  %multiply.40 = f32[1,1,128,512]{1,0,2,3} multiply(f32[1,1,128,512]{1,0,2,3} %copy.375, f32[1,1,128,512]{1,0,2,3} %broadcast.216), metadata={op_type="Mul" op_name="tower0/gradients/tower0/wd_cost_internals/Square_6_grad/Mul_1"}
  %add.24 = f32[1,1,128,512]{1,0,2,3} add(f32[1,1,128,512]{1,0,2,3} %param_0.57, f32[1,1,128,512]{1,0,2,3} %multiply.40), metadata={op_type="AddN" op_name="tower0/gradients/AddN_191"}
  ROOT %copy.374 = f32[1,1,128,512]{3,2,1,0} copy(f32[1,1,128,512]{1,0,2,3} %add.24), metadata={op_name="XLA_Retvals"}
}

%fused_computation.22 (param_0.60: f32[1,128,1,1], param_1.65: f32[1,128,1,1], param_2.50: f32[128], param_3.27: f32[128]) -> f32[128] {
  %param_3.27 = f32[128]{0} parameter(3)
  %bitcast.251 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %param_3.27), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_2.50 = f32[128]{0} parameter(2)
  %negate.58 = f32[128]{0} negate(f32[128]{0} %param_2.50), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/batchnorm/sub_grad/Neg"}
  %bitcast.250 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %negate.58), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/batchnorm/sub_grad/Neg"}
  %param_1.65 = f32[1,128,1,1]{3,2,1,0} parameter(1)
  %multiply.42 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %bitcast.250, f32[1,128,1,1]{3,2,1,0} %param_1.65), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.25 = f32[1,128,1,1]{3,2,1,0} add(f32[1,128,1,1]{3,2,1,0} %bitcast.251, f32[1,128,1,1]{3,2,1,0} %multiply.42), metadata={op_type="AddN" op_name="tower0/gradients/AddN_190"}
  %param_0.60 = f32[1,128,1,1]{3,2,1,0} parameter(0)
  %multiply.41 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %add.25, f32[1,128,1,1]{3,2,1,0} %param_0.60), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/batchnorm/mul_grad/Mul_1"}
  ROOT %bitcast.249 = f32[128]{0} bitcast(f32[1,128,1,1]{3,2,1,0} %multiply.41), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/Reshape_grad/Reshape"}
}

%tower0_gradients_tower0_group1_block2_conv1_bn_batchnorm_mul_1_grad_Sum_1-reduction.3263 (x.3264: f32[], y.3265: f32[]) -> f32[] {
  %x.3264 = f32[] parameter(0)
  %y.3265 = f32[] parameter(1)
  ROOT %add.3266 = f32[] add(f32[] %x.3264, f32[] %y.3265)
}

%tower0_gradients_tower0_group1_block2_conv1_bn_batchnorm_add_1_grad_Sum_1-reduction.3273 (x.3274: f32[], y.3275: f32[]) -> f32[] {
  %x.3274 = f32[] parameter(0)
  %y.3275 = f32[] parameter(1)
  ROOT %add.3276 = f32[] add(f32[] %x.3274, f32[] %y.3275)
}

%fused_computation.23 (param_0.668: f32[1,128,100,100], param_1.891: f32[1,128,100,100], param_2.786: f32[1,128,100,100]) -> (f32[128], f32[128], f32[1,128,100,100]) {
  %param_2.786 = f32[1,128,100,100]{3,2,1,0} parameter(2)
  %constant_149 = f32[] constant(0), metadata={op_type="ZerosLike" op_name="tower0/gradients/tower0/rpn_losses/level2/logistic_loss/Select_grad/zeros_like"}
  %broadcast.250.clone.1 = f32[1,128,100,100]{3,2,1,0} broadcast(f32[] %constant_149), dimensions={}, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block3/conv2/Relu_grad/ReluGrad"}
  %compare.6.clone.1 = pred[1,128,100,100]{3,2,1,0} compare(f32[1,128,100,100]{3,2,1,0} %param_2.786, f32[1,128,100,100]{3,2,1,0} %broadcast.250.clone.1), direction=GT, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block2/conv1/Relu_grad/ReluGrad"}
  %param_1.891 = f32[1,128,100,100]{3,2,1,0} parameter(1)
  %select.6.clone.1 = f32[1,128,100,100]{3,2,1,0} select(pred[1,128,100,100]{3,2,1,0} %compare.6.clone.1, f32[1,128,100,100]{3,2,1,0} %param_1.891, f32[1,128,100,100]{3,2,1,0} %broadcast.250.clone.1), metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block2/conv1/Relu_grad/ReluGrad"}
  %param_0.668 = f32[1,128,100,100]{3,2,1,0} parameter(0)
  %multiply.43 = f32[1,128,100,100]{3,2,1,0} multiply(f32[1,128,100,100]{3,2,1,0} %select.6.clone.1, f32[1,128,100,100]{3,2,1,0} %param_0.668), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.20 = f32[128]{0} reduce(f32[1,128,100,100]{3,2,1,0} %multiply.43, f32[] %constant_149), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block2_conv1_bn_batchnorm_mul_1_grad_Sum_1-reduction.3263, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/batchnorm/mul_1_grad/Sum_1"}
  %reduce.86 = f32[128]{0} reduce(f32[1,128,100,100]{3,2,1,0} %select.6.clone.1, f32[] %constant_149), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block2_conv1_bn_batchnorm_add_1_grad_Sum_1-reduction.3273, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/batchnorm/add_1_grad/Sum_1"}
  ROOT %tuple.231 = (f32[128]{0}, f32[128]{0}, f32[1,128,100,100]{3,2,1,0}) tuple(f32[128]{0} %reduce.20, f32[128]{0} %reduce.86, f32[1,128,100,100]{3,2,1,0} %select.6.clone.1)
}

%fused_computation.24 (param_0.65: f32[1,1,512,128], param_1.698: f32[1,1,512,128]) -> f32[1,1,512,128] {
  %param_0.65 = f32[1,1,512,128]{1,0,2,3} parameter(0)
  %param_1.698 = f32[1,1,512,128]{3,2,1,0} parameter(1)
  %copy.377 = f32[1,1,512,128]{1,0,2,3} copy(f32[1,1,512,128]{3,2,1,0} %param_1.698), metadata={op_name="XLA_Args"}
  %constant_224 = f32[] constant(0.0001), metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %broadcast.217 = f32[1,1,512,128]{1,0,2,3} broadcast(f32[] %constant_224), dimensions={}, metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %multiply.44 = f32[1,1,512,128]{1,0,2,3} multiply(f32[1,1,512,128]{1,0,2,3} %copy.377, f32[1,1,512,128]{1,0,2,3} %broadcast.217), metadata={op_type="Mul" op_name="tower0/gradients/tower0/wd_cost_internals/Square_7_grad/Mul_1"}
  %add.26 = f32[1,1,512,128]{1,0,2,3} add(f32[1,1,512,128]{1,0,2,3} %param_0.65, f32[1,1,512,128]{1,0,2,3} %multiply.44), metadata={op_type="AddN" op_name="tower0/gradients/AddN_189"}
  ROOT %copy.376 = f32[1,1,512,128]{3,2,1,0} copy(f32[1,1,512,128]{1,0,2,3} %add.26), metadata={op_name="XLA_Retvals"}
}

%fused_computation.25 (param_0.68: f32[1,128,1,1], param_1.74: f32[1,128,1,1], param_2.57: f32[128], param_3.31: f32[128]) -> f32[128] {
  %param_3.31 = f32[128]{0} parameter(3)
  %bitcast.254 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %param_3.31), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_2.57 = f32[128]{0} parameter(2)
  %negate.59 = f32[128]{0} negate(f32[128]{0} %param_2.57), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/batchnorm/sub_grad/Neg"}
  %bitcast.253 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %negate.59), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/batchnorm/sub_grad/Neg"}
  %param_1.74 = f32[1,128,1,1]{3,2,1,0} parameter(1)
  %multiply.46 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %bitcast.253, f32[1,128,1,1]{3,2,1,0} %param_1.74), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.27 = f32[1,128,1,1]{3,2,1,0} add(f32[1,128,1,1]{3,2,1,0} %bitcast.254, f32[1,128,1,1]{3,2,1,0} %multiply.46), metadata={op_type="AddN" op_name="tower0/gradients/AddN_187"}
  %param_0.68 = f32[1,128,1,1]{3,2,1,0} parameter(0)
  %multiply.45 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %add.27, f32[1,128,1,1]{3,2,1,0} %param_0.68), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/batchnorm/mul_grad/Mul_1"}
  ROOT %bitcast.252 = f32[128]{0} bitcast(f32[1,128,1,1]{3,2,1,0} %multiply.45), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/Reshape_grad/Reshape"}
}

%tower0_gradients_tower0_group1_block2_conv2_bn_batchnorm_mul_1_grad_Sum_1-reduction.3290 (x.3291: f32[], y.3292: f32[]) -> f32[] {
  %x.3291 = f32[] parameter(0)
  %y.3292 = f32[] parameter(1)
  ROOT %add.3293 = f32[] add(f32[] %x.3291, f32[] %y.3292)
}

%tower0_gradients_tower0_group1_block2_conv2_bn_batchnorm_add_1_grad_Sum_1-reduction.3300 (x.3301: f32[], y.3302: f32[]) -> f32[] {
  %x.3301 = f32[] parameter(0)
  %y.3302 = f32[] parameter(1)
  ROOT %add.3303 = f32[] add(f32[] %x.3301, f32[] %y.3302)
}

%fused_computation.26 (param_0.667: f32[1,128,100,100], param_1.892: f32[1,128,100,100], param_2.787: f32[1,128,100,100]) -> (f32[128], f32[128], f32[1,128,100,100]) {
  %param_2.787 = f32[1,128,100,100]{3,2,1,0} parameter(2)
  %constant_150 = f32[] constant(0), metadata={op_type="ZerosLike" op_name="tower0/gradients/tower0/rpn_losses/level2/logistic_loss/Select_grad/zeros_like"}
  %broadcast.251.clone.1 = f32[1,128,100,100]{3,2,1,0} broadcast(f32[] %constant_150), dimensions={}, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block3/conv2/Relu_grad/ReluGrad"}
  %compare.7.clone.1 = pred[1,128,100,100]{3,2,1,0} compare(f32[1,128,100,100]{3,2,1,0} %param_2.787, f32[1,128,100,100]{3,2,1,0} %broadcast.251.clone.1), direction=GT, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block2/conv2/Relu_grad/ReluGrad"}
  %param_1.892 = f32[1,128,100,100]{3,2,1,0} parameter(1)
  %select.7.clone.1 = f32[1,128,100,100]{3,2,1,0} select(pred[1,128,100,100]{3,2,1,0} %compare.7.clone.1, f32[1,128,100,100]{3,2,1,0} %param_1.892, f32[1,128,100,100]{3,2,1,0} %broadcast.251.clone.1), metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block2/conv2/Relu_grad/ReluGrad"}
  %param_0.667 = f32[1,128,100,100]{3,2,1,0} parameter(0)
  %multiply.47 = f32[1,128,100,100]{3,2,1,0} multiply(f32[1,128,100,100]{3,2,1,0} %select.7.clone.1, f32[1,128,100,100]{3,2,1,0} %param_0.667), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.21 = f32[128]{0} reduce(f32[1,128,100,100]{3,2,1,0} %multiply.47, f32[] %constant_150), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block2_conv2_bn_batchnorm_mul_1_grad_Sum_1-reduction.3290, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/batchnorm/mul_1_grad/Sum_1"}
