HloModule cluster_2__XlaCompiledKernel_true__XlaNumConstantArgs_0__XlaNumResourceArgs_0_.74

%fused_computation (param_0.8: f32[128]) -> f32[128] {
  %constant_1 = f32[] constant(-0.153093), metadata={op_type="Add" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform"}
  %broadcast.1 = f32[128]{0} broadcast(f32[] %constant_1), dimensions={}, metadata={op_type="Add" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform"}
  %param_0.8 = f32[128]{0} parameter(0)
  %constant_0 = f32[] constant(0.306186), metadata={op_type="Mul" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform/mul"}
  %broadcast.0 = f32[128]{0} broadcast(f32[] %constant_0), dimensions={}, metadata={op_type="Mul" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform/mul"}
  %multiply.0 = f32[128]{0} multiply(f32[128]{0} %param_0.8, f32[128]{0} %broadcast.0), metadata={op_type="Mul" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform/mul"}
  ROOT %add.0 = f32[128]{0} add(f32[128]{0} %broadcast.1, f32[128]{0} %multiply.0), metadata={op_type="Add" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform"}
}

%fused_computation.1 (param_0.9: f32[128]) -> f32[128] {
  %constant_3 = f32[] constant(-0.153093), metadata={op_type="Add" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform"}
  %broadcast.3 = f32[128]{0} broadcast(f32[] %constant_3), dimensions={}, metadata={op_type="Add" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform"}
  %param_0.9 = f32[128]{0} parameter(0)
  %constant_2 = f32[] constant(0.306186), metadata={op_type="Mul" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform/mul"}
  %broadcast.2 = f32[128]{0} broadcast(f32[] %constant_2), dimensions={}, metadata={op_type="Mul" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform/mul"}
  %multiply.1 = f32[128]{0} multiply(f32[128]{0} %param_0.9, f32[128]{0} %broadcast.2), metadata={op_type="Mul" op_name="group1/block0/conv2/bn/gamma/Initializer/random_uniform/mul"}
  ROOT %add.1 = f32[128]{0} add(f32[128]{0} %broadcast.3, f32[128]{0} %multiply.1), metadata={op_type="Add" op_name="group1/block0/conv2/bn/gamma/Initializer/random_uniform"}
}

%fused_computation.2 (param_0.10: f32[128]) -> f32[128] {
  %constant_5 = f32[] constant(-0.153093), metadata={op_type="Add" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform"}
  %broadcast.5 = f32[128]{0} broadcast(f32[] %constant_5), dimensions={}, metadata={op_type="Add" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform"}
  %param_0.10 = f32[128]{0} parameter(0)
  %constant_4 = f32[] constant(0.306186), metadata={op_type="Mul" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform/mul"}
  %broadcast.4 = f32[128]{0} broadcast(f32[] %constant_4), dimensions={}, metadata={op_type="Mul" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform/mul"}
  %multiply.2 = f32[128]{0} multiply(f32[128]{0} %param_0.10, f32[128]{0} %broadcast.4), metadata={op_type="Mul" op_name="group1/block1/conv1/bn/gamma/Initializer/random_uniform/mul"}
  ROOT %add.2 = f32[128]{0} add(f32[128]{0} %broadcast.5, f32[128]{0} %multiply.2), metadata={op_type="Add" op_name="group1/block1/conv1/bn/gamma/Initializer/random_uniform"}
}

%fused_computation.3 (param_0.11: f32[128]) -> f32[128] {
  %constant_7 = f32[] constant(-0.153093), metadata={op_type="Add" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform"}
  %broadcast.7 = f32[128]{0} broadcast(f32[] %constant_7), dimensions={}, metadata={op_type="Add" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform"}
  %param_0.11 = f32[128]{0} parameter(0)
  %constant_6 = f32[] constant(0.306186), metadata={op_type="Mul" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform/mul"}
  %broadcast.6 = f32[128]{0} broadcast(f32[] %constant_6), dimensions={}, metadata={op_type="Mul" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform/mul"}
  %multiply.3 = f32[128]{0} multiply(f32[128]{0} %param_0.11, f32[128]{0} %broadcast.6), metadata={op_type="Mul" op_name="group1/block1/conv2/bn/gamma/Initializer/random_uniform/mul"}
  ROOT %add.3 = f32[128]{0} add(f32[128]{0} %broadcast.7, f32[128]{0} %multiply.3), metadata={op_type="Add" op_name="group1/block1/conv2/bn/gamma/Initializer/random_uniform"}
}

%fused_computation.4 (param_0.12: f32[128]) -> f32[128] {
  %constant_9 = f32[] constant(-0.153093), metadata={op_type="Add" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform"}
  %broadcast.9 = f32[128]{0} broadcast(f32[] %constant_9), dimensions={}, metadata={op_type="Add" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform"}
  %param_0.12 = f32[128]{0} parameter(0)
  %constant_8 = f32[] constant(0.306186), metadata={op_type="Mul" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform/mul"}
  %broadcast.8 = f32[128]{0} broadcast(f32[] %constant_8), dimensions={}, metadata={op_type="Mul" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform/mul"}
  %multiply.4 = f32[128]{0} multiply(f32[128]{0} %param_0.12, f32[128]{0} %broadcast.8), metadata={op_type="Mul" op_name="group1/block2/conv1/bn/gamma/Initializer/random_uniform/mul"}
  ROOT %add.4 = f32[128]{0} add(f32[128]{0} %broadcast.9, f32[128]{0} %multiply.4), metadata={op_type="Add" op_name="group1/block2/conv1/bn/gamma/Initializer/random_uniform"}
}

%fused_computation.5 (param_0.13: f32[128]) -> f32[128] {
  %constant_11 = f32[] constant(-0.153093), metadata={op_type="Add" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform"}
  %broadcast.11 = f32[128]{0} broadcast(f32[] %constant_11), dimensions={}, metadata={op_type="Add" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform"}
  %param_0.13 = f32[128]{0} parameter(0)
  %constant_10 = f32[] constant(0.306186), metadata={op_type="Mul" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform/mul"}
  %broadcast.10 = f32[128]{0} broadcast(f32[] %constant_10), dimensions={}, metadata={op_type="Mul" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform/mul"}
  %multiply.5 = f32[128]{0} multiply(f32[128]{0} %param_0.13, f32[128]{0} %broadcast.10), metadata={op_type="Mul" op_name="group1/block2/conv2/bn/gamma/Initializer/random_uniform/mul"}
  ROOT %add.5 = f32[128]{0} add(f32[128]{0} %broadcast.11, f32[128]{0} %multiply.5), metadata={op_type="Add" op_name="group1/block2/conv2/bn/gamma/Initializer/random_uniform"}
}

%fused_computation.6 (param_0.14: f32[128]) -> f32[128] {
  %constant_13 = f32[] constant(-0.153093), metadata={op_type="Add" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform"}
  %broadcast.13 = f32[128]{0} broadcast(f32[] %constant_13), dimensions={}, metadata={op_type="Add" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform"}
  %param_0.14 = f32[128]{0} parameter(0)
  %constant_12 = f32[] constant(0.306186), metadata={op_type="Mul" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform/mul"}
  %broadcast.12 = f32[128]{0} broadcast(f32[] %constant_12), dimensions={}, metadata={op_type="Mul" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform/mul"}
  %multiply.6 = f32[128]{0} multiply(f32[128]{0} %param_0.14, f32[128]{0} %broadcast.12), metadata={op_type="Mul" op_name="group1/block3/conv1/bn/gamma/Initializer/random_uniform/mul"}
  ROOT %add.6 = f32[128]{0} add(f32[128]{0} %broadcast.13, f32[128]{0} %multiply.6), metadata={op_type="Add" op_name="group1/block3/conv1/bn/gamma/Initializer/random_uniform"}
}

%fused_computation.7 (param_0.15: f32[128]) -> f32[128] {
  %constant_15 = f32[] constant(-0.153093), metadata={op_type="Add" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform"}
  %broadcast.15 = f32[128]{0} broadcast(f32[] %constant_15), dimensions={}, metadata={op_type="Add" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform"}
  %param_0.15 = f32[128]{0} parameter(0)
  %constant_14 = f32[] constant(0.306186), metadata={op_type="Mul" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform/mul"}
  %broadcast.14 = f32[128]{0} broadcast(f32[] %constant_14), dimensions={}, metadata={op_type="Mul" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform/mul"}
  %multiply.7 = f32[128]{0} multiply(f32[128]{0} %param_0.15, f32[128]{0} %broadcast.14), metadata={op_type="Mul" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform/mul"}
  ROOT %add.7 = f32[128]{0} add(f32[128]{0} %broadcast.15, f32[128]{0} %multiply.7), metadata={op_type="Add" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform"}
}

ENTRY %cluster_2__XlaCompiledKernel_true__XlaNumConstantArgs_0__XlaNumResourceArgs_0_.74 (arg0.1: f32[128], arg1.2: f32[128], arg2.3: f32[128], arg3.4: f32[128], arg4.5: f32[128], arg5.6: f32[128], arg6.7: f32[128], arg7.8: f32[128]) -> (f32[128], f32[128], f32[128], f32[128], f32[128], f32[128], f32[128], f32[128]) {
  %arg0.1 = f32[128]{0} parameter(0), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %fusion.7 = f32[128]{0} fusion(f32[128]{0} %arg0.1), kind=kLoop, calls=%fused_computation.7, metadata={op_type="Add" op_name="group1/block3/conv2/bn/gamma/Initializer/random_uniform"}
  %arg1.2 = f32[128]{0} parameter(1), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %fusion.6 = f32[128]{0} fusion(f32[128]{0} %arg1.2), kind=kLoop, calls=%fused_computation.6, metadata={op_type="Add" op_name="group1/block3/conv1/bn/gamma/Initializer/random_uniform"}
  %arg2.3 = f32[128]{0} parameter(2), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %fusion.5 = f32[128]{0} fusion(f32[128]{0} %arg2.3), kind=kLoop, calls=%fused_computation.5, metadata={op_type="Add" op_name="group1/block2/conv2/bn/gamma/Initializer/random_uniform"}
  %arg3.4 = f32[128]{0} parameter(3), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %fusion.4 = f32[128]{0} fusion(f32[128]{0} %arg3.4), kind=kLoop, calls=%fused_computation.4, metadata={op_type="Add" op_name="group1/block2/conv1/bn/gamma/Initializer/random_uniform"}
  %arg4.5 = f32[128]{0} parameter(4), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %fusion.3 = f32[128]{0} fusion(f32[128]{0} %arg4.5), kind=kLoop, calls=%fused_computation.3, metadata={op_type="Add" op_name="group1/block1/conv2/bn/gamma/Initializer/random_uniform"}
  %arg5.6 = f32[128]{0} parameter(5), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %fusion.2 = f32[128]{0} fusion(f32[128]{0} %arg5.6), kind=kLoop, calls=%fused_computation.2, metadata={op_type="Add" op_name="group1/block1/conv1/bn/gamma/Initializer/random_uniform"}
  %arg6.7 = f32[128]{0} parameter(6), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %fusion.1 = f32[128]{0} fusion(f32[128]{0} %arg6.7), kind=kLoop, calls=%fused_computation.1, metadata={op_type="Add" op_name="group1/block0/conv2/bn/gamma/Initializer/random_uniform"}
  %arg7.8 = f32[128]{0} parameter(7), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %fusion = f32[128]{0} fusion(f32[128]{0} %arg7.8), kind=kLoop, calls=%fused_computation, metadata={op_type="Add" op_name="group1/block0/conv1/bn/gamma/Initializer/random_uniform"}
  ROOT %tuple.73 = (f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[128]{0}) tuple(f32[128]{0} %fusion.7, f32[128]{0} %fusion.6, f32[128]{0} %fusion.5, f32[128]{0} %fusion.4, f32[128]{0} %fusion.3, f32[128]{0} %fusion.2, f32[128]{0} %fusion.1, f32[128]{0} %fusion), metadata={op_name="XLA_Retvals"}
}

