HloModule cluster_4__XlaCompiledKernel_true__XlaNumConstantArgs_723__XlaNumResourceArgs_0_.4154

%add_float_.1249 (x.1250: f32[], y.1251: f32[]) -> f32[] {
  %x.1250 = f32[] parameter(0)
  %y.1251 = f32[] parameter(1)
  ROOT %add.1252 = f32[] add(f32[] %x.1250, f32[] %y.1251)
}

%ge_F32.1525 (lhs.1526: f32[], rhs.1527: f32[]) -> pred[] {
  %lhs.1526 = f32[] parameter(0)
  %rhs.1527 = f32[] parameter(1)
  ROOT %compare.1528 = pred[] compare(f32[] %lhs.1526, f32[] %rhs.1527), direction=GE
}

%add_F32.1529 (lhs.1530: f32[], rhs.1531: f32[]) -> f32[] {
  %lhs.1530 = f32[] parameter(0)
  %rhs.1531 = f32[] parameter(1)
  ROOT %add.1532 = f32[] add(f32[] %lhs.1530, f32[] %rhs.1531)
}

%fused_computation (param_0.2: f32[1,128,1,1], param_1.2: f32[1,128,1,1], param_2.3: f32[128], param_3.3: f32[128]) -> f32[128] {
  %param_3.3 = f32[128]{0} parameter(3)
  %bitcast.227 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %param_3.3), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_2.3 = f32[128]{0} parameter(2)
  %negate.48 = f32[128]{0} negate(f32[128]{0} %param_2.3), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/batchnorm/sub_grad/Neg"}
  %bitcast.226 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %negate.48), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/batchnorm/sub_grad/Neg"}
  %param_1.2 = f32[1,128,1,1]{3,2,1,0} parameter(1)
  %multiply.8 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %bitcast.226, f32[1,128,1,1]{3,2,1,0} %param_1.2), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.7 = f32[1,128,1,1]{3,2,1,0} add(f32[1,128,1,1]{3,2,1,0} %bitcast.227, f32[1,128,1,1]{3,2,1,0} %multiply.8), metadata={op_type="AddN" op_name="tower0/gradients/AddN_205"}
  %param_0.2 = f32[1,128,1,1]{3,2,1,0} parameter(0)
  %multiply.7 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %add.7, f32[1,128,1,1]{3,2,1,0} %param_0.2), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/batchnorm/mul_grad/Mul_1"}
  ROOT %bitcast.225 = f32[128]{0} bitcast(f32[1,128,1,1]{3,2,1,0} %multiply.7), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/Reshape_grad/Reshape"}
}

%tower0_gradients_tower0_group1_block0_conv1_bn_batchnorm_mul_1_grad_Sum_1-reduction.3011 (x.3012: f32[], y.3013: f32[]) -> f32[] {
  %x.3012 = f32[] parameter(0)
  %y.3013 = f32[] parameter(1)
  ROOT %add.3014 = f32[] add(f32[] %x.3012, f32[] %y.3013)
}

%tower0_gradients_tower0_group1_block0_conv1_bn_batchnorm_add_1_grad_Sum_1-reduction.3021 (x.3022: f32[], y.3023: f32[]) -> f32[] {
  %x.3022 = f32[] parameter(0)
  %y.3023 = f32[] parameter(1)
  ROOT %add.3024 = f32[] add(f32[] %x.3022, f32[] %y.3023)
}

%fused_computation.1 (param_0.648: f32[1,128,200,304], param_1.875: f32[1,128,201,305], param_2.761: f32[1,128,200,304]) -> (f32[128], f32[128], f32[1,128,200,304]) {
  %param_2.761 = f32[1,128,200,304]{3,2,1,0} parameter(2)
  %constant_239 = f32[] constant(0), metadata={op_type="ZerosLike" op_name="tower0/gradients/tower0/rpn_losses/level2/logistic_loss/Select_grad/zeros_like"}
  %broadcast.82.clone.1 = f32[1,128,200,304]{3,2,1,0} broadcast(f32[] %constant_239), dimensions={}, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block0/conv1/Relu_grad/ReluGrad"}
  %compare.0.clone.1 = pred[1,128,200,304]{3,2,1,0} compare(f32[1,128,200,304]{3,2,1,0} %param_2.761, f32[1,128,200,304]{3,2,1,0} %broadcast.82.clone.1), direction=GT, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block0/conv1/Relu_grad/ReluGrad"}
  %param_1.875 = f32[1,128,201,305]{3,2,1,0} parameter(1)
  %slice.0.clone.1 = f32[1,128,200,304]{3,2,1,0} slice(f32[1,128,201,305]{3,2,1,0} %param_1.875), slice={[0:1], [0:128], [1:201], [1:305]}, metadata={op_type="Slice" op_name="tower0/gradients/tower0/group1/block0/Pad_grad/Slice_1"}
  %select.0.clone.1 = f32[1,128,200,304]{3,2,1,0} select(pred[1,128,200,304]{3,2,1,0} %compare.0.clone.1, f32[1,128,200,304]{3,2,1,0} %slice.0.clone.1, f32[1,128,200,304]{3,2,1,0} %broadcast.82.clone.1), metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block0/conv1/Relu_grad/ReluGrad"}
  %param_0.648 = f32[1,128,200,304]{3,2,1,0} parameter(0)
  %multiply.9 = f32[1,128,200,304]{3,2,1,0} multiply(f32[1,128,200,304]{3,2,1,0} %select.0.clone.1, f32[1,128,200,304]{3,2,1,0} %param_0.648), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.13 = f32[128]{0} reduce(f32[1,128,200,304]{3,2,1,0} %multiply.9, f32[] %constant_239), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block0_conv1_bn_batchnorm_mul_1_grad_Sum_1-reduction.3011, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/batchnorm/mul_1_grad/Sum_1"}
  %reduce.70 = f32[128]{0} reduce(f32[1,128,200,304]{3,2,1,0} %select.0.clone.1, f32[] %constant_239), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block0_conv1_bn_batchnorm_add_1_grad_Sum_1-reduction.3021, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block0/conv1/bn/batchnorm/add_1_grad/Sum_1"}
  ROOT %tuple.237 = (f32[128]{0}, f32[128]{0}, f32[1,128,200,304]{3,2,1,0}) tuple(f32[128]{0} %reduce.13, f32[128]{0} %reduce.70, f32[1,128,200,304]{3,2,1,0} %select.0.clone.1)
}

%fused_computation.2 (param_0.7: f32[1,1,256,128], param_1.9: f32[1,1,256,128]) -> f32[1,1,256,128] {
  %param_0.7 = f32[1,1,256,128]{1,0,2,3} parameter(0)
  %param_1.9 = f32[1,1,256,128]{3,2,1,0} parameter(1)
  %copy.365 = f32[1,1,256,128]{1,0,2,3} copy(f32[1,1,256,128]{3,2,1,0} %param_1.9), metadata={op_name="XLA_Args"}
  %constant_240 = f32[] constant(0.0001), metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %broadcast.67 = f32[1,1,256,128]{1,0,2,3} broadcast(f32[] %constant_240), dimensions={}, metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_grad/Mul"}
  %multiply.10 = f32[1,1,256,128]{1,0,2,3} multiply(f32[1,1,256,128]{1,0,2,3} %copy.365, f32[1,1,256,128]{1,0,2,3} %broadcast.67), metadata={op_type="Mul" op_name="tower0/gradients/tower0/wd_cost_internals/Square_grad/Mul_1"}
  %add.8 = f32[1,1,256,128]{1,0,2,3} add(f32[1,1,256,128]{1,0,2,3} %param_0.7, f32[1,1,256,128]{1,0,2,3} %multiply.10), metadata={op_type="AddN" op_name="tower0/gradients/AddN_204"}
  ROOT %copy.364 = f32[1,1,256,128]{3,2,1,0} copy(f32[1,1,256,128]{1,0,2,3} %add.8), metadata={op_name="XLA_Retvals"}
}

%fused_computation.3 (param_0.10: f32[1,128,1,1], param_1.12: f32[1,128,1,1], param_2.11: f32[128], param_3.7: f32[128]) -> f32[128] {
  %param_3.7 = f32[128]{0} parameter(3)
  %bitcast.230 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %param_3.7), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_2.11 = f32[128]{0} parameter(2)
  %negate.49 = f32[128]{0} negate(f32[128]{0} %param_2.11), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/batchnorm/sub_grad/Neg"}
  %bitcast.229 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %negate.49), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/batchnorm/sub_grad/Neg"}
  %param_1.12 = f32[1,128,1,1]{3,2,1,0} parameter(1)
  %multiply.12 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %bitcast.229, f32[1,128,1,1]{3,2,1,0} %param_1.12), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.9 = f32[1,128,1,1]{3,2,1,0} add(f32[1,128,1,1]{3,2,1,0} %bitcast.230, f32[1,128,1,1]{3,2,1,0} %multiply.12), metadata={op_type="AddN" op_name="tower0/gradients/AddN_203"}
  %param_0.10 = f32[1,128,1,1]{3,2,1,0} parameter(0)
  %multiply.11 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %add.9, f32[1,128,1,1]{3,2,1,0} %param_0.10), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/batchnorm/mul_grad/Mul_1"}
  ROOT %bitcast.228 = f32[128]{0} bitcast(f32[1,128,1,1]{3,2,1,0} %multiply.11), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/Reshape_grad/Reshape"}
}

%tower0_gradients_tower0_group1_block0_conv2_bn_batchnorm_mul_1_grad_Sum_1-reduction.3038 (x.3039: f32[], y.3040: f32[]) -> f32[] {
  %x.3039 = f32[] parameter(0)
  %y.3040 = f32[] parameter(1)
  ROOT %add.3041 = f32[] add(f32[] %x.3039, f32[] %y.3040)
}

%tower0_gradients_tower0_group1_block0_conv2_bn_batchnorm_add_1_grad_Sum_1-reduction.3048 (x.3049: f32[], y.3050: f32[]) -> f32[] {
  %x.3049 = f32[] parameter(0)
  %y.3050 = f32[] parameter(1)
  ROOT %add.3051 = f32[] add(f32[] %x.3049, f32[] %y.3050)
}

%fused_computation.4 (param_0.647: f32[1,128,100,152], param_1.876: f32[1,128,100,152], param_2.762: f32[1,128,100,152]) -> (f32[128], f32[128], f32[1,128,100,152]) {
  %param_2.762 = f32[1,128,100,152]{3,2,1,0} parameter(2)
  %constant_241 = f32[] constant(0), metadata={op_type="ZerosLike" op_name="tower0/gradients/tower0/rpn_losses/level2/logistic_loss/Select_grad/zeros_like"}
  %broadcast.195.clone.1 = f32[1,128,100,152]{3,2,1,0} broadcast(f32[] %constant_241), dimensions={}, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block3/conv2/Relu_grad/ReluGrad"}
  %compare.1.clone.1 = pred[1,128,100,152]{3,2,1,0} compare(f32[1,128,100,152]{3,2,1,0} %param_2.762, f32[1,128,100,152]{3,2,1,0} %broadcast.195.clone.1), direction=GT, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block0/conv2/Relu_grad/ReluGrad"}
  %param_1.876 = f32[1,128,100,152]{3,2,1,0} parameter(1)
  %select.1.clone.1 = f32[1,128,100,152]{3,2,1,0} select(pred[1,128,100,152]{3,2,1,0} %compare.1.clone.1, f32[1,128,100,152]{3,2,1,0} %param_1.876, f32[1,128,100,152]{3,2,1,0} %broadcast.195.clone.1), metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block0/conv2/Relu_grad/ReluGrad"}
  %param_0.647 = f32[1,128,100,152]{3,2,1,0} parameter(0)
  %multiply.13 = f32[1,128,100,152]{3,2,1,0} multiply(f32[1,128,100,152]{3,2,1,0} %select.1.clone.1, f32[1,128,100,152]{3,2,1,0} %param_0.647), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.14 = f32[128]{0} reduce(f32[1,128,100,152]{3,2,1,0} %multiply.13, f32[] %constant_241), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block0_conv2_bn_batchnorm_mul_1_grad_Sum_1-reduction.3038, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/batchnorm/mul_1_grad/Sum_1"}
  %reduce.82 = f32[128]{0} reduce(f32[1,128,100,152]{3,2,1,0} %select.1.clone.1, f32[] %constant_241), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block0_conv2_bn_batchnorm_add_1_grad_Sum_1-reduction.3048, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block0/conv2/bn/batchnorm/add_1_grad/Sum_1"}
  ROOT %tuple.236 = (f32[128]{0}, f32[128]{0}, f32[1,128,100,152]{3,2,1,0}) tuple(f32[128]{0} %reduce.14, f32[128]{0} %reduce.82, f32[1,128,100,152]{3,2,1,0} %select.1.clone.1)
}

%fused_computation.5 (param_0.15: f32[3,3,128,128], param_1.691: f32[3,3,128,128]) -> f32[3,3,128,128] {
  %param_0.15 = f32[3,3,128,128]{1,0,2,3} parameter(0)
  %param_1.691 = f32[3,3,128,128]{3,2,1,0} parameter(1)
  %copy.453 = f32[3,3,128,128]{1,0,2,3} copy(f32[3,3,128,128]{3,2,1,0} %param_1.691), metadata={op_name="XLA_Args"}
  %constant_312 = f32[] constant(0.0001), metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %broadcast.162 = f32[3,3,128,128]{1,0,2,3} broadcast(f32[] %constant_312), dimensions={}, metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_11_grad/Mul"}
  %multiply.14 = f32[3,3,128,128]{1,0,2,3} multiply(f32[3,3,128,128]{1,0,2,3} %copy.453, f32[3,3,128,128]{1,0,2,3} %broadcast.162), metadata={op_type="Mul" op_name="tower0/gradients/tower0/wd_cost_internals/Square_1_grad/Mul_1"}
  %add.10 = f32[3,3,128,128]{1,0,2,3} add(f32[3,3,128,128]{1,0,2,3} %param_0.15, f32[3,3,128,128]{1,0,2,3} %multiply.14), metadata={op_type="AddN" op_name="tower0/gradients/AddN_202"}
  ROOT %copy.366 = f32[3,3,128,128]{3,2,1,0} copy(f32[3,3,128,128]{1,0,2,3} %add.10), metadata={op_name="XLA_Retvals"}
}

%fused_computation.8 (param_0.24: f32[1,512,1,1], param_1.797: f32[1,512,1,1], param_2.580: f32[512], param_3.302: f32[512], param_4.90: f32[1,512,1,1], param_5.79: f32[1,512,1,1], param_6.74: f32[512]) -> (f32[512], f32[512]) {
  %param_2.580 = f32[512]{0} parameter(2)
  %bitcast.234 = f32[1,512,1,1]{3,2,1,0} bitcast(f32[512]{0} %param_2.580), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_3.302 = f32[512]{0} parameter(3)
  %negate.108 = f32[512]{0} negate(f32[512]{0} %param_3.302), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/batchnorm/sub_grad/Neg"}
  %bitcast.419 = f32[1,512,1,1]{3,2,1,0} bitcast(f32[512]{0} %negate.108), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/batchnorm/sub_grad/Neg"}
  %param_1.797 = f32[1,512,1,1]{3,2,1,0} parameter(1)
  %multiply.19 = f32[1,512,1,1]{3,2,1,0} multiply(f32[1,512,1,1]{3,2,1,0} %bitcast.419, f32[1,512,1,1]{3,2,1,0} %param_1.797), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.12 = f32[1,512,1,1]{3,2,1,0} add(f32[1,512,1,1]{3,2,1,0} %bitcast.234, f32[1,512,1,1]{3,2,1,0} %multiply.19), metadata={op_type="AddN" op_name="tower0/gradients/AddN_201"}
  %param_0.24 = f32[1,512,1,1]{3,2,1,0} parameter(0)
  %multiply.18 = f32[1,512,1,1]{3,2,1,0} multiply(f32[1,512,1,1]{3,2,1,0} %add.12, f32[1,512,1,1]{3,2,1,0} %param_0.24), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/batchnorm/mul_grad/Mul_1"}
  %bitcast.233 = f32[512]{0} bitcast(f32[1,512,1,1]{3,2,1,0} %multiply.18), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/Reshape_grad/Reshape"}
  %param_6.74 = f32[512]{0} parameter(6)
  %bitcast.232.clone.1 = f32[1,512,1,1]{3,2,1,0} bitcast(f32[512]{0} %param_6.74), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block0/conv3/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_5.79 = f32[1,512,1,1]{3,2,1,0} parameter(5)
  %multiply.16.clone.1 = f32[1,512,1,1]{3,2,1,0} multiply(f32[1,512,1,1]{3,2,1,0} %bitcast.419, f32[1,512,1,1]{3,2,1,0} %param_5.79), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv3/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.11.clone.1 = f32[1,512,1,1]{3,2,1,0} add(f32[1,512,1,1]{3,2,1,0} %bitcast.232.clone.1, f32[1,512,1,1]{3,2,1,0} %multiply.16.clone.1), metadata={op_type="AddN" op_name="tower0/gradients/AddN_199"}
  %param_4.90 = f32[1,512,1,1]{3,2,1,0} parameter(4)
  %multiply.15.clone.1 = f32[1,512,1,1]{3,2,1,0} multiply(f32[1,512,1,1]{3,2,1,0} %add.11.clone.1, f32[1,512,1,1]{3,2,1,0} %param_4.90), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv3/bn/batchnorm/mul_grad/Mul_1"}
  %bitcast.231.clone.1 = f32[512]{0} bitcast(f32[1,512,1,1]{3,2,1,0} %multiply.15.clone.1), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block0/conv3/bn/Reshape_grad/Reshape"}
  ROOT %tuple.186 = (f32[512]{0}, f32[512]{0}) tuple(f32[512]{0} %bitcast.233, f32[512]{0} %bitcast.231.clone.1)
}

%tower0_gradients_tower0_group1_block0_convshortcut_bn_batchnorm_mul_1_grad_Sum_1-reduction.3118 (x.3119: f32[], y.3120: f32[]) -> f32[] {
  %x.3119 = f32[] parameter(0)
  %y.3120 = f32[] parameter(1)
  ROOT %add.3121 = f32[] add(f32[] %x.3119, f32[] %y.3120)
}

%tower0_gradients_tower0_group1_block0_convshortcut_bn_batchnorm_add_1_grad_Sum_1-reduction.3128 (x.3129: f32[], y.3130: f32[]) -> f32[] {
  %x.3129 = f32[] parameter(0)
  %y.3130 = f32[] parameter(1)
  ROOT %add.3131 = f32[] add(f32[] %x.3129, f32[] %y.3130)
}

%tower0_gradients_tower0_group1_block0_conv3_bn_batchnorm_mul_1_grad_Sum_1-reduction.3065 (x.3066: f32[], y.3067: f32[]) -> f32[] {
  %x.3066 = f32[] parameter(0)
  %y.3067 = f32[] parameter(1)
  ROOT %add.3068 = f32[] add(f32[] %x.3066, f32[] %y.3067)
}

%fused_computation.10 (param_0.646: f32[1,512,100,152], param_1.877: f32[1,512,100,152], param_2.763: f32[1,512,100,152], param_3.490: f32[1,512,100,152], param_4.241: f32[1,512,100,152]) -> (f32[512], f32[512], f32[512], f32[1,512,100,152]) {
  %param_4.241 = f32[1,512,100,152]{3,2,1,0} parameter(4)
  %constant_243 = f32[] constant(0), metadata={op_type="ZerosLike" op_name="tower0/gradients/tower0/rpn_losses/level2/logistic_loss/Select_grad/zeros_like"}
  %broadcast.196.clone.1 = f32[1,512,100,152]{3,2,1,0} broadcast(f32[] %constant_243), dimensions={}, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block3/output_grad/ReluGrad"}
  %compare.2.clone.1 = pred[1,512,100,152]{3,2,1,0} compare(f32[1,512,100,152]{3,2,1,0} %param_4.241, f32[1,512,100,152]{3,2,1,0} %broadcast.196.clone.1), direction=GT, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block0/output_grad/ReluGrad"}
  %param_2.763 = f32[1,512,100,152]{3,2,1,0} parameter(2)
  %param_3.490 = f32[1,512,100,152]{3,2,1,0} parameter(3)
  %add.126.clone.1 = f32[1,512,100,152]{3,2,1,0} add(f32[1,512,100,152]{3,2,1,0} %param_2.763, f32[1,512,100,152]{3,2,1,0} %param_3.490), metadata={op_type="AddN" op_name="tower0/gradients/AddN_195"}
  %select.2.clone.1 = f32[1,512,100,152]{3,2,1,0} select(pred[1,512,100,152]{3,2,1,0} %compare.2.clone.1, f32[1,512,100,152]{3,2,1,0} %add.126.clone.1, f32[1,512,100,152]{3,2,1,0} %broadcast.196.clone.1), metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block0/output_grad/ReluGrad"}
  %param_0.646 = f32[1,512,100,152]{3,2,1,0} parameter(0)
  %multiply.20 = f32[1,512,100,152]{3,2,1,0} multiply(f32[1,512,100,152]{3,2,1,0} %select.2.clone.1, f32[1,512,100,152]{3,2,1,0} %param_0.646), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.16 = f32[512]{0} reduce(f32[1,512,100,152]{3,2,1,0} %multiply.20, f32[] %constant_243), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block0_convshortcut_bn_batchnorm_mul_1_grad_Sum_1-reduction.3118, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/batchnorm/mul_1_grad/Sum_1"}
  %reduce.69 = f32[512]{0} reduce(f32[1,512,100,152]{3,2,1,0} %select.2.clone.1, f32[] %constant_243), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block0_convshortcut_bn_batchnorm_add_1_grad_Sum_1-reduction.3128, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block0/convshortcut/bn/batchnorm/add_1_grad/Sum_1"}
  %param_1.877 = f32[1,512,100,152]{3,2,1,0} parameter(1)
  %multiply.17.clone.1 = f32[1,512,100,152]{3,2,1,0} multiply(f32[1,512,100,152]{3,2,1,0} %select.2.clone.1, f32[1,512,100,152]{3,2,1,0} %param_1.877), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block0/conv3/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.15.clone.1 = f32[512]{0} reduce(f32[1,512,100,152]{3,2,1,0} %multiply.17.clone.1, f32[] %constant_243), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block0_conv3_bn_batchnorm_mul_1_grad_Sum_1-reduction.3065, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block0/conv3/bn/batchnorm/mul_1_grad/Sum_1"}
  ROOT %tuple.235 = (f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[1,512,100,152]{3,2,1,0}) tuple(f32[512]{0} %reduce.16, f32[512]{0} %reduce.69, f32[512]{0} %reduce.15.clone.1, f32[1,512,100,152]{3,2,1,0} %select.2.clone.1)
}

%fused_computation.11 (param_0.31: f32[1,1,128,512], param_1.692: f32[1,1,128,512]) -> f32[1,1,128,512] {
  %param_0.31 = f32[1,1,128,512]{1,0,2,3} parameter(0)
  %param_1.692 = f32[1,1,128,512]{3,2,1,0} parameter(1)
  %copy.368 = f32[1,1,128,512]{1,0,2,3} copy(f32[1,1,128,512]{3,2,1,0} %param_1.692), metadata={op_name="XLA_Args"}
  %constant_313 = f32[] constant(0.0001), metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %broadcast.163 = f32[1,1,128,512]{1,0,2,3} broadcast(f32[] %constant_313), dimensions={}, metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_2_grad/Mul"}
  %multiply.21 = f32[1,1,128,512]{1,0,2,3} multiply(f32[1,1,128,512]{1,0,2,3} %copy.368, f32[1,1,128,512]{1,0,2,3} %broadcast.163), metadata={op_type="Mul" op_name="tower0/gradients/tower0/wd_cost_internals/Square_2_grad/Mul_1"}
  %add.13 = f32[1,1,128,512]{1,0,2,3} add(f32[1,1,128,512]{1,0,2,3} %param_0.31, f32[1,1,128,512]{1,0,2,3} %multiply.21), metadata={op_type="AddN" op_name="tower0/gradients/AddN_198"}
  ROOT %copy.367 = f32[1,1,128,512]{3,2,1,0} copy(f32[1,1,128,512]{1,0,2,3} %add.13), metadata={op_name="XLA_Retvals"}
}

%fused_computation.12 (param_0.33: f32[1,1,256,512], param_1.36: f32[1,1,256,512]) -> f32[1,1,256,512] {
  %param_0.33 = f32[1,1,256,512]{1,0,2,3} parameter(0)
  %param_1.36 = f32[1,1,256,512]{3,2,1,0} parameter(1)
  %copy.370 = f32[1,1,256,512]{1,0,2,3} copy(f32[1,1,256,512]{3,2,1,0} %param_1.36), metadata={op_name="XLA_Args"}
  %constant_244 = f32[] constant(0.0001), metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %broadcast.68 = f32[1,1,256,512]{1,0,2,3} broadcast(f32[] %constant_244), dimensions={}, metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_3_grad/Mul"}
  %multiply.22 = f32[1,1,256,512]{1,0,2,3} multiply(f32[1,1,256,512]{1,0,2,3} %copy.370, f32[1,1,256,512]{1,0,2,3} %broadcast.68), metadata={op_type="Mul" op_name="tower0/gradients/tower0/wd_cost_internals/Square_3_grad/Mul_1"}
  %add.14 = f32[1,1,256,512]{1,0,2,3} add(f32[1,1,256,512]{1,0,2,3} %param_0.33, f32[1,1,256,512]{1,0,2,3} %multiply.22), metadata={op_type="AddN" op_name="tower0/gradients/AddN_200"}
  ROOT %copy.369 = f32[1,1,256,512]{3,2,1,0} copy(f32[1,1,256,512]{1,0,2,3} %add.14), metadata={op_name="XLA_Retvals"}
}

%fused_computation.13 (param_0.36: f32[1,128,1,1], param_1.39: f32[1,128,1,1], param_2.30: f32[128], param_3.15: f32[128]) -> f32[128] {
  %param_3.15 = f32[128]{0} parameter(3)
  %bitcast.238 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %param_3.15), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_2.30 = f32[128]{0} parameter(2)
  %negate.51 = f32[128]{0} negate(f32[128]{0} %param_2.30), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/batchnorm/sub_grad/Neg"}
  %bitcast.237 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %negate.51), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/batchnorm/sub_grad/Neg"}
  %param_1.39 = f32[1,128,1,1]{3,2,1,0} parameter(1)
  %multiply.24 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %bitcast.237, f32[1,128,1,1]{3,2,1,0} %param_1.39), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.15 = f32[1,128,1,1]{3,2,1,0} add(f32[1,128,1,1]{3,2,1,0} %bitcast.238, f32[1,128,1,1]{3,2,1,0} %multiply.24), metadata={op_type="AddN" op_name="tower0/gradients/AddN_197"}
  %param_0.36 = f32[1,128,1,1]{3,2,1,0} parameter(0)
  %multiply.23 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %add.15, f32[1,128,1,1]{3,2,1,0} %param_0.36), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/batchnorm/mul_grad/Mul_1"}
  ROOT %bitcast.236 = f32[128]{0} bitcast(f32[1,128,1,1]{3,2,1,0} %multiply.23), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/Reshape_grad/Reshape"}
}

%tower0_gradients_tower0_group1_block1_conv1_bn_batchnorm_mul_1_grad_Sum_1-reduction.3145 (x.3146: f32[], y.3147: f32[]) -> f32[] {
  %x.3146 = f32[] parameter(0)
  %y.3147 = f32[] parameter(1)
  ROOT %add.3148 = f32[] add(f32[] %x.3146, f32[] %y.3147)
}

%tower0_gradients_tower0_group1_block1_conv1_bn_batchnorm_add_1_grad_Sum_1-reduction.3155 (x.3156: f32[], y.3157: f32[]) -> f32[] {
  %x.3156 = f32[] parameter(0)
  %y.3157 = f32[] parameter(1)
  ROOT %add.3158 = f32[] add(f32[] %x.3156, f32[] %y.3157)
}

%fused_computation.14 (param_0.645: f32[1,128,100,152], param_1.878: f32[1,128,100,152], param_2.764: f32[1,128,100,152]) -> (f32[128], f32[128], f32[1,128,100,152]) {
  %param_2.764 = f32[1,128,100,152]{3,2,1,0} parameter(2)
  %constant_245 = f32[] constant(0), metadata={op_type="ZerosLike" op_name="tower0/gradients/tower0/rpn_losses/level2/logistic_loss/Select_grad/zeros_like"}
  %broadcast.197.clone.1 = f32[1,128,100,152]{3,2,1,0} broadcast(f32[] %constant_245), dimensions={}, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block3/conv2/Relu_grad/ReluGrad"}
  %compare.3.clone.1 = pred[1,128,100,152]{3,2,1,0} compare(f32[1,128,100,152]{3,2,1,0} %param_2.764, f32[1,128,100,152]{3,2,1,0} %broadcast.197.clone.1), direction=GT, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block1/conv1/Relu_grad/ReluGrad"}
  %param_1.878 = f32[1,128,100,152]{3,2,1,0} parameter(1)
  %select.3.clone.1 = f32[1,128,100,152]{3,2,1,0} select(pred[1,128,100,152]{3,2,1,0} %compare.3.clone.1, f32[1,128,100,152]{3,2,1,0} %param_1.878, f32[1,128,100,152]{3,2,1,0} %broadcast.197.clone.1), metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block1/conv1/Relu_grad/ReluGrad"}
  %param_0.645 = f32[1,128,100,152]{3,2,1,0} parameter(0)
  %multiply.25 = f32[1,128,100,152]{3,2,1,0} multiply(f32[1,128,100,152]{3,2,1,0} %select.3.clone.1, f32[1,128,100,152]{3,2,1,0} %param_0.645), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.17 = f32[128]{0} reduce(f32[1,128,100,152]{3,2,1,0} %multiply.25, f32[] %constant_245), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block1_conv1_bn_batchnorm_mul_1_grad_Sum_1-reduction.3145, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/batchnorm/mul_1_grad/Sum_1"}
  %reduce.83 = f32[128]{0} reduce(f32[1,128,100,152]{3,2,1,0} %select.3.clone.1, f32[] %constant_245), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block1_conv1_bn_batchnorm_add_1_grad_Sum_1-reduction.3155, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block1/conv1/bn/batchnorm/add_1_grad/Sum_1"}
  ROOT %tuple.234 = (f32[128]{0}, f32[128]{0}, f32[1,128,100,152]{3,2,1,0}) tuple(f32[128]{0} %reduce.17, f32[128]{0} %reduce.83, f32[1,128,100,152]{3,2,1,0} %select.3.clone.1)
}

%fused_computation.15 (param_0.41: f32[1,1,512,128], param_1.693: f32[1,1,512,128]) -> f32[1,1,512,128] {
  %param_0.41 = f32[1,1,512,128]{1,0,2,3} parameter(0)
  %param_1.693 = f32[1,1,512,128]{3,2,1,0} parameter(1)
  %copy.372 = f32[1,1,512,128]{1,0,2,3} copy(f32[1,1,512,128]{3,2,1,0} %param_1.693), metadata={op_name="XLA_Args"}
  %constant_314 = f32[] constant(0.0001), metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %broadcast.164 = f32[1,1,512,128]{1,0,2,3} broadcast(f32[] %constant_314), dimensions={}, metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %multiply.26 = f32[1,1,512,128]{1,0,2,3} multiply(f32[1,1,512,128]{1,0,2,3} %copy.372, f32[1,1,512,128]{1,0,2,3} %broadcast.164), metadata={op_type="Mul" op_name="tower0/gradients/tower0/wd_cost_internals/Square_4_grad/Mul_1"}
  %add.16 = f32[1,1,512,128]{1,0,2,3} add(f32[1,1,512,128]{1,0,2,3} %param_0.41, f32[1,1,512,128]{1,0,2,3} %multiply.26), metadata={op_type="AddN" op_name="tower0/gradients/AddN_196"}
  ROOT %copy.371 = f32[1,1,512,128]{3,2,1,0} copy(f32[1,1,512,128]{1,0,2,3} %add.16), metadata={op_name="XLA_Retvals"}
}

%fused_computation.16 (param_0.44: f32[1,128,1,1], param_1.48: f32[1,128,1,1], param_2.37: f32[128], param_3.19: f32[128]) -> f32[128] {
  %param_3.19 = f32[128]{0} parameter(3)
  %bitcast.241 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %param_3.19), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_2.37 = f32[128]{0} parameter(2)
  %negate.52 = f32[128]{0} negate(f32[128]{0} %param_2.37), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/batchnorm/sub_grad/Neg"}
  %bitcast.240 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %negate.52), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/batchnorm/sub_grad/Neg"}
  %param_1.48 = f32[1,128,1,1]{3,2,1,0} parameter(1)
  %multiply.28 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %bitcast.240, f32[1,128,1,1]{3,2,1,0} %param_1.48), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.17 = f32[1,128,1,1]{3,2,1,0} add(f32[1,128,1,1]{3,2,1,0} %bitcast.241, f32[1,128,1,1]{3,2,1,0} %multiply.28), metadata={op_type="AddN" op_name="tower0/gradients/AddN_194"}
  %param_0.44 = f32[1,128,1,1]{3,2,1,0} parameter(0)
  %multiply.27 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %add.17, f32[1,128,1,1]{3,2,1,0} %param_0.44), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/batchnorm/mul_grad/Mul_1"}
  ROOT %bitcast.239 = f32[128]{0} bitcast(f32[1,128,1,1]{3,2,1,0} %multiply.27), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/Reshape_grad/Reshape"}
}

%tower0_gradients_tower0_group1_block1_conv2_bn_batchnorm_mul_1_grad_Sum_1-reduction.3172 (x.3173: f32[], y.3174: f32[]) -> f32[] {
  %x.3173 = f32[] parameter(0)
  %y.3174 = f32[] parameter(1)
  ROOT %add.3175 = f32[] add(f32[] %x.3173, f32[] %y.3174)
}

%tower0_gradients_tower0_group1_block1_conv2_bn_batchnorm_add_1_grad_Sum_1-reduction.3182 (x.3183: f32[], y.3184: f32[]) -> f32[] {
  %x.3183 = f32[] parameter(0)
  %y.3184 = f32[] parameter(1)
  ROOT %add.3185 = f32[] add(f32[] %x.3183, f32[] %y.3184)
}

%fused_computation.17 (param_0.644: f32[1,128,100,152], param_1.879: f32[1,128,100,152], param_2.765: f32[1,128,100,152]) -> (f32[128], f32[128], f32[1,128,100,152]) {
  %param_2.765 = f32[1,128,100,152]{3,2,1,0} parameter(2)
  %constant_246 = f32[] constant(0), metadata={op_type="ZerosLike" op_name="tower0/gradients/tower0/rpn_losses/level2/logistic_loss/Select_grad/zeros_like"}
  %broadcast.198.clone.1 = f32[1,128,100,152]{3,2,1,0} broadcast(f32[] %constant_246), dimensions={}, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block3/conv2/Relu_grad/ReluGrad"}
  %compare.4.clone.1 = pred[1,128,100,152]{3,2,1,0} compare(f32[1,128,100,152]{3,2,1,0} %param_2.765, f32[1,128,100,152]{3,2,1,0} %broadcast.198.clone.1), direction=GT, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block1/conv2/Relu_grad/ReluGrad"}
  %param_1.879 = f32[1,128,100,152]{3,2,1,0} parameter(1)
  %select.4.clone.1 = f32[1,128,100,152]{3,2,1,0} select(pred[1,128,100,152]{3,2,1,0} %compare.4.clone.1, f32[1,128,100,152]{3,2,1,0} %param_1.879, f32[1,128,100,152]{3,2,1,0} %broadcast.198.clone.1), metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block1/conv2/Relu_grad/ReluGrad"}
  %param_0.644 = f32[1,128,100,152]{3,2,1,0} parameter(0)
  %multiply.29 = f32[1,128,100,152]{3,2,1,0} multiply(f32[1,128,100,152]{3,2,1,0} %select.4.clone.1, f32[1,128,100,152]{3,2,1,0} %param_0.644), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.18 = f32[128]{0} reduce(f32[1,128,100,152]{3,2,1,0} %multiply.29, f32[] %constant_246), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block1_conv2_bn_batchnorm_mul_1_grad_Sum_1-reduction.3172, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/batchnorm/mul_1_grad/Sum_1"}
  %reduce.84 = f32[128]{0} reduce(f32[1,128,100,152]{3,2,1,0} %select.4.clone.1, f32[] %constant_246), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block1_conv2_bn_batchnorm_add_1_grad_Sum_1-reduction.3182, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block1/conv2/bn/batchnorm/add_1_grad/Sum_1"}
  ROOT %tuple.233 = (f32[128]{0}, f32[128]{0}, f32[1,128,100,152]{3,2,1,0}) tuple(f32[128]{0} %reduce.18, f32[128]{0} %reduce.84, f32[1,128,100,152]{3,2,1,0} %select.4.clone.1)
}

%fused_computation.18 (param_0.49: f32[3,3,128,128], param_1.694: f32[3,3,128,128]) -> f32[3,3,128,128] {
  %param_0.49 = f32[3,3,128,128]{1,0,2,3} parameter(0)
  %param_1.694 = f32[3,3,128,128]{3,2,1,0} parameter(1)
  %copy.454 = f32[3,3,128,128]{1,0,2,3} copy(f32[3,3,128,128]{3,2,1,0} %param_1.694), metadata={op_name="XLA_Args"}
  %constant_315 = f32[] constant(0.0001), metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %broadcast.165 = f32[3,3,128,128]{1,0,2,3} broadcast(f32[] %constant_315), dimensions={}, metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_11_grad/Mul"}
  %multiply.30 = f32[3,3,128,128]{1,0,2,3} multiply(f32[3,3,128,128]{1,0,2,3} %copy.454, f32[3,3,128,128]{1,0,2,3} %broadcast.165), metadata={op_type="Mul" op_name="tower0/gradients/tower0/wd_cost_internals/Square_5_grad/Mul_1"}
  %add.18 = f32[3,3,128,128]{1,0,2,3} add(f32[3,3,128,128]{1,0,2,3} %param_0.49, f32[3,3,128,128]{1,0,2,3} %multiply.30), metadata={op_type="AddN" op_name="tower0/gradients/AddN_193"}
  ROOT %copy.373 = f32[3,3,128,128]{3,2,1,0} copy(f32[3,3,128,128]{1,0,2,3} %add.18), metadata={op_name="XLA_Retvals"}
}

%fused_computation.19 (param_0.52: f32[1,512,1,1], param_1.56: f32[1,512,1,1], param_2.43: f32[512], param_3.23: f32[512]) -> f32[512] {
  %param_3.23 = f32[512]{0} parameter(3)
  %bitcast.244 = f32[1,512,1,1]{3,2,1,0} bitcast(f32[512]{0} %param_3.23), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_2.43 = f32[512]{0} parameter(2)
  %negate.53 = f32[512]{0} negate(f32[512]{0} %param_2.43), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/batchnorm/sub_grad/Neg"}
  %bitcast.243 = f32[1,512,1,1]{3,2,1,0} bitcast(f32[512]{0} %negate.53), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/batchnorm/sub_grad/Neg"}
  %param_1.56 = f32[1,512,1,1]{3,2,1,0} parameter(1)
  %multiply.32 = f32[1,512,1,1]{3,2,1,0} multiply(f32[1,512,1,1]{3,2,1,0} %bitcast.243, f32[1,512,1,1]{3,2,1,0} %param_1.56), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.19 = f32[1,512,1,1]{3,2,1,0} add(f32[1,512,1,1]{3,2,1,0} %bitcast.244, f32[1,512,1,1]{3,2,1,0} %multiply.32), metadata={op_type="AddN" op_name="tower0/gradients/AddN_192"}
  %param_0.52 = f32[1,512,1,1]{3,2,1,0} parameter(0)
  %multiply.31 = f32[1,512,1,1]{3,2,1,0} multiply(f32[1,512,1,1]{3,2,1,0} %add.19, f32[1,512,1,1]{3,2,1,0} %param_0.52), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/batchnorm/mul_grad/Mul_1"}
  ROOT %bitcast.242 = f32[512]{0} bitcast(f32[1,512,1,1]{3,2,1,0} %multiply.31), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/Reshape_grad/Reshape"}
}

%tower0_gradients_tower0_group1_block1_conv3_bn_batchnorm_mul_1_grad_Sum_1-reduction.3199 (x.3200: f32[], y.3201: f32[]) -> f32[] {
  %x.3200 = f32[] parameter(0)
  %y.3201 = f32[] parameter(1)
  ROOT %add.3202 = f32[] add(f32[] %x.3200, f32[] %y.3201)
}

%tower0_gradients_tower0_group1_block1_conv3_bn_batchnorm_add_1_grad_Sum_1-reduction.3209 (x.3210: f32[], y.3211: f32[]) -> f32[] {
  %x.3210 = f32[] parameter(0)
  %y.3211 = f32[] parameter(1)
  ROOT %add.3212 = f32[] add(f32[] %x.3210, f32[] %y.3211)
}

%fused_computation.20 (param_0.643: f32[1,512,100,152], param_1.880: f32[1,512,100,152], param_2.766: f32[1,512,100,152], param_3.491: f32[1,512,100,152]) -> (f32[512], f32[512], f32[1,512,100,152]) {
  %param_3.491 = f32[1,512,100,152]{3,2,1,0} parameter(3)
  %constant_247 = f32[] constant(0), metadata={op_type="ZerosLike" op_name="tower0/gradients/tower0/rpn_losses/level2/logistic_loss/Select_grad/zeros_like"}
  %broadcast.199.clone.1 = f32[1,512,100,152]{3,2,1,0} broadcast(f32[] %constant_247), dimensions={}, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block3/output_grad/ReluGrad"}
  %compare.5.clone.1 = pred[1,512,100,152]{3,2,1,0} compare(f32[1,512,100,152]{3,2,1,0} %param_3.491, f32[1,512,100,152]{3,2,1,0} %broadcast.199.clone.1), direction=GT, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block1/output_grad/ReluGrad"}
  %param_1.880 = f32[1,512,100,152]{3,2,1,0} parameter(1)
  %param_2.766 = f32[1,512,100,152]{3,2,1,0} parameter(2)
  %add.127.clone.1 = f32[1,512,100,152]{3,2,1,0} add(f32[1,512,100,152]{3,2,1,0} %param_1.880, f32[1,512,100,152]{3,2,1,0} %param_2.766), metadata={op_type="AddN" op_name="tower0/gradients/AddN_188"}
  %select.5.clone.1 = f32[1,512,100,152]{3,2,1,0} select(pred[1,512,100,152]{3,2,1,0} %compare.5.clone.1, f32[1,512,100,152]{3,2,1,0} %add.127.clone.1, f32[1,512,100,152]{3,2,1,0} %broadcast.199.clone.1), metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block1/output_grad/ReluGrad"}
  %param_0.643 = f32[1,512,100,152]{3,2,1,0} parameter(0)
  %multiply.33 = f32[1,512,100,152]{3,2,1,0} multiply(f32[1,512,100,152]{3,2,1,0} %select.5.clone.1, f32[1,512,100,152]{3,2,1,0} %param_0.643), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.19 = f32[512]{0} reduce(f32[1,512,100,152]{3,2,1,0} %multiply.33, f32[] %constant_247), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block1_conv3_bn_batchnorm_mul_1_grad_Sum_1-reduction.3199, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/batchnorm/mul_1_grad/Sum_1"}
  %reduce.68 = f32[512]{0} reduce(f32[1,512,100,152]{3,2,1,0} %select.5.clone.1, f32[] %constant_247), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block1_conv3_bn_batchnorm_add_1_grad_Sum_1-reduction.3209, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block1/conv3/bn/batchnorm/add_1_grad/Sum_1"}
  ROOT %tuple.232 = (f32[512]{0}, f32[512]{0}, f32[1,512,100,152]{3,2,1,0}) tuple(f32[512]{0} %reduce.19, f32[512]{0} %reduce.68, f32[1,512,100,152]{3,2,1,0} %select.5.clone.1)
}

%fused_computation.21 (param_0.57: f32[1,1,128,512], param_1.695: f32[1,1,128,512]) -> f32[1,1,128,512] {
  %param_0.57 = f32[1,1,128,512]{1,0,2,3} parameter(0)
  %param_1.695 = f32[1,1,128,512]{3,2,1,0} parameter(1)
  %copy.375 = f32[1,1,128,512]{1,0,2,3} copy(f32[1,1,128,512]{3,2,1,0} %param_1.695), metadata={op_name="XLA_Args"}
  %constant_316 = f32[] constant(0.0001), metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %broadcast.166 = f32[1,1,128,512]{1,0,2,3} broadcast(f32[] %constant_316), dimensions={}, metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_2_grad/Mul"}
  %multiply.34 = f32[1,1,128,512]{1,0,2,3} multiply(f32[1,1,128,512]{1,0,2,3} %copy.375, f32[1,1,128,512]{1,0,2,3} %broadcast.166), metadata={op_type="Mul" op_name="tower0/gradients/tower0/wd_cost_internals/Square_6_grad/Mul_1"}
  %add.20 = f32[1,1,128,512]{1,0,2,3} add(f32[1,1,128,512]{1,0,2,3} %param_0.57, f32[1,1,128,512]{1,0,2,3} %multiply.34), metadata={op_type="AddN" op_name="tower0/gradients/AddN_191"}
  ROOT %copy.374 = f32[1,1,128,512]{3,2,1,0} copy(f32[1,1,128,512]{1,0,2,3} %add.20), metadata={op_name="XLA_Retvals"}
}

%fused_computation.22 (param_0.60: f32[1,128,1,1], param_1.65: f32[1,128,1,1], param_2.50: f32[128], param_3.27: f32[128]) -> f32[128] {
  %param_3.27 = f32[128]{0} parameter(3)
  %bitcast.247 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %param_3.27), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_2.50 = f32[128]{0} parameter(2)
  %negate.54 = f32[128]{0} negate(f32[128]{0} %param_2.50), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/batchnorm/sub_grad/Neg"}
  %bitcast.246 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %negate.54), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/batchnorm/sub_grad/Neg"}
  %param_1.65 = f32[1,128,1,1]{3,2,1,0} parameter(1)
  %multiply.36 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %bitcast.246, f32[1,128,1,1]{3,2,1,0} %param_1.65), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.21 = f32[1,128,1,1]{3,2,1,0} add(f32[1,128,1,1]{3,2,1,0} %bitcast.247, f32[1,128,1,1]{3,2,1,0} %multiply.36), metadata={op_type="AddN" op_name="tower0/gradients/AddN_190"}
  %param_0.60 = f32[1,128,1,1]{3,2,1,0} parameter(0)
  %multiply.35 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %add.21, f32[1,128,1,1]{3,2,1,0} %param_0.60), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/batchnorm/mul_grad/Mul_1"}
  ROOT %bitcast.245 = f32[128]{0} bitcast(f32[1,128,1,1]{3,2,1,0} %multiply.35), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/Reshape_grad/Reshape"}
}

%tower0_gradients_tower0_group1_block2_conv1_bn_batchnorm_mul_1_grad_Sum_1-reduction.3226 (x.3227: f32[], y.3228: f32[]) -> f32[] {
  %x.3227 = f32[] parameter(0)
  %y.3228 = f32[] parameter(1)
  ROOT %add.3229 = f32[] add(f32[] %x.3227, f32[] %y.3228)
}

%tower0_gradients_tower0_group1_block2_conv1_bn_batchnorm_add_1_grad_Sum_1-reduction.3236 (x.3237: f32[], y.3238: f32[]) -> f32[] {
  %x.3237 = f32[] parameter(0)
  %y.3238 = f32[] parameter(1)
  ROOT %add.3239 = f32[] add(f32[] %x.3237, f32[] %y.3238)
}

%fused_computation.23 (param_0.642: f32[1,128,100,152], param_1.881: f32[1,128,100,152], param_2.767: f32[1,128,100,152]) -> (f32[128], f32[128], f32[1,128,100,152]) {
  %param_2.767 = f32[1,128,100,152]{3,2,1,0} parameter(2)
  %constant_248 = f32[] constant(0), metadata={op_type="ZerosLike" op_name="tower0/gradients/tower0/rpn_losses/level2/logistic_loss/Select_grad/zeros_like"}
  %broadcast.200.clone.1 = f32[1,128,100,152]{3,2,1,0} broadcast(f32[] %constant_248), dimensions={}, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block3/conv2/Relu_grad/ReluGrad"}
  %compare.6.clone.1 = pred[1,128,100,152]{3,2,1,0} compare(f32[1,128,100,152]{3,2,1,0} %param_2.767, f32[1,128,100,152]{3,2,1,0} %broadcast.200.clone.1), direction=GT, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block2/conv1/Relu_grad/ReluGrad"}
  %param_1.881 = f32[1,128,100,152]{3,2,1,0} parameter(1)
  %select.6.clone.1 = f32[1,128,100,152]{3,2,1,0} select(pred[1,128,100,152]{3,2,1,0} %compare.6.clone.1, f32[1,128,100,152]{3,2,1,0} %param_1.881, f32[1,128,100,152]{3,2,1,0} %broadcast.200.clone.1), metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block2/conv1/Relu_grad/ReluGrad"}
  %param_0.642 = f32[1,128,100,152]{3,2,1,0} parameter(0)
  %multiply.37 = f32[1,128,100,152]{3,2,1,0} multiply(f32[1,128,100,152]{3,2,1,0} %select.6.clone.1, f32[1,128,100,152]{3,2,1,0} %param_0.642), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.20 = f32[128]{0} reduce(f32[1,128,100,152]{3,2,1,0} %multiply.37, f32[] %constant_248), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block2_conv1_bn_batchnorm_mul_1_grad_Sum_1-reduction.3226, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/batchnorm/mul_1_grad/Sum_1"}
  %reduce.86 = f32[128]{0} reduce(f32[1,128,100,152]{3,2,1,0} %select.6.clone.1, f32[] %constant_248), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block2_conv1_bn_batchnorm_add_1_grad_Sum_1-reduction.3236, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block2/conv1/bn/batchnorm/add_1_grad/Sum_1"}
  ROOT %tuple.231 = (f32[128]{0}, f32[128]{0}, f32[1,128,100,152]{3,2,1,0}) tuple(f32[128]{0} %reduce.20, f32[128]{0} %reduce.86, f32[1,128,100,152]{3,2,1,0} %select.6.clone.1)
}

%fused_computation.24 (param_0.65: f32[1,1,512,128], param_1.696: f32[1,1,512,128]) -> f32[1,1,512,128] {
  %param_0.65 = f32[1,1,512,128]{1,0,2,3} parameter(0)
  %param_1.696 = f32[1,1,512,128]{3,2,1,0} parameter(1)
  %copy.377 = f32[1,1,512,128]{1,0,2,3} copy(f32[1,1,512,128]{3,2,1,0} %param_1.696), metadata={op_name="XLA_Args"}
  %constant_317 = f32[] constant(0.0001), metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %broadcast.167 = f32[1,1,512,128]{1,0,2,3} broadcast(f32[] %constant_317), dimensions={}, metadata={op_type="Const" op_name="tower0/gradients/tower0/wd_cost_internals/Square_10_grad/Mul"}
  %multiply.38 = f32[1,1,512,128]{1,0,2,3} multiply(f32[1,1,512,128]{1,0,2,3} %copy.377, f32[1,1,512,128]{1,0,2,3} %broadcast.167), metadata={op_type="Mul" op_name="tower0/gradients/tower0/wd_cost_internals/Square_7_grad/Mul_1"}
  %add.22 = f32[1,1,512,128]{1,0,2,3} add(f32[1,1,512,128]{1,0,2,3} %param_0.65, f32[1,1,512,128]{1,0,2,3} %multiply.38), metadata={op_type="AddN" op_name="tower0/gradients/AddN_189"}
  ROOT %copy.376 = f32[1,1,512,128]{3,2,1,0} copy(f32[1,1,512,128]{1,0,2,3} %add.22), metadata={op_name="XLA_Retvals"}
}

%fused_computation.25 (param_0.68: f32[1,128,1,1], param_1.74: f32[1,128,1,1], param_2.57: f32[128], param_3.31: f32[128]) -> f32[128] {
  %param_3.31 = f32[128]{0} parameter(3)
  %bitcast.250 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %param_3.31), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/batchnorm/mul_1_grad/Reshape_1"}
  %param_2.57 = f32[128]{0} parameter(2)
  %negate.55 = f32[128]{0} negate(f32[128]{0} %param_2.57), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/batchnorm/sub_grad/Neg"}
  %bitcast.249 = f32[1,128,1,1]{3,2,1,0} bitcast(f32[128]{0} %negate.55), metadata={op_type="Neg" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/batchnorm/sub_grad/Neg"}
  %param_1.74 = f32[1,128,1,1]{3,2,1,0} parameter(1)
  %multiply.40 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %bitcast.249, f32[1,128,1,1]{3,2,1,0} %param_1.74), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/batchnorm/mul_2_grad/Mul_1"}
  %add.23 = f32[1,128,1,1]{3,2,1,0} add(f32[1,128,1,1]{3,2,1,0} %bitcast.250, f32[1,128,1,1]{3,2,1,0} %multiply.40), metadata={op_type="AddN" op_name="tower0/gradients/AddN_187"}
  %param_0.68 = f32[1,128,1,1]{3,2,1,0} parameter(0)
  %multiply.39 = f32[1,128,1,1]{3,2,1,0} multiply(f32[1,128,1,1]{3,2,1,0} %add.23, f32[1,128,1,1]{3,2,1,0} %param_0.68), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/batchnorm/mul_grad/Mul_1"}
  ROOT %bitcast.248 = f32[128]{0} bitcast(f32[1,128,1,1]{3,2,1,0} %multiply.39), metadata={op_type="Reshape" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/Reshape_grad/Reshape"}
}

%tower0_gradients_tower0_group1_block2_conv2_bn_batchnorm_mul_1_grad_Sum_1-reduction.3253 (x.3254: f32[], y.3255: f32[]) -> f32[] {
  %x.3254 = f32[] parameter(0)
  %y.3255 = f32[] parameter(1)
  ROOT %add.3256 = f32[] add(f32[] %x.3254, f32[] %y.3255)
}

%tower0_gradients_tower0_group1_block2_conv2_bn_batchnorm_add_1_grad_Sum_1-reduction.3263 (x.3264: f32[], y.3265: f32[]) -> f32[] {
  %x.3264 = f32[] parameter(0)
  %y.3265 = f32[] parameter(1)
  ROOT %add.3266 = f32[] add(f32[] %x.3264, f32[] %y.3265)
}

%fused_computation.26 (param_0.641: f32[1,128,100,152], param_1.882: f32[1,128,100,152], param_2.768: f32[1,128,100,152]) -> (f32[128], f32[128], f32[1,128,100,152]) {
  %param_2.768 = f32[1,128,100,152]{3,2,1,0} parameter(2)
  %constant_249 = f32[] constant(0), metadata={op_type="ZerosLike" op_name="tower0/gradients/tower0/rpn_losses/level2/logistic_loss/Select_grad/zeros_like"}
  %broadcast.201.clone.1 = f32[1,128,100,152]{3,2,1,0} broadcast(f32[] %constant_249), dimensions={}, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block3/conv2/Relu_grad/ReluGrad"}
  %compare.7.clone.1 = pred[1,128,100,152]{3,2,1,0} compare(f32[1,128,100,152]{3,2,1,0} %param_2.768, f32[1,128,100,152]{3,2,1,0} %broadcast.201.clone.1), direction=GT, metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block2/conv2/Relu_grad/ReluGrad"}
  %param_1.882 = f32[1,128,100,152]{3,2,1,0} parameter(1)
  %select.7.clone.1 = f32[1,128,100,152]{3,2,1,0} select(pred[1,128,100,152]{3,2,1,0} %compare.7.clone.1, f32[1,128,100,152]{3,2,1,0} %param_1.882, f32[1,128,100,152]{3,2,1,0} %broadcast.201.clone.1), metadata={op_type="ReluGrad" op_name="tower0/gradients/tower0/group1/block2/conv2/Relu_grad/ReluGrad"}
  %param_0.641 = f32[1,128,100,152]{3,2,1,0} parameter(0)
  %multiply.41 = f32[1,128,100,152]{3,2,1,0} multiply(f32[1,128,100,152]{3,2,1,0} %select.7.clone.1, f32[1,128,100,152]{3,2,1,0} %param_0.641), metadata={op_type="Mul" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/batchnorm/mul_1_grad/Mul_1"}
  %reduce.21 = f32[128]{0} reduce(f32[1,128,100,152]{3,2,1,0} %multiply.41, f32[] %constant_249), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block2_conv2_bn_batchnorm_mul_1_grad_Sum_1-reduction.3253, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/batchnorm/mul_1_grad/Sum_1"}
  %reduce.85 = f32[128]{0} reduce(f32[1,128,100,152]{3,2,1,0} %select.7.clone.1, f32[] %constant_249), dimensions={0,2,3}, to_apply=%tower0_gradients_tower0_group1_block2_conv2_bn_batchnorm_add_1_grad_Sum_1-reduction.3263, metadata={op_type="Sum" op_name="tower0/gradients/tower0/group1/block2/conv2/bn/batchnorm/add_1_grad/Sum_1"}
